Функция ОбработкаВыражений(страница) Экспорт     
	//Извлечение тегов @обработка@ из тела HTML страницы и вставление результатов

	результат = страница;
	
	RegExp = новый COMОбъект("VBScript.RegExp");
	
	RegExp.IgnoreCase = 1; //Игнорировать регистр
	RegExp.Global = 1; //Поиск всех вхождений шаблона
	RegExp.MultiLine = 0; //Многострочный режим
	
	выражение = "@(.*)@";
	
	RegExp.Pattern = выражение; //Ищем вхождение
	Matches=RegExp.Execute(результат);
	
	//Параметры = Новый Структура
	Параметры = ПолучитьПараметрыСессии();
	
	П = Новый Соответствие();
	Для Каждого параметр Из Параметры Цикл
		Попытка
			результатВыражения = ""; 
			фнк = """" + параметр.Значение + """";          
			Выполнить("результатВыражения = " + фнк);
			
			П[параметр.Ключ] = результатВыражения;
		Исключение
			Сообщить("Ошибка вычисления значения параметра. [" + фнк + "]");
		КонецПопытки;
	КонецЦикла;		
	
	Для индекс = 0 По Matches.Count-1 Цикл
		выражение = Matches.Item(индекс).Value;
		результатВыражения = "";
		Попытка
			фнк = СтрЗаменить(выражение, "@", "");
			Выполнить("результатВыражения = " + фнк);
		Исключение
			результатВыражения = "{" + выражение + " ошибка вычисления}";
		КонецПопытки;
		
		результат = СтрЗаменить(результат, выражение, результатВыражения);
	КонецЦикла;
	                                                        
	Возврат результат;
КонецФункции	

Функция ПроектыКМ(КМ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.Ссылка КАК Ссылка,
		|	Проекты.ГодПроекта КАК ГодПроекта,
		|	Проекты.Статус КАК Статус,
		|	Проекты.СтатусЗадач КАК СтатусЗадач
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	Проекты.МенеджерПроекта.Код = &КМ";
	
	Запрос.УстановитьПараметр("КМ", КМ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ТекстHTML = Новый ТекстовыйДокумент;
	Пока Выборка.Следующий() Цикл
		ДобавитьТекстHTML(ТекстHTML, Выборка.Ссылка, Выборка.Ссылка.Наименование + " (" + Выборка.Статус + ")" );
	КонецЦикла;

	возврат ТекстHTML.ПолучитьТекст();
КонецФункции	

Процедура ДобавитьТекстHTML(ТекстHTML, Элемент, Текст);
    // Ссылку будем формировать хитро:
    // Предполагаем что символ "-" не входит в имена объектов метаданных,
    // учавствующих в формировании html
    // Тогда ссылка будет иметь следующий вид:
    // Номенклатура-d341d377-b3b1-11dc-a100-0011d85708ff
    // Передавать нашу ссылку будем через атрибут id
    СсылкаНаЭлемент = Элемент.Метаданные().Имя+"-"
    +Элемент.Ссылка.УникальныйИдентификатор();
    ТекстHTML.ДобавитьСтроку("<A id=""" + СсылкаНаЭлемент + """ href= """
    + Элемент + """ >"+Текст+"</A><BR>");
КонецПроцедуры

Функция ПолучитьПараметрыСессии()
	параметры = Новый Структура();
	КМ = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
	параметры.Вставить("КМ", КМ);
	Возврат параметры;
КонецФункции