
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Приоритет = Перечисления.ПриоритетыИнцидентов.Нормальный;
	Если 		ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ЗадачиПроектовСтруктура") Тогда
		Владелец 	= ДанныеЗаполнения.Ссылка;
	ИначеЕсли 	ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Инциденты") Тогда
		Владелец 	= ДанныеЗаполнения.Владелец.Ссылка;
		Основание 	= ДанныеЗаполнения.Ссылка;
		Приоритет 	= ДанныеЗаполнения.Приоритет;
	КонецЕсли;
	
	ДатаНачала		= ТекущаяДата();
	ФизическоеЛицо 	= ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
	
КонецПроцедуры
