Функция РодительКалькуляциПланаВознаграждения( Исполнитель, Проект )
	РодительКЗ 	= СоздатьИерархию( "КалькуляторПланаВознаграждения", 
									СокрЛП( Исполнитель ) + "/" + 
									СокрЛП( Проект ));
									
	Возврат РодительКЗ;
КонецФункции



Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ИсполнительДокумента 	= ПараметрыСеанса.ТекущийПользователь;
	
	Если ЗначениеЗаполнено( ДанныеЗаполнения ) Тогда
		Если ТипЗнч( ДанныеЗаполнения ) = Тип("СправочникСсылка.ЗадачиПроектов") Тогда
		// из задачи проекта
			
			ЗадачаПроекта	= ДанныеЗаполнения.Ссылка;
			
		Иначе
		// из документа
			ЗадачаПроекта	= ДанныеЗаполнения.Ссылка.ЗадачаПроекта;
			// 
			Начисления.Загрузить( ДанныеЗаполнения.Начисления.Выгрузить());
		
			
		КонецЕсли;
		
		Наименование 	= ЗадачаПроекта.Наименование;
		Родитель		= РодительКалькуляциПланаВознаграждения( ИсполнительДокумента, ЗадачаПроекта.Владелец);
		
	КонецЕсли;
КонецПроцедуры
