
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.НачислениеФондаПодразделений.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачислениеФондаПодразделений.Дата,
	|	НачислениеФондаПодразделений.ИсполнительДокумента,
	|	НачислениеФондаПодразделений.Номер,
	|	НачислениеФондаПодразделений.ПериодРегистрации,
	|	НачислениеФондаПодразделений.Подразделение,
	|	НачислениеФондаПодразделений.Начисления.(
	|		НомерСтроки,
	|		ЗадачаПроекта,
	|		Сумма,
	|		Процент,
	|		БазаРаспределения,
	|		ЗадачаПроекта.Владелец КАК Проект,
	|		ЗадачаПроекта.Подразделение КАК ПодразделениеЗадачи
	|	)
	|ИЗ
	|	Документ.НачислениеФондаПодразделений КАК НачислениеФондаПодразделений
	|ГДЕ
	|	НачислениеФондаПодразделений.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьНачисленияШапка = Макет.ПолучитьОбласть("НачисленияШапка");
	ОбластьНачисления = Макет.ПолучитьОбласть("Начисления");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьНачисленияШапка);
		ВыборкаНачисления = Выборка.Начисления.Выбрать();
		Пока ВыборкаНачисления.Следующий() Цикл
			ОбластьНачисления.Параметры.Заполнить(ВыборкаНачисления);
			ТабДок.Вывести(ОбластьНачисления, ВыборкаНачисления.Уровень());
		КонецЦикла;
		
		// итого по таблице
		тзИтого = Выборка.Начисления.Выгрузить();
		тзИтого.Свернуть("", "Сумма,БазаРаспределения");
		ОбластьНачисленияПодвал = Макет.ПолучитьОбласть("НачисленияПодвал");
		ОбластьНачисленияПодвал.Параметры.Заполнить(тзИтого[0]);
		ТабДок.Вывести(ОбластьНачисленияПодвал, ВыборкаНачисления.Уровень());

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
