
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ИсполнительДокумента 	= ПараметрыСеанса.ТекущийПользователь;
	ПериодРегистрации	 	= НачалоМесяца( ТекущаяДата());
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ФондПодразделений Приход
	Движения.ФондПодразделений.Записывать = Истина;
	Движение = Движения.ФондПодразделений.Добавить();
	Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
	//Движение.Период 		= ПериодРегистрации;
	Движение.Период 		= Дата;
	Движение.Подразделение 	= Подразделение;
	Движение.Год			= Год(ПериодРегистрации);
	Движение.Сумма			= Начисления.Итог("Сумма");

	СтатьяСметы = Справочники.СтатьиСметы.Начисление_ФондПодр;
	// регистр БюджетПоМесяцам 
	Движения.БюджетПоМесяцам.Записывать = Истина;
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Если ТекСтрокаНачисления.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		Движение = Движения.БюджетПоМесяцам.Добавить();
		Движение.Период 		= Дата;
		Движение.ЗадачаПроекта 	= ТекСтрокаНачисления.ЗадачаПроекта;
		Движение.СтатьяСметы	= СтатьяСметы;
		Движение.ТипСуммы		= Перечисления.ТипСуммыБюджета.Факт;
		Движение.Месяц 			= ПериодРегистрации;
		//
		Движение.Сумма 			= ТекСтрокаНачисления.Сумма;
		Движение.РКО			= Истина;
	КонецЦикла;
	
	
КонецПроцедуры

