
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ИсполнительДокумента 	= ПараметрыСеанса.ТекущийПользователь;
	ПериодРегистрации	 	= НачалоМесяца( ТекущаяДата());
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр БюджетПоМесяцам 
	Движения.БюджетПоМесяцам.Записывать = Истина;
	Для Каждого ТекСтрокаРаспределение Из Начисления Цикл
		Если ТекСтрокаРаспределение.Сумма = 0 Тогда Продолжить; КонецЕсли;
		
		сСметы =  Новый Соответствие;
		сСтатей = Новый Соответствие;
		пСтатей = Новый Соответствие;            
		oСтатей = Новый Соответствие;
		УП_СметаПроекта.ПодготовкаФактБюджета(сСметы, сСтатей, пСтатей, oСтатей, ТекСтрокаРаспределение.ЗадачаПроекта);	
		
		Начисление_ФондПодр = Справочники.СтатьиСметы.Начисление_ФондПодр.ИмяПредопределенныхДанных;
		сСтатей[Начисление_ФондПодр] = ТекСтрокаРаспределение.Сумма; 
		
		УП_СметаПроекта.ПроведениеФактБюджета(сСметы, сСтатей, oСтатей, Движения, ТекСтрокаРаспределение.ЗадачаПроекта,
			ПериодРегистрации, Дата);
	КонецЦикла;	
	
	// регистр ФондПодразделений Приход
	Движения.ФондПодразделений.Записывать = Истина;
	Движение = Движения.ФондПодразделений.Добавить();
	Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
	//Движение.Период 		= ПериодРегистрации;
	Движение.Период 		= Дата;
	Движение.Подразделение 	= Подразделение;
	Движение.Год			= Год(ПериодРегистрации);
	Движение.Сумма			= Начисления.Итог("Сумма");

	//СтатьяСметы = Справочники.СтатьиСметы.Начисление_ФондПодр;
	//// регистр БюджетПоМесяцам 
	//Движения.БюджетПоМесяцам.Записывать = Истина;
	//Для Каждого ТекСтрокаНачисления Из Начисления Цикл
	//	Если ТекСтрокаНачисления.Сумма = 0 Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	Движение = Движения.БюджетПоМесяцам.Добавить();
	//	Движение.Период 		= Дата;
	//	Движение.ЗадачаПроекта 	= ТекСтрокаНачисления.ЗадачаПроекта;
	//	Движение.СтатьяСметы	= СтатьяСметы;
	//	Движение.ТипСуммы		= Перечисления.ТипСуммыБюджета.Факт;
	//	Движение.Месяц 			= ПериодРегистрации;
	//	//
	//	Движение.Сумма 			= ТекСтрокаНачисления.Сумма;
	//	Движение.РКО			= Истина;
	//КонецЦикла;
	
	
КонецПроцедуры

