
Процедура Абонемент(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Абонемент)
	Макет = Документы.Лицензия.ПолучитьМакет("Абонемент");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЛицПарус.ВариантРасчетаЛО,
	|	ЛицПарус.ВидНоменклатуры,
	|	ЛицПарус.Дата,
	|	ЛицПарус.ДатаДоговора,
	//|	ЛицПарус.ДоговорКонтрагента,
	|	ЛицПарус.ИсполнительДокумента,
	|	ЛицПарус.Комментарий,
	|	ЛицПарус.Контрагент,
	|	ЛицПарус.Лицензия,
	|	ЛицПарус.НеКонтролировать,
	|	ЛицПарус.Номер,
	|	ЛицПарус.НомерБланка,
	|	ЛицПарус.НомерДоговора,
	|	ЛицПарус.ОкончаниеЛицензии,
	|	ЛицПарус.Организация,
	|	ЛицПарус.Состав.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Количество,
	|		Цена,
	|		ЛицПарус.Состав.Цена * 0.3 КАК ЦенаЛО,
	|		Сумма,
	|		ЛицПарус.Состав.Сумма * 0.3 КАК СуммаЛО,
	|		КоличествоПарус
	|	)
	|ИЗ
	|	Документ.Лицензия КАК ЛицПарус
	|ГДЕ
	|	ЛицПарус.Ссылка В(&СсылкаДок)";
	
	Запрос.Параметры.Вставить("СсылкаДок", Ссылка);
	
	
	Выборка = Запрос.Выполнить().Выбрать();

	Шапка 				= Макет.ПолучитьОбласть("Шапка");
	ОбластьСоставШапка 	= Макет.ПолучитьОбласть("СоставШапка");
	ОбластьСостав 		= Макет.ПолучитьОбласть("Состав");
	ОбластьПодвал 		= Макет.ПолучитьОбласть("Подвал");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		Шапка.Параметры.Заполнить(Выборка);
		Шапка.Параметры.ПечСрокДействия = "с " + Формат(Выборка.Дата, "Д ДДММГГГГ") + " по " + Формат(Выборка.ОкончаниеЛицензии, "Д ДДММГГГГ");
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ИтСуммаЛО = 0;

		ТабДок.Вывести(ОбластьСоставШапка);
		ВыборкаСостав = Выборка.Состав.Выбрать();
		Пока ВыборкаСостав.Следующий() Цикл
			ОбластьСостав.Параметры.Заполнить(ВыборкаСостав);
			ТабДок.Вывести(ОбластьСостав, ВыборкаСостав.Уровень());
			
			ИтСуммаЛО = ИтСуммаЛО + ВыборкаСостав.СуммаЛО;
		КонецЦикла;

		ОбластьПодвал.Параметры.ИтСуммаЛО = ИтСуммаЛО;
		ТабДок.Вывести(ОбластьПодвал, ВыборкаСостав.Уровень());
		
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
