&НаСервереБезКонтекста
Функция  ПересчетСуммыДокументов( Договор )

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ДокументУТ.СуммаДокумента) КАК СуммаДокументов
		|ИЗ
		|	Документ.ДокументУТ КАК ДокументУТ
		|ГДЕ
		|	ДокументУТ.Проведен
		|	И ДокументУТ.Договор = &Договор";

	Запрос.УстановитьПараметр("Договор", Договор);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СуммаДокументов;
	КонецЦикла;
	Возврат 0;	
КонецФункции

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	СуммаДокументов = ПересчетСуммыДокументов( Договор );
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СуммаДокументов = ПересчетСуммыДокументов( Договор );
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Договор = ЭтаФорма.Параметры.Отбор["Договор"];
КонецПроцедуры
