 &НаСервере
Процедура ОбновитьИсториюИнцидента(Инцидент)
    ЭлементОтбора = ИсторияИнцидента.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Инцидент");
    ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.Использование    = Истина;
    ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
    ЭлементОтбора.ПравоеЗначение   = Инцидент;
КонецПроцедуры   


&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.Список.ТекущиеДанные;
	
	ОбновитьИсториюИнцидента(?(ТекДанные = Неопределено, Неопределено, ТекДанные.Ссылка));
КонецПроцедуры

