
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ИсполнительДокумента = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Месяц 		= НачалоМесяца(ПериодРегистрации);
	ТипСуммы 	= Перечисления.ТипСуммыБюджета.Факт;
	
	// регистр БюджетПоМесяцам 
	Движения.БюджетПоМесяцам.Записывать = Истина;
	Для Каждого ТекСтрокаНачисление Из Начисление Цикл
		Движение = Движения.БюджетПоМесяцам.Добавить();
		Движение.Период 		= Дата;
		Движение.ЗадачаПроекта 	= ТекСтрокаНачисление.ЗадачаПроекта;
		Движение.СтатьяСметы 	= СтатьяНачисления;
		Движение.ТипСуммы 		= ТипСуммы;
		Движение.Месяц 			= Месяц;
		//
		Движение.Сумма 			= ТекСтрокаНачисление.СуммаНачислено  +  ТекСтрокаНачисление.СуммаНачисленоВычета;
		Движение.РКО			= Истина;
		
	КонецЦикла;

	
	
КонецПроцедуры
