//ФормаОтчета
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ГодЗадач = Год(ТекущаяДата());
КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	Для Каждого Эл ИЗ Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если Строка(Эл.Параметр) = "ГодЗадач" Тогда
			Эл.Значение = ГодЗадач;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "ТиповыеЗадачи" Тогда
			Эл.Значение = ТиповыеЗадачи;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "СтатусыПроектов" Тогда
			Эл.Значение = СтатусыПроектов;
		КонецЕсли;
		// Добавлено 28.05.2018 по задаче #129698 Гумедин А.Г.
		Если Строка(Эл.Параметр) = "Кураторы" Тогда
			Эл.Значение = Кураторы;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "Директора" Тогда
			Эл.Значение = Директора;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "Менеджеры" Тогда
			Эл.Значение = Менеджеры;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "Подразделения" Тогда
			Эл.Значение = Подразделения;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "ВидыЗадач" Тогда
			Эл.Значение = ВидыЗадач;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "ВидыНоменклатуры" Тогда
			Эл.Значение = ВидыНоменклатуры;
		КонецЕсли;
		//////////////////////////////////////////////////////
	КонецЦикла;
	
	Для Каждого Эл ИЗ Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		Если Строка(Эл.Параметр) = "ГодЗадач" Тогда
			Эл.Значение = ГодЗадач;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "ТиповыеЗадачи" Тогда
			Эл.Значение = ТиповыеЗадачи;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "СтатусыПроектов" Тогда
			Эл.Значение = СтатусыПроектов;
		КонецЕсли;
		// Добавлено 28.05.2018 по задаче #129698 Гумедин А.Г.
		Если Строка(Эл.Параметр) = "Кураторы" Тогда
			Эл.Значение = Кураторы;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "Директора" Тогда
			Эл.Значение = Директора;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "Менеджеры" Тогда
			Эл.Значение = Менеджеры;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "Подразделения" Тогда
			Эл.Значение = Подразделения;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "ВидыЗадач" Тогда
			Эл.Значение = ВидыЗадач;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "ВидыНоменклатуры" Тогда
			Эл.Значение = ВидыНоменклатуры;
		КонецЕсли;
		//////////////////////////////////////////////////////
	КонецЦикла;
	
	//	СкомпоноватьРезультат();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	ПриОбновленииСоставаПользовательскихНастроекНаСервере("");
КонецПроцедуры
