//ФормаОтчета
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ГодЗадач = Год(ТекущаяДата());
КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	Для Каждого Эл ИЗ Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если Строка(Эл.Параметр) = "ГодЗадач" Тогда
			Эл.Значение = ГодЗадач;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "ТиповыеЗадачи" И ТиповыеЗадачи.Количество() > 0 Тогда
			Эл.Значение = ТиповыеЗадачи;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "СтатусыПроектов" И СтатусыПроектов.Количество() > 0 Тогда
			Эл.Значение = СтатусыПроектов;
		КонецЕсли;
		// Добавлено 28.05.2018 по задаче #129698 Гумедин А.Г.
		Если Строка(Эл.Параметр) = "Кураторы" И Кураторы.Количество() > 0 Тогда
			Эл.Значение = Кураторы;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "Директора" И Директора.Количество() > 0 Тогда
			Эл.Значение = Директора;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "Менеджеры" И Менеджеры.Количество() > 0 Тогда
			Эл.Значение = Менеджеры;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "Подразделения" И Подразделения.Количество() > 0 Тогда
			Эл.Значение = Подразделения;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "ВидыЗадач" И ВидыЗадач.Количество() > 0 Тогда
			Эл.Значение = ВидыЗадач;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "ВидыНоменклатуры" И ВидыНоменклатуры.Количество() > 0 Тогда
			Эл.Значение = ВидыНоменклатуры;
		КонецЕсли;
		//////////////////////////////////////////////////////
	КонецЦикла;
	
	Для Каждого Эл ИЗ Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		Если Строка(Эл.Параметр) = "ГодЗадач" Тогда
			Эл.Значение = ГодЗадач;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "ТиповыеЗадачи" И ТиповыеЗадачи.Количество() > 0 Тогда
			Эл.Значение = ТиповыеЗадачи;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "СтатусыПроектов" И СтатусыПроектов.Количество() > 0 Тогда
			Эл.Значение = СтатусыПроектов;
		КонецЕсли;
		// Добавлено 28.05.2018 по задаче #129698 Гумедин А.Г.
		Если Строка(Эл.Параметр) = "Кураторы" И Кураторы.Количество() > 0 Тогда
			Эл.Значение = Кураторы;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "Директора" И Директора.Количество() > 0 Тогда
			Эл.Значение = Директора;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "Менеджеры" И Менеджеры.Количество() > 0 Тогда
			Эл.Значение = Менеджеры;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "Подразделения" И Подразделения.Количество() > 0 Тогда
			Эл.Значение = Подразделения;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "ВидыЗадач" И ВидыЗадач.Количество() > 0 Тогда
			Эл.Значение = ВидыЗадач;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "ВидыНоменклатуры" И ВидыНоменклатуры.Количество() > 0 Тогда
			Эл.Значение = ВидыНоменклатуры;
		КонецЕсли;
		//////////////////////////////////////////////////////
	КонецЦикла;
	
	//	СкомпоноватьРезультат();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	ПриОбновленииСоставаПользовательскихНастроекНаСервере("");
КонецПроцедуры
