
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ИсполнительДокумента = ПараметрыСеанса.ТекущийПользователь;
	МесяцНачисления		 = ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), -1);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	СтатьяРасходыНаВыплатуКР = Справочники.СтатьиСметы.РасходыПоВыплатеКМ;

	// регистр Бюджет по месяцам 
	Движения.БюджетПоМесяцам.Записывать = Истина;
	Для Каждого ТекСтрокаРаспределение Из Распределение Цикл
		Движение 				= Движения.БюджетПоМесяцам.Добавить();
		Движение.Период 		= Дата;
		Движение.ЗадачаПроекта 	= ТекСтрокаРаспределение.ЗадачаПроекта;
		Движение.СтатьяСметы 	= СтатьяРасходыНаВыплатуКР;
		Движение.ТипСуммы 		= Перечисления.ТипСуммыБюджета.Факт;
		Движение.Месяц			= НачалоМесяца(МесяцНачисления);
		Движение.Сумма 			= ТекСтрокаРаспределение.Сумма;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
	И НЕ ВсеЗадачиВУказанномСтатусе( Перечисления.СтатусыПроектов.ВРаботе, 
										Ссылка.Распределение.Выгрузить(, "ЗадачаПроекта") ) Тогда
		Сообщение = Новый СообщениеПользователю;								
		Сообщение.Текст = "Не все проекты в статусе " + Перечисления.СтатусыПроектов.ВРаботе;
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;

КонецПроцедуры
