Функция РодительКалькуляцийЗадач( Проект )
	Исполнитель	= ПараметрыСеанса.ТекущийПользователь;
	РодительКЗ 	= СоздатьИерархию( "КалькуляторСметы", 
									СокрЛП( Исполнитель ) + "/" + 
									СокрЛП( Проект.Наименование ));
									
	Возврат РодительКЗ;
КонецФункции

// копируем задачу
Процедура СоздатьКалькуляциюПоСметеЗадачи( СметаЗадачиПроекта );
	ЗадачаПроекта 	= СметаЗадачиПроекта.ЗадачаПроекта;
	Исполнитель 	= ПараметрыСеанса.ТекущийПользователь;
	РодительКЗ 		= РодительКалькуляцийЗадач( ЗадачаПроекта.Владелец );
				
			
	СпрОб = Справочники.КалькуляторСметы.СоздатьЭлемент();
	СпрОб.Родитель 		= РодительКЗ;
	СпрОб.Наименование	= ЗадачаПроекта.Наименование;
	СпрОб.ТиповаяЗадача	= ЗадачаПроекта.ТиповаяЗадача;
	СпрОб.ГодПроекта	= ЗадачаПроекта.Владелец.ГодПроекта;
	СпрОб.Исполнитель	= Исполнитель;
	
	// смета
	Для Каждого СтрСЗП ИЗ СметаЗадачиПроекта.Расчет Цикл
		СтрКС = СпрОб.Расчет.Добавить();
		ЗаполнитьЗначенияСвойств( СтрКС, СтрСЗП );
	КонецЦикла;
	Попытка
		СпрОб.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
		
КонецПроцедуры


// создаем схему в папке Менеджер/Год/Проект
Процедура СоздатьКопиюПроектаВКалькуляторе( Проект )
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СметаДокументы.Документ КАК СметаЗадачиПроекта
		|ИЗ
		|	Документ.Смета.Документы КАК СметаДокументы
		|ГДЕ
		|	СметаДокументы.Ссылка.Проект = &Проект
		|	И СметаДокументы.Документ.Проведен";

	Запрос.УстановитьПараметр("Проект", Проект);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// создаем калькуляцию по смете задачи проекта
		СоздатьКалькуляциюПоСметеЗадачи( ВыборкаДетальныеЗаписи.СметаЗадачиПроекта );
	КонецЦикла;
								
	
КонецПроцедуры

// создаем схему в папке Менеджер/Год/Проект
Процедура СоздатьКопиюЗадачиПроектаВКалькуляторе( ЗадачаПроекта )
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СметаЗадачиПроекта.Ссылка КАК СметаЗадачиПроекта
		|ИЗ
		|	Документ.СметаЗадачиПроекта КАК СметаЗадачиПроекта
		|ГДЕ
		|	СметаЗадачиПроекта.ЗадачаПроекта = &ЗадачаПроекта
		|	И СметаЗадачиПроекта.Проведен";

	Запрос.УстановитьПараметр("ЗадачаПроекта", ЗадачаПроекта);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// создаем калькуляцию по смете задачи проекта
		СоздатьКалькуляциюПоСметеЗадачи( ВыборкаДетальныеЗаписи.СметаЗадачиПроекта );
	КонецЦикла;
								
	
КонецПроцедуры



Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Проекты") Тогда
		СоздатьКопиюПроектаВКалькуляторе( ДанныеЗаполнения );
		СтандартнаяОбработка = Ложь;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Калькуляции для смет задач проекта " + Символы.ПС + 
						  СокрЛП( ДанныеЗаполнения )+ Символы.ПС + 
						  "созданы";
		Сообщение.Сообщить();
		Возврат;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ЗадачиПроектов") Тогда
		СоздатьКопиюЗадачиПроектаВКалькуляторе( ДанныеЗаполнения );
		СтандартнаяОбработка = Ложь;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Калькуляция для сметы задачи проекта " + Символы.ПС + 
						  СокрЛП( ДанныеЗаполнения )+ Символы.ПС + 
						  "создана";
						  
		Сообщение.Сообщить();
		Возврат;
		
		
		
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		ГодПроекта 	= Год( ТекущаяДата() );
		Исполнитель = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры
