
Процедура ПриЗаписи(Отказ)
	// проверка заполнения нужных полей
	Если ТипРасчетаСрокаРаботы = Перечисления.ТипыРасчетаСрокаРабот.Автоматически Тогда
		Если 	ТипОграничения = Перечисления.ТипыОграниченияРабот.НачалоНеПозднее
		или	 	ТипОграничения = Перечисления.ТипыОграниченияРабот.НачалоНеРанее
		или	 	ТипОграничения = Перечисления.ТипыОграниченияРабот.ФиксированноеНачало Тогда
			Если НЕ ЗначениеЗаполнено( РаннийСтарт ) Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не заполнена дата начала работы!";
				Сообщение.Сообщить();
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
		ИначеЕсли	ТипОграничения = Перечисления.ТипыОграниченияРабот.ОкончаниеНеПозднее
		или			ТипОграничения = Перечисления.ТипыОграниченияРабот.ОкончаниеНеРанее
		или			ТипОграничения = Перечисления.ТипыОграниченияРабот.ФиксированноеОкончание Тогда
			Если НЕ ЗначениеЗаполнено( ПозднийФиниш ) Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не заполнена дата окончания работы!";
				Сообщение.Сообщить();
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		
		
		КонецЕсли;
	КонецЕсли;
	
	// если работа стала не суммарная, то это не затрагивает другие работы
	// т.к. не суммарной может самостоятельно новая работа
	// или при изменении других работ
	Если ЗначениеЗаполнено( Ссылка.Родитель ) Тогда
		Если УП_РаботыСервер.РазрешеноСделатьРаботуСуммарной( Ссылка.Родитель ) Тогда
			
			РодительОбъект = Ссылка.Родитель.ПолучитьОбъект();
			//ЗаблокироватьДанныеДляРедактирования(РодительОбъект.Ссылка);
			РодительОбъект.Суммарная	= Истина;
			РодительОбъект.Записать();
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Работа " + Ссылка.Родитель + Символы.ПС + 
							  "не может стать суммарной, т.к. используется в документах или связях работ";
			Сообщение.Сообщить();
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// пересчет сроков работ
	//УП_РаботыСервер.РасчитатьСрокиРабот( Ссылка.Владелец );
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	// родитель может стать не суммарной работой,
	// если текущая работа была последним потомком
	Если НЕ УП_РаботыСервер.ИзменилиОсиротевшегоРодителя( Ссылка ) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ТипРасчетаСрокаРаботы <> Перечисления.ТипыРасчетаСрокаРабот.Автоматически Тогда
		ПроверяемыеРеквизиты.Удалить( ПроверяемыеРеквизиты.Найти( "ТипОграничения"));
	КонецЕсли;
	// Вставить содержимое обработчика.
КонецПроцедуры
