Функция РодительКалькуляциПланаРабот( Исполнитель, Проект )
	РодительКЗ 	= СоздатьИерархию( "КалькуляторПланаРабот", 
									СокрЛП( Исполнитель ) + "/" + 
									СокрЛП( Проект ));
									
	Возврат РодительКЗ;
КонецФункции


Функция ИсполнениеПланаРабота( ЗадачаПроекта  )
	СтрСметы = Документы.ПланРабот.СуммаПланаРаботПоСметеЗадачиПроекта( ЗадачаПроекта );
	Если СтрСметы = Неопределено Тогда
		Возврат Дата(1,1,1); 
	Иначе
		Возврат СтрСметы.Месяц;
	КонецЕсли;
КонецФункции



Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Исполнитель = ПараметрыСеанса.ТекущийПользователь;
	ГодПроекта	= Год( ТекущаяДата());
	
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПланРабот") Тогда
		// Заполнение шапки
		
		Подразделение 	= ДанныеЗаполнения.Подразделение;
		ЗадачаПроекта	= ДанныеЗаполнения.ЗадачаПроекта;
		Наименование 	= ДанныеЗаполнения.ЗадачаПроекта.Наименование;
		ГодПроекта		= ДанныеЗаполнения.ЗадачаПроекта.Владелец.ГодПроекта;
		Родитель		= РодительКалькуляциПланаРабот( Исполнитель, ДанныеЗаполнения.ЗадачаПроекта.Владелец);
		ИсполненВключая = ИсполнениеПланаРабота( ДанныеЗаполнения.ЗадачаПроекта );
		ОстатокПоСмете	= ДанныеЗаполнения.ОстатокПоСмете;
		
		
		Для Каждого ТекСтрокаФронтРабот Из ДанныеЗаполнения.ФронтРабот Цикл
			НоваяСтрока 			= ФронтРабот.Добавить();
			ЗаполнитьЗначенияСвойств( НоваяСтрока, ТекСтрокаФронтРабот );
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
