
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УправлениеПечатьюКлиент.ПроверитьПроведенностьДокументов( 
		Новый ОписаниеОповещения("ВыполнитьКомандуПечати", ЭтотОбъект, ПараметрыВыполненияКоманды.Источник), 
		ПараметрКоманды);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуПечати(ПараметрКоманды, Форма) Экспорт
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.ПланРаботТиражный", "ТиражноеЗакрытие", 
			ПараметрКоманды, Форма);
КонецПроцедуры	
