
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ИзменитьМнемоКод(ПараметрКоманды);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьМнемоКод(Контрагент )
	МнемоКод = ПрочитатьМнемоКод( Контрагент );
	ОписаниеОпов = Новый ОписаниеОповещения("ПослеВводаМнемокода", ЭтотОбъект, Контрагент);
	ПоказатьВводСтроки(ОписаниеОпов, МнемоКод, "Введите мнемокод для " + Контрагент, РазмерМнемокода());
КонецПроцедуры

&НаСервере
Функция  РазмерМнемокода()
	Размер  = Метаданные.Справочники.Контрагенты.Реквизиты.Мнемокод.Тип.КвалификаторыСтроки.Длина;
	Возврат Размер;
	
КонецФункции
	
&НаСервере
Функция  ПрочитатьМнемоКод( Контрагент )
	Возврат Контрагент.Мнемокод;
КонецФункции

&НаКлиенте
Процедура ПослеВводаМнемокода( Строка, Параметры) Экспорт
	Если Строка <> Неопределено Тогда
		ЗаписатьМнемоКод( Строка, Параметры );
		ОповеститьОбИзменении( Тип("СправочникСсылка.Контрагенты" ));
		Оповестить("Изменение_Контрагента");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьМнемоКод( Мнемокод, КонтрагентСсылка )
	Если КонтрагентСсылка.ЭтоГруппа Тогда 
		Возврат;
	КонецЕсли;
	СпрОб = КонтрагентСсылка.ПолучитьОбъект();
	СпрОб.Мнемокод = Мнемокод;
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		СпрОб.Записать();
		
		
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры
