
&НаКлиенте
Процедура МесяцОценкиРегулирование(Элемент, Направление, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Объект.МесяцОценки	= ДобавитьМесяц( Объект.МесяцОценки, Направление);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура МесяцОценкиПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Объект.МесяцОценки = НачалоМесяца( Объект.МесяцОценки);
КонецПроцедуры


&НаКлиенте
Процедура ОценкиСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	
КонецПроцедуры


&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Для Каждого СтрО Из Объект.Оценки Цикл
		Если (СтрО.Оценка  < СтрО.КритерийОценки.МинКоэффициент)
		или	 (СтрО.Оценка  > СтрО.КритерийОценки.МаксКоэффициент) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Оценка выходит за границы диапазона критерия!";
			Сообщение.Поле  = "Оценка";
			Сообщение.УстановитьДанные( Объект );
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

