
&НаКлиенте
Процедура ОбновитьСписокСобытий(Команда)
	ОбновитьСписокСобытийНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьСписокСобытийНаСервере()
	
	МассивВидовФорм = Новый Массив;
	МассивВидовФорм.Добавить("ФормаОбъекта");
	МассивВидовФорм.Добавить("ФормаСписка");
	МассивВидовФорм.Добавить("ФормаВыбора");
	
	ОбработатьОбъектМетаданных("Справочники", МассивВидовФорм); 
	ОбработатьОбъектМетаданных("Документы", МассивВидовФорм);
	ОбработатьОбъектМетаданных("ПланыВидовХарактеристик", МассивВидовФорм);
	ОбработатьОбъектМетаданных("Задачи", МассивВидовФорм);
	ОбработатьОбъектМетаданных("Отчеты", МассивВидовФорм);
	ОбработатьОбъектМетаданных("Обработки", МассивВидовФорм);
	
	ОбработатьОбъектМетаданных("Документы", МассивВидовФорм);
	ОбработатьОбъектМетаданных("Документы", МассивВидовФорм);
		
	МассивВидовФорм = Новый Массив;
	МассивВидовФорм.Добавить("ФормаЗаписи");
	МассивВидовФорм.Добавить("ФормаСписка");
		
	ОбработатьОбъектМетаданных("РегистрыСведений", МассивВидовФорм);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьОбъектМетаданных(ИмяОбъектаМетаданных, МассивВидовФорм)

	Для Каждого Мет Из Метаданные[ИмяОбъектаМетаданных] Цикл	
		Для Каждого ВидФормы Из МассивВидовФорм Цикл
			
			ИмяСобытия = Мет.Имя + "." + ВидФормы;
			ПоискСуществующего = Справочники.ВидыСобытийКонтрольДействий.НайтиПоНаименованию(ИмяСобытия);
			Если Не ПоискСуществующего.Пустая() Тогда
				
				Если ПоискСуществующего.Синоним = Мет.Синоним Тогда 
					Продолжить;
				КонецЕсли;
				
				СпрОбъект = ПоискСуществующего.ПолучитьОбъект();
				
			Иначе				
				СпрОбъект = Справочники.ВидыСобытийКонтрольДействий.СоздатьЭлемент();
				СпрОбъект.Наименование = ИмяСобытия;						
			КонецЕсли;
			
			СпрОбъект.Синоним = Мет.Синоним;		
			СпрОбъект.Записать();
			
		КонецЦикла; 			
	КонецЦикла;	
	
КонецПроцедуры 