
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Проекты") Тогда
		// Заполнение шапки
		КлиентМенеджер = ДанныеЗаполнения.МенеджерПроекта;
		Проект = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
	ИсполнительДокумента = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.БюджетПоМесяцам.Записывать = Истина;
	Движения.ВознаграждениеПосредника.Записывать = Истина;
	//тз = СтруктураОплатыВознаграждения();
	Для Каждого ТекСтрокаРаспределение Из Задачи Цикл
		Если ТекСтрокаРаспределение.КВыплате = 0 Тогда Продолжить; КонецЕсли;
		
		// регистр БюджетПоМесяцам 
		сСметы =  Новый Соответствие;
		сСтатей = Новый Соответствие;
		пСтатей = Новый Соответствие;            
		oСтатей = Новый Соответствие;
		УП_СметаПроекта.ПодготовкаФактБюджета(сСметы, сСтатей, пСтатей, oСтатей, ТекСтрокаРаспределение.Задача);	
		
		ВыплатаВознПосреднику = Справочники.СтатьиСметы.ВыплатаВознПосреднику.ИмяПредопределенныхДанных;
		сСтатей[ВыплатаВознПосреднику] = ТекСтрокаРаспределение.КВыплате; 
		
		УП_СметаПроекта.ПроведениеФактБюджета(сСметы, сСтатей, oСтатей, Движения, ТекСтрокаРаспределение.Задача,
			Дата, Дата);
			
		// регистр ВознаграждениеПосредника Расход
		Движение = Движения.ВознаграждениеПосредника.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Период 		= Дата;
		Движение.Проект			= Проект;
		Движение.Посредник		= Посредник;
		Движение.Сумма 			= ТекСтрокаРаспределение.КВыплате;
		Движение.ЗадачаПроекта	= ТекСтрокаРаспределение.Задача;
	КонецЦикла;
	
	Движения.Записать();
		
	Остаток = РегистрыНакопления.ВознаграждениеПосредника.Остатки(, Новый Структура("Проект", Проект)).Итог("Сумма");
	
	Если Остаток < 0 Тогда 
		Сообщить("Не хватает вознаграждения по проекту " + Формат(Остаток, "ЧЦ=15; ЧДЦ=2"));
		//Отказ = Истина;
		//Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
	И НЕ РазрешеноПроводитьДокумент( Ссылка, Ссылка.Проект ) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;		

КонецПроцедуры
