
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
	// новая запись
		ЗаполнитьЗначенияСвойств( Запись, Параметры );
		Запись.Период 	= ТекущаяДата();
		Параметры.Свойство("Поручить", Поручить );
	Иначе
		
	КонецЕсли;
		
	
	
КонецПроцедуры

&НаСервере
Функция ИнцидентЗакрыт( Инцидент)
	Возврат Инцидент.Закрыт;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Если НЕ Запись.ИсходныйКлючЗаписи.Пустой() Тогда
	//	ЭтаФорма.ТолькоПросмотр = ложь;
	//КонецЕсли;
	
	ЭтаФорма.ТолькоПросмотр = НЕ Запись.ИсходныйКлючЗаписи.Пустой() ИЛИ ИнцидентЗакрыт( Запись.Инцидент);
	
	// 2014 10 25
	//ЭтаФорма.Элементы.ОтКого.Доступность 			= Поручить ИЛИ (НЕ ЗначениеЗаполнено(Запись.ОтКого));
	//ЭтаФорма.Элементы.Кому.Доступность 	 			= Поручить;
	ЭтаФорма.Элементы.СтатусИнцидента.Доступность 	= НЕ ЗначениеЗаполнено(Запись.СтатусИнцидента);
	ЭтаФорма.Заголовок = ?(Поручить, "Поручить", "Ответить");
	
	
КонецПроцедуры

&НаКлиенте
Процедура КомуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыПР = Новый Структура;
	ПараметрыПР.Вставить("ДатаИсполнения", 	Запись.Период );
	ПараметрыПР.Вставить("Инцидент", 		Запись.Инцидент );
	
	ФормаВыбора 	= ПолучитьФорму( "Справочник.ФизическиеЛица.Форма.ФормаВыбораИсполнителейЗП", ПараметрыПР, Элемент );
	ФормаВыбора.Открыть();
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьСостояниеИнцидента( ТекущийОбъект.Инцидент );

КонецПроцедуры
