
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Для Каждого Стр ИЗ Объект.Структура Цикл
	//	Стр.ИмяПредопределенного = Справочники.СтатьиСметы.ПолучитьИмяПредопределенного( Стр.Статья);
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьКодыСтатьей(Команда)
	Код1 = 0;
	Код2 = 0;
	КодРаздела = "";
	
	Для Каждого Стр ИЗ  Объект.Структура Цикл
		Если НЕ ЗначениеЗаполнено( Стр.Родитель ) Тогда
			Код1 = Код1 + 1;
			КодРаздела    = СтроковыеФункцииКлиентСервер.ДополнитьСтроку("" + Код1, 2, " ", "Слева");
			Стр.КодСтатьи = КодРаздела;
			
			Код2 = 0;
		Иначе
			Код2 = Код2 + 1;
			Стр.КодСтатьи = КодРаздела + "." + Код2;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

