
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьСлужебкаСОТ(ТабДок, ПараметрКоманды);
	//
	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Защита 				= Ложь;
	ТабДок.ТолькоПросмотр 		= Ложь;
	ТабДок.ОтображатьЗаголовки 	= Ложь;
	ТабДок.АвтоМасштаб			= Истина;
	ТабДок.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Процедура ПечатьСлужебкаСОТ(ТабДок, ДокСсылка)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Метаданные.ОбщиеМакеты.Найти("ПФ_MXL_СлужебкаСОТ");
	Если Макет <> Неопределено Тогда
		Макет = ПолучитьОбщийМакет(Макет);
	Иначе	
		Сообщить("Нет общего макета заявки на выплату из фонда подразделения !");
		Возврат;
	КонецЕсли;
	
	ТабДок.Очистить();
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ЗаполнитьЗначенияСвойств( ОблШапка.Параметры, ДокСсылка );
	//ОблШапка.Параметры.Дата = Формат( ДокСсылка.Дата, "ДЛФ=DD");
	//ОблШапка.Параметры.РуководительФИО	= УП_КадрыСервер.РуководительПодразделения( ДокСсылка.Подразделение, ДокСсылка.Дата ).Руководитель;
	РуководительФИО = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;	
	РуководительПодразделение = УП_КадрыСервер.ЧемРуководит(РуководительФИО)[0];
	РуководительДолжность = УП_КадрыСервер.ПроизводственнаяДолжностьФизЛица(РуководительФИО, РуководительПодразделение);	
	
	ОблШапка.Параметры.РуководительФИО = РуководительФИО;
	ОблШапка.Параметры.РуководительПодразделение = РуководительПодразделение;
	ОблШапка.Параметры.РуководительДолжность = РуководительДолжность;	
	ТабДок.Вывести(ОблШапка);
	
	Номер = 1;
	Для Каждого СтрР ИЗ ДокСсылка Цикл
		ОблСтрока = Макет.ПолучитьОбласть("Отсутствие");
		ЗаполнитьЗначенияСвойств( ОблСтрока.Параметры, СтрР  );
		ОблСтрока.Параметры.Номер = Номер;
		ОблСтрока.Параметры.Подразделение = РуководительПодразделение;
		ОблСтрока.Параметры.Должность = УП_КадрыСервер.ПроизводственнаяДолжностьФизЛица(СтрР.ФизическоеЛицо, РуководительПодразделение);
		ТабДок.Вывести(ОблСтрока);
		Номер = Номер + 1;
	КонецЦикла;
	
	ОблПодвал = Макет.ПолучитьОбласть("Подписи");
	ОблПодвал.Параметры.РуководительФИО = РуководительФИО;
	ТабДок.Вывести(ОблПодвал);

КонецПроцедуры
