
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ИсполнительДокумента 	= ПараметрыСеанса.ТекущийПользователь;
	ПериодРегистрации		= НачалоМесяца( ТекущаяДата() );

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ФондПодразделений Расход
	ГодФонда = ГодФондаПодразделения( ПериодРегистрации );
	
	Движения.ФондПодразделений.Записывать = Истина;
	Для Каждого ТекСтрокаВыплаты Из Выплаты Цикл
		Движение = Движения.ФондПодразделений.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Период 		= Дата;
		Движение.Подразделение 	= ТекСтрокаВыплаты.Подразделение;
		Движение.Год			= ГодФонда;
		Движение.Сумма 			= ТекСтрокаВыплаты.Сумма;
		Движение.СтатьяРасходов = СтатьяРасходов;
		
	КонецЦикла;

КонецПроцедуры
