&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	НавигационнаяСсылка = "https://www.youtube.com/playlist?list=PLVi2GrkVdg0aV_gh-TrKu2F30VGwC9JGh";
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("НавигационнаяСсылка", НавигационнаяСсылка);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПерейтиПоСсылкеВыбор", ТелеграмКлиент, ДополнительныеПараметры);
	ТекстВопроса = СтрШаблон("В браузере будет открыта ссылка %1", НавигационнаяСсылка);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

