
//&НаКлиенте
//Процедура АттестуемыеДолжностьПослеАттестацииНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
//	с=4;
//КонецПроцедуры

&НаКлиенте
Процедура АттестуемыеДолжностьПослеАттестацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Аттестуемые.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить( "Подразделение",  ТекущиеДанные.Подразделение);
	ПараметрыФормы.Вставить( "Дата", 		   Объект.ДатаНачала);
	ОткрытьФорму("Справочник.Должности.Форма.ФормаВыбораДляАттестации", ПараметрыФормы, Элемент);
	СтандартнаяОбработка = Ложь;
	
	
КонецПроцедуры

&НаКлиенте
Процедура АттестуемыеФизическоеЛицоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Аттестуемые.ТекущиеДанные;
	
	
	ПодразделениеДолжность = АттестуемыеФизическоеЛицоПриИзмененииНаСервере(Объект.ДатаНачала, ТекущиеДанные.ФизическоеЛицо );
	ЗаполнитьЗначенияСвойств( ТекущиеДанные, ПодразделениеДолжность );
КонецПроцедуры

&НаСервереБезКонтекста
Функция АттестуемыеФизическоеЛицоПриИзмененииНаСервере(Дата, ФизическоеЛицо )
	ПД = Новый Структура("Подразделение,Должность");
	Сотрудники = УП_КадрыСервер.СотрудникиФизЛица( ФизическоеЛицо, Дата );
	Для Каждого Сотрудник ИЗ Сотрудники  Цикл
		Если Сотрудник.Должность.Производственная  Тогда
			ЗаполнитьЗначенияСвойств( ПД, Сотрудник );
			Возврат ПД;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПД;
	
	// Вставить содержимое обработчика.
КонецФункции
