

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСписка(Список, ПараметрыОтбора)
	
	
	// подразделение
	Подразделение = ПараметрыОтбора.Получить("Подразделение");
	Если Подразделение <> Неопределено Тогда 
		Если Не ЗначениеЗаполнено(Подразделение) Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
				"Проект.Подразделение");
		Иначе
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора( Список.Отбор,
				"Проект.Подразделение",
				Подразделение,
				ВидСравненияКомпоновкиДанных.ВИерархии,,Истина);
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
КонецПроцедуры


&НаКлиенте
Процедура ПодразделениеПроектовПриИзменении(Элемент)
	ПараметрыОтбора = Новый Соответствие();
	Параметрыотбора.Вставить("Подразделение", ПодразделениеПроектов);
	
	УстановитьОтборСписка(Список, ПараметрыОтбора);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодразделениеПроектовПриИзменении("");
КонецПроцедуры

