&НаСервереБезКонтекста
Функция РасчитатьКодПроекта( Ссылка, Год  )
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	Проекты.Код КАК Код
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	Проекты.Код ПОДОБНО &ГодКода
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код УБЫВ";

		
	МаскаКода 		= Формат( Год-2000, "ЧЦ=2; ЧДЦ=0; ЧВН=; ЧГ=") + "-";
	Запрос.УстановитьПараметр("ГодКода", МаскаКода + "%" );

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		Номер = 1;
	Иначе
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			// вырезаем номер
			Номер = Число( Сред( ВыборкаДетальныеЗаписи.Код,4,3))+1;
		КонецЦикла;
	КонецЕсли;
	// новый код 
	Код  = МаскаКода + Формат( Номер, "ЧЦ=3; ЧДЦ=0; ЧВН=; ЧГ=");
	Возврат Код;
КонецФункции

&НаКлиенте
Процедура СформироватьКодПроекта(Команда)
	Объект.Код			= РасчитатьКодПроекта( Объект.Ссылка, Объект.ГодПроекта );
	Модифицированность = Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокНовыхСтатусов( ТекущийСтатус )
	ПраваФинансиста = Ложь;
	ПраваМенеджера 	= Ложь;
	
	СпСтатусов 		= Новый СписокЗначений;
	// доступна роль финанасиста
	Если 	РольДоступна(  Метаданные.Роли.ПолныеПрава ) или 
			РольДоступна(  Метаданные.Роли.ФинансовыйМенеджер ) Тогда
		ПраваФинансиста = Истина;
			
	КонецЕсли;
	// доступна роль клиент-менеджера
	Если 	РольДоступна(  Метаданные.Роли.ПолныеПрава ) или 
			РольДоступна(  Метаданные.Роли.КлиентМенеджер ) Тогда
		ПраваМенеджера 	= Истина;
	КонецЕсли;
		
	Если ТекущийСтатус = Перечисления.СтатусыПроектов.Прогноз и ПраваМенеджера Тогда
		СпСтатусов.Добавить( Перечисления.СтатусыПроектов.Черновик );
		
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыПроектов.Черновик и ПраваМенеджера Тогда
		СпСтатусов.Добавить( Перечисления.СтатусыПроектов.Согласование );
		СпСтатусов.Добавить( Перечисления.СтатусыПроектов.Прогноз );
		
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыПроектов.Согласование и ПраваФинансиста Тогда
		СпСтатусов.Добавить( Перечисления.СтатусыПроектов.ВРаботе );
		СпСтатусов.Добавить( Перечисления.СтатусыПроектов.Корректировка );
	
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыПроектов.ВРаботе и ПраваФинансиста Тогда
		СпСтатусов.Добавить( Перечисления.СтатусыПроектов.Закрыт );
		СпСтатусов.Добавить( Перечисления.СтатусыПроектов.Корректировка );
		СпСтатусов.Добавить( Перечисления.СтатусыПроектов.Заблокирован );
		
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыПроектов.ВРаботе и ПраваМенеджера Тогда
		СпСтатусов.Добавить( Перечисления.СтатусыПроектов.Корректировка );	
	
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыПроектов.Заблокирован и ПраваФинансиста Тогда
		СпСтатусов.Добавить( Перечисления.СтатусыПроектов.Согласование );
		
	ИначеЕсли ТекущийСтатус = Перечисления.СтатусыПроектов.Корректировка и ПраваМенеджера Тогда
		СпСтатусов.Добавить( Перечисления.СтатусыПроектов.Согласование );
	КонецЕсли;
	
	Возврат СпСтатусов;
КонецФункции

Функция СметыПроекта()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Смета.Ссылка КАК Ссылка,
		|	Смета.Проведен КАК Проведен
		|ИЗ
		|	Документ.Смета КАК Смета
		|ГДЕ
		|	Смета.Проект.Ссылка = &Проект
		|	И Смета.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Проект", Объект.Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервере
Функция ВозможенПереход(НовыйСтатус)
	Результат = Истина;
	
	Если НовыйСтатус = Перечисления.СтатусыПроектов.Согласование Тогда 
		сметы = СметыПроекта(); 
		
		Для Каждого смета Из сметы Цикл 
			Результат = Ложь;
			Если смета.Проведен Тогда 
				Результат = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не Результат Тогда
			Сообщить("У проекта нет проведенных смет. Перевод в статус 'Согласование' не возможен.");
		КонецЕсли;
	КонецЕсли;
				
	Возврат Результат; 
КонецФункции	

&НаКлиенте
Процедура ИзменитьСтатусПроекта( Результат, ДопПараметры )  Экспорт
	Если Результат <> КодВозвратаДиалога.Да Тогда 
		Возврат;
	КонецЕсли;
	
	новыйСтатус = Объект.Статус;
	сСтатусов = СписокНовыхСтатусов( Объект.Статус );
	Если 		сСтатусов.Количество() = 0 Тогда 
		ПоказатьПредупреждение(,"Нет доступных для перехода статусов проекта!", 10);
	ИначеЕсли	сСтатусов.Количество() = 1 Тогда 
		новыйСтатус = сСтатусов.Получить(0).Значение;
	Иначе
		Эл = сСтатусов.ВыбратьЭлемент( "Выберите новый статус проекта");
		новыйСтатус = Эл.Значение;
	КонецЕсли;
	
	Если Объект.Статус <> новыйСтатус И ВозможенПереход(новыйСтатус) Тогда
		Объект.Статус = новыйСтатус;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатус(Команда)
	ДопПараметры = Новый Структура;
	Опов = Новый ОписаниеОповещения("ИзменитьСтатусПроекта", ЭтаФорма, ДопПараметры);
	ПоказатьВопрос(Опов, "Изменить статус проекта?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименованиеПроекта(Команда)
	Объект.Наименование = Формат( Объект.Код, "ЧГ=") + ", " + СокрЛП( Объект.Контрагент);
	Модифицированность = Истина;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ДоступностьЗадачиПроекта( РольУчастника )
	Возврат РольУчастника.ПоЗадачеПроекта;
КонецФункции

&НаКлиенте
Процедура УчастникиПроектаПередНачаломИзменения(Элемент, Отказ)
	Стр = Элемент.ТекущиеДанные;
	Если Элемент.ТекущийЭлемент.Имя = "УчастникиПроектаЗадачаПроекта" И 
	НЕ ДоступностьЗадачиПроекта( Стр.Роль ) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры
