
Процедура Печать(ТабДок, Ссылка) Экспорт
	Если ТипЗнч( Ссылка ) = Тип("ДокументСсылка.ПланВознагражденияПосредника") Тогда
		Источник 	= "Документ.ПланВознагражденияПосредника";
		Дата	 	= Ссылка.Дата;
		Номер		= Ссылка.Номер;
	Иначе
		Источник = "Справочник.КалькуляторПланаВознаграждения";
		Дата	 	= ТекущаяДата();
		Номер		= "";
	КонецЕсли;
	
	Макет = Документы.ПланВознагражденияПосредника.ПолучитьМакет("Печать");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланВознагражденияПосредника.ЗадачаПроекта,
	|	ПланВознагражденияПосредника.ИсполнительДокумента,
	|	ПланВознагражденияПосредника.СуммаДокумента,
	|	ПланВознагражденияПосредника.Начисления.(
	|		НомерСтроки,
	|		Посредник,
	|		ДатаНачисления,
	|		Сумма
	|	),
	|	ПланВознагражденияПосредника.ЗадачаПроекта.Владелец КАК Проект
	|ИЗ
	|	"+ Источник +" КАК ПланВознагражденияПосредника
	|ГДЕ
	|	ПланВознагражденияПосредника.Ссылка В(&Ссылка)";
	
	
	
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьНачисленияШапка = Макет.ПолучитьОбласть("НачисленияШапка");
	ОбластьНачисления = Макет.ПолучитьОбласть("Начисления");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		Шапка.Параметры.Дата 	= Дата;
		Шапка.Параметры.Номер 	= Номер;
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьНачисленияШапка);
		ВыборкаНачисления = Выборка.Начисления.Выбрать();
		Пока ВыборкаНачисления.Следующий() Цикл
			ОбластьНачисления.Параметры.Заполнить(ВыборкаНачисления);
			ТабДок.Вывести(ОбластьНачисления, ВыборкаНачисления.Уровень());
		КонецЦикла;
		
		// итого по таблице
		тзИтого = Выборка.Начисления.Выгрузить();
		тзИтого.Свернуть("", "Сумма");
		ОбластьНачисленияПодвал = Макет.ПолучитьОбласть("НачисленияПодвал");
		ОбластьНачисленияПодвал.Параметры.Заполнить(тзИтого[0]);
		ТабДок.Вывести(ОбластьНачисленияПодвал, ВыборкаНачисления.Уровень());
		

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры


