
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ИсполнительДокумента 	= ПараметрыСеанса.ТекущийПользователь;
	Если ЗначениеЗаполнено( ДанныеЗаполнения ) Тогда
		//Изменено по задаче #133661 от 16.10.2018 ГумединАГ
		ЗадачаПроекта			= ДанныеЗаполнения.ЗадачаПроекта;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр БюджетПоМесяцам 
	СтатьяСметы = Справочники.СтатьиСметы.ВознагрПосредника;
	
	Движения.БюджетПоМесяцам.Записывать = Истина;
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Если ТекСтрокаНачисления.Сумма = 0 Тогда 
			Продолжить;
		КонецЕсли;
		Движение = Движения.БюджетПоМесяцам.Добавить();
		Движение.Период 		= Дата;
		Движение.ЗадачаПроекта 	= ЗадачаПроекта;
		Движение.СтатьяСметы	= СтатьяСметы;
		Движение.ТипСуммы		= Перечисления.ТипСуммыБюджета.ПервичныйДокумент;
		Движение.Месяц			= НачалоМесяца( ТекСтрокаНачисления.ДатаНачисления );
		//
		Движение.Сумма 			= ТекСтрокаНачисления.Сумма;
		//
		Движение.РКО			= Истина;
		
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если УП_СметаПроекта.Есть_СметаЗадачи_СодержащаяДокумент( Ссылка ) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

КонецПроцедуры
