&НаСервере
Функция  ПолучитьОтпускнуюЦену( Номенклатура, Дата)
	//
	Возврат ЦенаНоменклатуры( Номенклатура, Справочники.ВидыЦен.ЦенаОтпускная, Дата );
КонецФункции

&НаКлиенте
Процедура 	ПересчетСтроки( Стр )
	Стр.Сумма   = Стр.Цена * Стр.Количество;
КонецПроцедуры

&НаКлиенте
Процедура СоставНоменклатураПриИзменении( Элемент )
	//
	Стр 		= Элементы.Состав.ТекущиеДанные;
	Стр.Цена 	= ПолучитьОтпускнуюЦену( Стр.Номенклатура,	Объект.Дата );
	ПересчетСтроки( Стр );
КонецПроцедуры

&НаКлиенте
Процедура СоставКоличествоПриИзменении(Элемент)
	Стр 		= Элементы.Состав.ТекущиеДанные;
	ПересчетСтроки( Стр );
КонецПроцедуры

&НаКлиенте
Процедура СоставЦенаПриИзменении(Элемент)
	Стр 		= Элементы.Состав.ТекущиеДанные;
	ПересчетСтроки( Стр );
КонецПроцедуры
