&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Обновить(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	СтатистикаФинансы = А_Аналитика.СтатистикаФинансы("СтатистикаФинансы", 2018);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедакторHTML(Команда)
	РедакторКод = "СтатистикаФинансы";
	РедакторHTMLДокумента = А_Аналитика.ПодготовитьHTMLСтраницу(РедакторКод);
	Элементы.РедакторШаблона.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	А_Аналитика.ЗаписатьHTMLСтраницу(РедакторКод, РедакторHTMLДокумента);
	Обновить(Неопределено);
//	Элементы.РедакторШаблона.Видимость = Ложь;
КонецПроцедуры
