&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Обновить(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	СтатистикаФинансы = А_Аналитика.ПолучитьШаблонСтраницы("СтатистикаФинансы");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедакторHTML(Команда)
	РедакторКод = "СтатистикаФинансы";
	РедакторHTMLДокумента = А_Аналитика.ПолучитьШаблонСтраницы(РедакторКод);
	Элементы.РедакторШаблона.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	А_Аналитика.ЗаписатьHTMLСтраницу(РедакторКод, РедакторHTMLДокумента);
	Обновить(Неопределено);
//	Элементы.РедакторШаблона.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура JSLog(Данные) Экспорт
    Сообщить(Данные);
КонецПроцедуры

&НаКлиенте
Процедура HTMLДокументаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
    НажатыйЭлемент = ДанныеСобытия.Element;
    Если НажатыйЭлемент.id = "startInteractionButton" Тогда
		
		ДокументПервогоБраузера = Элемент.Документ;
		ДокументПервогоБраузера.body.setExternalForm(ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция  WebGetData(Запрос) Экспорт 
	Возврат А_Аналитика.WebGetData(Запрос);
КонецФункции;