&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	НавигационнаяСсылка = "https://vk.com/telegram1c";
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("НавигационнаяСсылка", НавигационнаяСсылка);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПерейтиПоСсылкеВыбор", ТелеграмКлиент, ДополнительныеПараметры);
	ТекстВопроса = СтрШаблон("В браузере будет открыта ссылка %1", НавигационнаяСсылка);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

