
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ПараметрыВыполненияКоманды.Источник.Элементы.Найти("Список") <> Неопределено Тогда
		Если ТипЗнч(ПараметрыВыполненияКоманды.Источник.Элементы.Список) = Тип("ТаблицаФормы") Тогда
			Для Каждого задача из ПараметрыВыполненияКоманды.Источник.Элементы.Список.ВыделенныеСтроки Цикл
				УстановитьСтатусаЗадачи(задача); 
			КонецЦикла;
			ОповеститьОбИзменении(ПараметрКоманды);
		КонецЕсли;
	ИначеЕсли ПараметрыВыполненияКоманды.Источник.Элементы.Найти("Статус") <> Неопределено Тогда
		Объект = ПараметрыВыполненияКоманды.Источник.Объект;
		Результат = ПроверкаСтатусаЗадачи(Объект);
		ПараметрыВыполненияКоманды.Источник.Объект.Статус = Результат;
		ПараметрыВыполненияКоманды.Источник.Объект.СтатусДата = ТекущаяДата();
		ПараметрыВыполненияКоманды.Источник.Модифицированность = Истина;
	Иначе 
		Сообщить("Проверка статуса задачи. Неизвестный источник вызова.");     
	КонецЕсли
КонецПроцедуры
 
&НаСервере
Процедура УстановитьСтатусаЗадачи(НаименованиеЗадачи)
	задача = Справочники.ЗадачиПроектов.НайтиПоНаименованию(НаименованиеЗадачи).ПолучитьОбъект();
	Результат = Справочники.ЗадачиПроектов.ПроверкаСтатусаЗадач(задача);
	задача.Статус = Результат;
	задача.СтатусДата = ТекущаяДата();
	задача.Записать();
КонецПроцедуры

&НаСервере
Функция ПроверкаСтатусаЗадачи(задача)
	Возврат Справочники.ЗадачиПроектов.ПроверкаСтатусаЗадач(задача);
КонецФункции
