Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если УП_ПереносДанных.ПроведениеПриПереносе() Тогда
		Возврат;
	КонецЕсли;
	
	
	Для Каждого СтрДок Из РабочееВремя Цикл
		Если УП_КадрыСервер.РазрешеноИсправлениеТабеля( СтрДок.ДатаТабеля ) = 0 Тогда
			Сообщить("Табель содержит даты, на которую исправление закрыто, проведение запрещено!");
			Отказ = Истина;
			Возврат;
		КонецЕсли; 
		Если ЗначениеЗаполнено( СтрДок.Основание ) И
			(ТипЗнч( СтрДок.Основание ) = Тип("ДокументСсылка.ПланРабот") или ТипЗнч( СтрДок.Основание ) = Тип("ДокументСсылка.ПланРаботТиражный"))
			и СтрДок.ОтметкаТабеля.ПланРаботНеРазрешен Тогда
			
			Сообщить("Для " + СтрДок.ОтметкаТабеля + " нельзя указывать план работ!");
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
		
		 //проверка статуса проекта
		
		 //!!! временно, для закрытия табеля за январь 2014
		Если ЗначениеЗаполнено( СтрДок.Основание ) Тогда
			Если ТипЗнч( СтрДок.Основание ) = Тип("ДокументСсылка.ПланРабот") Тогда
				Проект = СтрДок.Основание.ЗадачаПроекта.Владелец;
				Если Проект.Статус <> Перечисления.СтатусыПроектов.ВРаботе Тогда
					Сообщить("Проект " + Проект + ", ("+ СтрДок.Основание +") имеет статус " + Проект.Статус);
					Отказ = Истина;
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		
		
	КонецЦикла;

	
КонецПроцедуры

//********************************************************
// отменять проведение можно только администратору с полными правами
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	// разрешаем суперпользователю или фин.директору
	//Если НЕ РольДоступна("ПолныеПрава") Тогда 
	//	Отказ = Истина;
	//	Возврат 
	//КонецЕсли;
		
	Для Каждого СтрДок Из РабочееВремя Цикл
		Если УП_КадрыСервер.РазрешеноИсправлениеТабеля( СтрДок.ДатаТабеля ) = 0 Тогда
			Сообщить("Табель содержит даты, на которую исправление закрыто, отмена проведения запрещена!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;                                                                                                         
	КонецЦикла;
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ИсполнительДокумента 	= ПараметрыСеанса.ТекущийПользователь;

КонецПроцедуры

