
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр Сотрудники
	Движения.Сотрудники.Записывать = Истина;
	
	Движение = Движения.Сотрудники.Добавить();
	Движение.Период 			= ДатаНачалаРаботы;
	Движение.Подразделение 		= Подразделение;
	Движение.Должность 			= Должность;
	Движение.ТарифнаяСтавка 	= ТарифнаяСтавка;
	Движение.ФизическоеЛицо 	= ФизическоеЛицо;
	
	// ресурсы
	Движение.СтатусСотрудника	= Справочники.СтатусыСотрудников.Работает;
	Движение.Количество 		= Количество;
	
	// реквизиты
	Движение.Организация 		= Организация;
	Движение.Основание 			= Основание;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ИсполнительДокумента 	= ПараметрыСеанса.ТекущийПользователь;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Должность.Производственная Тогда
		Если НЕ ЗначениеЗаполнено( ТарифнаяСтавка ) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Для должности " + Должность + " должна быть указана тарифная ставка";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
