&НаСервереБезКонтекста
Функция СтавкаПоДолжности( Должность )
	Возврат УП_КадрыСервер.СтавкаПоДолжности(Должность );
КонецФункции

&НаКлиенте
Процедура ДолжностьПриИзменении(Элемент)
	Объект.ТарифнаяСтавка = СтавкаПоДолжности( Объект.Должность );
КонецПроцедуры


&НаКлиенте
Процедура ДолжностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыД = Новый Структура;
	ПараметрыД.Вставить("Подразделение", 	Объект.Подразделение );
	
	ФормаВыбора 	= ПолучитьФорму( "Справочник.Должности.Форма.ФормаВыбораДляПланаРабот", ПараметрыД, Элемент );
	ФормаВыбора.Открыть();
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
