//ФормаОтчета
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ГодЗадач = Год(ТекущаяДата());
КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	Для Каждого Эл ИЗ Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если Строка(Эл.Параметр) = "ГодЗадач" Тогда
			Эл.Значение = ГодЗадач;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "ТиповыеЗадачи" Тогда
			Эл.Значение = ТиповыеЗадачи;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "СтатусыПроектов" Тогда
			Эл.Значение = СтатусыПроектов;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "Организация" Тогда
			Эл.Значение = Организация;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Эл ИЗ Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		Если Строка(Эл.Параметр) = "ГодЗадач" Тогда
			Эл.Значение = ГодЗадач;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "ТиповыеЗадачи" Тогда
			Эл.Значение = ТиповыеЗадачи;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "СтатусыПроектов" Тогда
			Эл.Значение = СтатусыПроектов;
		КонецЕсли;
		Если Строка(Эл.Параметр) = "Организация" Тогда
			Эл.Значение = Организация;
		КонецЕсли;
	КонецЦикла;
	
	//	СкомпоноватьРезультат();
КонецПроцедуры


&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	ПриОбновленииСоставаПользовательскихНастроекНаСервере("");
КонецПроцедуры
