
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Подразделение") Тогда
		// 2015 12 14
		мДолжностей = УП_КадрыСервер.ДолжностиПодразделения( Параметры.Подразделение,
															 Параметры.Дата, Истина);
		
		ПараметрыОтбора = Новый Соответствие();
		Параметрыотбора.Вставить("Должности", мДолжностей );
	
		УстановитьОтборСписка(Список, ПараметрыОтбора);
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСписка(Список, ПараметрыОтбора)
	
	// тип проекта
	мДолжностей = ПараметрыОтбора.Получить("Должности");
	Если мДолжностей <> Неопределено Тогда 
		Если Не ЗначениеЗаполнено(мДолжностей) Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора( Список.Отбор,
				"Ссылка");
		Иначе
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора( Список.Отбор,
				"Ссылка",
				мДолжностей,
				ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
