
Процедура КонтрольДействийОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	ИсточникСтрокой = Строка(ТипЗнч(Источник));
	Если СтрНайти(ИсточникСтрокой, "Отчет менеджер") <> 0 
		или СтрНайти(ИсточникСтрокой, "Обработка менеджер") <> 0 Тогда
		ИмяСобытия = Источник.Создать().Метаданные().Имя + "." + ВидФормы;
	ИначеЕсли СтрНайти(ИсточникСтрокой, "Регистр сведений менеджер") <> 0 Тогда
		ИмяСобытия = Источник.СоздатьНаборЗаписей().Метаданные().Имя + "." + ВидФормы;	
	Иначе		
		ИмяСобытия = Источник.ПолучитьСсылку().Метаданные().Имя + "." + ВидФормы;		 		
	КонецЕсли;
	
	СобытиеСсылка = Справочники.ВидыСобытийКонтрольДействий.НайтиПоНаименованию(ИмяСобытия);
	Если СобытиеСсылка.Пустая() Тогда
		ЗаписьЖурналаРегистрации("Ошибка получения события контроля действий: " + ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, Метаданные.ПодпискиНаСобытия.КонтрольДействий);
		Возврат;
	КонецЕсли;
	
	Набор = РегистрыСведений.КонтрольДействий.СоздатьНаборЗаписей();
	Набор.Отбор.Период.Установить(НачалоДня(ТекущаяДата()));
	Набор.Отбор.Пользователь.Установить(ПараметрыСеанса.ТекущийПользователь);
	Набор.Отбор.Событие.Установить(СобытиеСсылка);
	Набор.Прочитать();
	
	Если Набор.Количество() = 0 Тогда
		НоваяСтрока = Набор.Добавить();
		НоваяСтрока.Период = НачалоДня(ТекущаяДата());
		НоваяСтрока.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		НоваяСтрока.Событие = СобытиеСсылка;
	Иначе
		НоваяСтрока = Набор.Получить(0);
	КонецЕсли;
	
	НоваяСтрока.КоличествоВызовов = НоваяСтрока.КоличествоВызовов + 1;

	Набор.Записать();
	
КонецПроцедуры
