
Функция GetPlan( ГодБюджета, КодСтатьи, НачалоПериода, КоличествоМесяцев )
	
	JSON_Данные = УП_ДанныеДляБюджета.ПолучитьПланПоСтатьеJSON(ГодБюджета, КодСтатьи, НачалоПериода, КоличествоМесяцев );
	
	Возврат JSON_Данные;
КонецФункции

Функция GetFact(ГодБюджета, КодСтатьи, НачалоПериода, КоличествоМесяцев )
	JSON_Данные = УП_ДанныеДляБюджета.ПолучитьФактПоСтатьеJSON(ГодБюджета, КодСтатьи, НачалоПериода, КоличествоМесяцев );
	
	Возврат JSON_Данные;
	// Вставить содержимое обработчика.
КонецФункции
