&НаСервере
Функция ПланРаботПоПараметру( ПараметрКоманды )
	Если ТипЗнч( ПараметрКоманды ) = Тип("ДокументСсылка.ПланРабот") Тогда
		ПланРабот = ПараметрКоманды;
	Иначе
		ПланРабот = ПараметрКоманды.ПланРабот;
	КонецЕсли;
	Возврат ПланРабот;	
КонецФункции


&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура();
	Отбор = Новый Структура;
	ПланРабот = ПланРаботПоПараметру( ПараметрКоманды );
	
	Отбор.Вставить("ПланРабот", ПланРабот );
	ПараметрыФормы.Вставить("Отбор", Отбор );
	ПараметрыФормы.Вставить("СформироватьПриОткрытии",  Истина );
	ПараметрыФормы.Вставить("КлючВарианта",  "ПоПлануРабот");
	
	
	
	ОткрытьФорму("Отчет.ИсполнениеПланаРабот.Форма", ПараметрыФормы, 
			ПараметрыВыполненияКоманды.Источник, 
			ПараметрыВыполненияКоманды.Уникальность, 
			ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
	
