////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если Не ЭтоГруппа Тогда

		Если ЗначениеЗаполнено(ВидНоменклатуры) Тогда
			Если ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда

				Позиция = ПроверяемыеРеквизиты.Найти("ЕдиницаИзмерения");
				Если Позиция > 0 Тогда
					ПроверяемыеРеквизиты.Удалить(Позиция);
				КонецЕсли;

			КонецЕсли;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
 	
КонецПроцедуры

Процедура ПередУдалением(Отказ)

КонецПроцедуры // ПередУдалением()

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если НЕ ЭтоГруппа Тогда
		//ВидНоменклатуры 		= Справочники.ВидыНоменклатуры.ПолучитьВидНоменклатурыПоУмолчанию();
		ЕдиницаИзмерения 		= Справочники.ЕдиницыИзмерения.ПолучитьЕдиницуИзмеренияПоУмолчанию();
		//Справочники.Номенклатура.УстановитьРеквизитыПоВидуНоменклатуры(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

