&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодготовитьУсловияОтбора();
	Обновить(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПодготовитьУсловияОтбора()
	Если Год = 0 Тогда
		Год = Год( ТекущаяДата() );
	КонецЕсли;
	
//	Статус.Очистить();
	
	Если Статус.Количество() = 0 Тогда
		Для Каждого с Из Перечисления.СтатусыПроектов Цикл
			стр = Статус.Добавить();
			стр.Статус = с;
			стр.Установлен = Истина;
		КонецЦикла;
	КонецЕсли;
	
//	СтатусЗадач.Очистить();
	
	Если СтатусЗадач.Количество() = 0 Тогда
		Для Каждого с Из Перечисления.СтатусыЗадачПроектов Цикл
			стр = СтатусЗадач.Добавить();
			стр.Статус = с;
			стр.Установлен = Истина;
		КонецЦикла;
	КонецЕсли;
	
	КМ.Очистить();
	аКМ = МассивКлиентМенджеров(Год);
	Для Каждого с Из аКМ Цикл
		стр = КМ.Добавить();
		стр.КМ = с;
		стр.Установлен = Истина;
	КонецЦикла;
КонецПроцедуры	

&НаСервере
Процедура ОбновитьМоиПроекты()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.Ссылка КАК Проект,
		|	Проекты.Статус КАК Статус,
		|	Проекты.СтатусЗадач КАК СтатусЗадач,
		|	ЗадачиПроектов.ГодЗадачи КАК Год,
		|	Проекты.МенеджерПроекта КАК КлиентМенеджер,
		|	СУММА(БюджетПоМесяцам.Сумма) КАК Обеспечено,
		|	СУММА(РеализацияОбороты.ФактОборот) КАК Реализация,
		|	СУММА(ОбеспечениеОплатаОбороты.СуммаОплаченоОборот) КАК Оплата,
		|	СУММА(ВЫБОР
		|			КОГДА БюджетПоМесяцам.ВидПлана = ЗНАЧЕНИЕ(Перечисление.ВидыПланаБюджета.Обеспечено)
		|				ТОГДА БюджетПоМесяцам.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ООбеспечено,
		|	СУММА(ВЫБОР
		|			КОГДА БюджетПоМесяцам.ВидПлана = ЗНАЧЕНИЕ(Перечисление.ВидыПланаБюджета.Гарантия)
		|				ТОГДА БюджетПоМесяцам.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОГарантия,
		|	СУММА(ВЫБОР
		|			КОГДА БюджетПоМесяцам.ВидПлана = ЗНАЧЕНИЕ(Перечисление.ВидыПланаБюджета.Прогноз)
		|				ТОГДА БюджетПоМесяцам.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОПрогноз
		|ИЗ
		|	Справочник.Проекты КАК Проекты,
		|	Справочник.ЗадачиПроектов КАК ЗадачиПроектов,
		|	РегистрНакопления.БюджетПоМесяцам КАК БюджетПоМесяцам,
		|	РегистрНакопления.Реализация.Обороты КАК РеализацияОбороты,
		|	РегистрНакопления.ОбеспечениеОплата.Обороты КАК ОбеспечениеОплатаОбороты
		|ГДЕ
		|	Проекты.МенеджерПроекта В(&КМ)
		|	И ЗадачиПроектов.Владелец = Проекты.Ссылка
		|	И ЗадачиПроектов.ГодЗадачи В(&Год)
		|	И Проекты.Статус В(&СтатусПроекта)
		|	И Проекты.СтатусЗадач В(&СтатусЗадач)
		|	И БюджетПоМесяцам.ЗадачаПроекта = ЗадачиПроектов.Ссылка
		|	И БюджетПоМесяцам.СтатьяСметы = ЗНАЧЕНИЕ(Справочник.СтатьиСметы.ДохФинансовые)
		|	И БюджетПоМесяцам.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипСуммыБюджета.План)
		|	И РеализацияОбороты.ЗадачаПроекта = ЗадачиПроектов.Ссылка
		|	И ОбеспечениеОплатаОбороты.ЗадачаПроекта = ЗадачиПроектов.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Проекты.Ссылка,
		|	ЗадачиПроектов.ГодЗадачи,
		|	Проекты.Статус,
		|	Проекты.СтатусЗадач,
		|	Проекты.МенеджерПроекта";

	Запрос.УстановитьПараметр("Год", Год);
	
	Отбор = Новый Структура();
	Отбор.Вставить("Установлен", Истина);
	
	фКМ = КМ.Выгрузить(Отбор, "КМ");
	фСтатусП = Статус.Выгрузить(Отбор, "Статус");
	фСтатусЗ = СтатусЗадач.Выгрузить(Отбор, "Статус");
	
	Запрос.УстановитьПараметр("КМ", фКМ);
	Запрос.УстановитьПараметр("СтатусПроекта", фСтатусП);
	Запрос.УстановитьПараметр("СтатусЗадач", фСтатусЗ);
	
	Результат = Запрос.Выполнить().Выгрузить();
	МоиПроекты.Загрузить(Результат);	
КонецПроцедуры	

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьМоиПроекты();
	СтатистикаДляКМ = А_Аналитика.СтатистикаДляКМ("СтатистикаДляКМ", МоиПроекты);
КонецПроцедуры

&НаКлиенте
Процедура ГодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Год = ВыбранноеЗначение;
	Обновить(Неопределено);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ГодОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Год = Текст;
	Обновить(Неопределено);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	Обновить(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура МоиПроектыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//Показать выбранный проект
	ПоказатьЗначение(,Элемент.ТекущиеДанные.Проект);
КонецПроцедуры

&НаКлиенте
Процедура МоиПроектыПриАктивизацииСтроки(Элемент)	
	//ОбновитьСтраницу(Элемент.ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедакторHTML(Команда)
	РедакторКод = "СтатистикаДляКМ";
	РедакторHTMLДокумента = А_Аналитика.ПолучитьШаблонСтраницы(РедакторКод);
	Элементы.РедакторШаблона.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	А_Аналитика.ЗаписатьHTMLСтраницу(РедакторКод, РедакторHTMLДокумента);
	Обновить(Неопределено);
//	Элементы.РедакторШаблона.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КМ_ВсеУстановить(Команда)
	Для Каждого строка Из КМ Цикл 
		строка.Установлен = Истина;
	КонецЦикла;
	Обновить(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КМ_ВсеСнять(Команда)
	Для Каждого строка Из КМ Цикл 
		строка.Установлен = Ложь;
	КонецЦикла;
	Обновить(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КМ_ВсеПоменять(Команда)
	Для Каждого строка Из КМ Цикл 
		строка.Установлен = Не строка.Установлен;
	КонецЦикла;
	Обновить(Неопределено);
КонецПроцедуры
