
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр БонусыПоАктам Приход
	Движения.БонусыПоАктам.Записывать = Истина;
	Для Каждого ТекСтрокаКоммерческоеВознаграждение Из КоммерческоеВознаграждение Цикл
		Движение = Движения.БонусыПоАктам.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Акт			= Ссылка;
		Движение.ЗадачаПроекта 	= ТекСтрокаКоммерческоеВознаграждение.ЗадачаПроекта;
		Движение.Сумма 			= ТекСтрокаКоммерческоеВознаграждение.СуммаВознаграждения;
	КонецЦикла;

	Движения.БюджетПоМесяцам.Записывать = Истина;
	Для Каждого ТекСтрокаРасшифровкаПлатежа Из РасшифровкаПлатежа Цикл
		// 1, доходы всего                                                                              
		ЗаполнитьДвижениеПоМесяцам(ТекСтрокаРасшифровкаПлатежа, Движения, "ДоходыВс" );
		// 2, вознаграждение		
		ЗаполнитьДвижениеПоМесяцам(ТекСтрокаРасшифровкаПлатежа, Движения, "ВознагрПосредника" );
		// 3, расходы на вознаграждение		
		ЗаполнитьДвижениеПоМесяцам(ТекСтрокаРасшифровкаПлатежа, Движения, "РасходыВознПосредника" );
		
		// 5. 
		// 2017 08 09 - оплата дает факт по статье 5.1 вознаграждение клиент менкеджера по проекту
		Если  ГодЗадачиПроекта( ТекСтрокаРасшифровкаПлатежа.ЗадачаПроекта ) >= 2017 Тогда
			// расходы коммерческие - на статью ВознаграждениеКМ
			ЗаполнитьДвижениеПоМесяцам(ТекСтрокаРасшифровкаПлатежа, Движения, "ВознаграждениеКМ", "РасходыКоммерческие" );
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьДвижениеПоМесяцам( Стр, Движения, ИмяСтатьи, ИмяСуммы = "" )
	
	// 2017 08 09 
	Сумма = Стр[ ?(ЗначениеЗаполнено(ИмяСуммы), ИмяСуммы,  ИмяСтатьи )]; // Стр[ИмяСтатьи];
	Если Сумма = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движение = Движения.БюджетПоМесяцам.Добавить();
	
	Движение.Период 		= Дата;
	Движение.ЗадачаПроекта 	= Стр.ЗадачаПроекта;
	Движение.СтатьяСметы 	= Справочники.СтатьиСметы[ИмяСтатьи];
	// 08,04,20013
	Движение.ТипСуммы 		= Перечисления.ТипСуммыБюджета.Факт;  // факт
	Движение.Месяц 			= НачалоМесяца(Дата);
	// 2016 02 15 
	Движение.РКО			= Истина;
	//
	Движение.Сумма			= Сумма;
КонецПроцедуры