Функция ПолучитьДатуРасчета( ГодБюджета )
	Возврат УП_БДР.ПолучитьДатуРасчета( ГодБюджета );
КонецФункции

&НаКлиенте
Процедура ГодБюджетаПриИзменении(Элемент)
	ДатаРасчета = ПолучитьДатуРасчета( ГодБюджета );
КонецПроцедуры


&НаСервере
Процедура РассчитатьБюджетНаСервере()
	УП_БДР.РассчитатьБюджетНаСервере(ГодБюджета);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьБюджет(Команда)
	
	РассчитатьБюджетНаСервере();
	ПоказатьПредупреждение(,"Бюджет рассчитан!", 10);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ГодБюджетаПриИзменении("");
КонецПроцедуры
