&НаСервере
Функция ДатаИзФайлаExcel( ДатаТекст)
	Попытка
		День 	= Число(Лев(ДатаТекст,2));
		Месяц 	= Число(Сред(ДатаТекст,4,2));	 
		Год 	= Число(Сред(ДатаТекст,7,4));	 
		Возврат Дата( Год, Месяц, День );
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

&НаКлиенте
Процедура ФайлЗагрузкиExcelНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла( РежимДиалогаВыбораФайла.Открытие );
	ДиалогОткрытияФайла.ПолноеИмяФайла 	= "";
	ДиалогОткрытияФайла.Фильтр			= "Файл Excel (*.xlsx)|*.xlsx";
	//"Файл Excel (*.xls)|*.xls";
	
	ДиалогОткрытияФайла.ПолноеИмяФайла	= ФайлЗагрузкиExcel;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Укажите файл для загрзки'");
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ФайлЗагрузкиExcel = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	Если ПустаяСтрока(ФайлЗагрузкиExcel) Тогда
		Предупреждение("Укажите файл Microsoft Excel.", 10);
		Возврат;
	КонецЕсли;
	Если Объект.Расходы.Количество() <> 0 Тогда
		Если Вопрос("При загрузке текущий документ будет очищен, продолжить?", РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	ОбработкаФайла();
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаФайла()
	ТаблицаЗагрузки = Новый ТабличныйДокумент;
	
	Попытка
		// Загрузка Microsoft Excel
		//Сообщить("Загрузка Microsoft Excel...");
		ExcelПриложение = Новый COMОбъект("Excel.Application");
		
	Исключение
		
		Сообщить("Ошибка при загрузке Microsoft Excel." + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Внимание);
		Возврат;
		
	КонецПопытки;
		
	Попытка
		
		// Открытие файла Microsoft Excel
		//Состояние("Открытие файла Microsoft Excel...");
		ExcelФайл = ExcelПриложение.WorkBooks.Open(ФайлЗагрузкиExcel);
		
		// Обработка файла Microsoft Excel
		//Состояние("Обработка файла Microsoft Excel...");
		ExcelЛист = ExcelФайл.Sheets(1);
		xlCellTypeLastCell = 11;
		ExcelПоследняяСтрока = ExcelЛист.Cells.SpecialCells(xlCellTypeLastCell).Row;
		ExcelПоследняяКолонка = ExcelЛист.Cells.SpecialCells(xlCellTypeLastCell).Column;
		
		//ТаблицаЗагрузки.Очистить();
		
		Для Строка = 1 По ExcelПоследняяСтрока Цикл
			
			Для Колонка = 1 По ExcelПоследняяКолонка Цикл
				
				//Состояние("Обработка файла Microsoft Excel : "
							//+ "строка " + Строка + " из " + ExcelПоследняяСтрока
							//+ ", колонка " + Колонка + " из " + ExcelПоследняяКолонка);
				ExcelЯчейка = ExcelЛист.Cells(Строка, Колонка);
				ТаблицаЗагрузки.Область(Строка, Колонка, Строка, Колонка).Текст = ExcelЯчейка.Value;
				
			КонецЦикла;
			
		КонецЦикла;
		
	Исключение
		
		Сообщить("Ошибка при открытии/чтении файла " + ФайлЗагрузкиExcel + "." + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Внимание);
		
	КонецПопытки;
			
	ExcelПриложение.Quit();
	
	ОтбработатьТаблицуЗагрузки( ТаблицаЗагрузки );
	
КонецПроцедуры // ОбработкаФайла(Элемент)


&НаСервере
Процедура ОтбработатьТаблицуЗагрузки( ТаблицаЗагрузки )
	
	Документ 		= РеквизитФормыВЗначение("Объект");
	Документ.Расходы.Очистить();
	
	Для Н = 2 ПО ТаблицаЗагрузки.ВысотаТаблицы Цикл
		// дата 
		Если Н = 2 Тогда
			//ДатаДокумента 		= ДатаИзФайлаExcel( ТаблицаЗагрузки.Область(Н,1).Текст);
			//НомерДокумента 		= ТаблицаЗагрузки.Область(Н,2).Текст;
			Попытка
				Документ.ПериодРегистрации 	= НачалоМесяца(ДатаИзФайлаExcel( ТаблицаЗагрузки.Область(Н,3).Текст));
				Если НЕ ЗначениеЗаполнено(Документ.ПериодРегистрации) Тогда
					Сообщение = новый СообщениеПользователю;
					Сообщение.Текст = "Не указан период регистрации";
					Сообщение.Сообщить();
					Возврат;
				КонецЕсли;
			Исключение
				Сообщение = новый СообщениеПользователю;
				Сообщение.Текст = "Неправильный формат периода регистрации";
				Сообщение.Сообщить();
				Возврат;
			КонецПопытки;
			//
			НаименованиеПодразделения 		= ТаблицаЗагрузки.Область(Н,4).Текст;
			Документ.Подразделение = Справочники.Подразделения.НайтиПоНаименованию(НаименованиеПодразделения, Истина);
			Если НЕ ЗначениеЗаполнено( Документ.Подразделение ) Тогда
				Сообщение = новый СообщениеПользователю;
				Сообщение.Текст = "Не найдено подразделение " + НаименованиеПодразделения;
				Сообщение.Сообщить();
				Возврат;
			КонецЕсли;
			
			
		КонецЕсли;
		
		НомерПланаРабот = ТаблицаЗагрузки.Область(Н,5).Текст;
		Если НЕ ЗначениеЗаполнено( НомерПланаРабот ) Тогда
			Продолжить;
		КонецЕсли;
		ПланРабот 	= Документы.ПланРаботТиражный.НайтиПоНомеру( НомерПланаРабот );
		Если НЕ ЗначениеЗаполнено( ПланРабот ) Тогда
			Сообщение = новый СообщениеПользователю;
			Сообщение.Текст = "Не найден план работ № " + НомерПланаРабот;
			Сообщение.Сообщить();
			Продолжить;
		КонецЕсли;
		Если ПланРабот.Подразделение <> Документ.Подразделение Тогда 
			Сообщение = новый СообщениеПользователю;
			Сообщение.Текст = "Подразделение плана работ " + ПланРабот + Символы.ПС +
							  ПланРабот.Подразделение + " не соответствует " + Документ.Подразделение;
			Сообщение.Сообщить();
			Продолжить;
		КонецЕсли;			
		
		
		// дата и время есть !!!
		СтрТаб = Документ.Расходы.Добавить();
		СтрТаб.ПланРабот 	= ПланРабот;
		СтрТаб.Сумма 		= ТаблицаЗагрузки.Область(Н,6).Текст;
		
	КонецЦикла;
	Документ.Расходы.Сортировать("ПланРабот");
	
	// закрываем
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
КонецПроцедуры

