//   что за бред?
Функция ПолучитьПланКРпоЗаявкеНаРасход( ЗаявкаНаРасход ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Заявка.ЗадачаПроекта КАК ЗадачаПроекта
		|ПОМЕСТИТЬ ВТ_Задачи
		|ИЗ
		|	Документ.ЗаявкаНаВыплатуКоммРасходов.РаспределениеПоДокументам КАК Заявка
		|ГДЕ
		|	Заявка.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(БюджетПроекта.Сумма) КАК Сумма
		|ИЗ
		|	РегистрНакопления.БюджетПоМесяцам КАК БюджетПроекта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Задачи КАК ВТ_Задачи
		|		ПО БюджетПроекта.ЗадачаПроекта = ВТ_Задачи.ЗадачаПроекта
		|ГДЕ
		|	БюджетПроекта.СтатьяСметы = &стСтатьяСметы";

		
	Запрос.УстановитьПараметр("стСтатьяСметы", 	Справочники.СтатьиСметы.РасходыКоммерческие);
	Запрос.УстановитьПараметр("Ссылка",			ЗаявкаНаРасход);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Сумма;
	КонецЦикла;
	Возврат 0;

КонецФункции