
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если 		Параметры.ЗначенияЗаполнения.Свойство("ВедущаяРабота") Тогда
		ЗадачаПроекта = Параметры.ЗначенияЗаполнения.ВедущаяРабота.Владелец;
	ИначеЕсли 	Параметры.ЗначенияЗаполнения.Свойство("Работа") Тогда
		ЗадачаПроекта = Параметры.ЗначенияЗаполнения.Работа.Владелец;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Неправильные параметры заполнения";
		Сообщение.Сообщить();
		//Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
