&НаСервереБезКонтекста
Функция  ПолучитРазмерРКО( РКО, НаДату   )
	// из регистра	
	Если РКО Тогда
		ПроцентРКО = ПлановыйПоказательСметы( Год( НаДату ), "СтавкаРКО" );
		Возврат ПроцентРКО /100;
	КонецЕсли;
	Возврат 0;
КонецФункции

&НаКлиенте
Процедура ПересчетСуммыДокумента()
	Объект.СуммаДокумента = Окр( Объект.Расходы.Итог("Сумма") * (1 + ПолучитРазмерРКО(Объект.РКО, Объект.ПериодРегистрации )), 2 );
КонецПроцедуры

&НаКлиенте
Процедура РасходыПриИзменении(Элемент)
	ПересчетСуммыДокумента();
КонецПроцедуры

&НаКлиенте
Процедура РКОПриИзменении(Элемент)
	ПересчетСуммыДокумента();
КонецПроцедуры


&НаСервереБезКонтекста
Функция  ПодразделениеФизЛица(ФизическоеЛицо, Дата)
	тз = УП_КадрыСервер.СотрудникиФизЛица( ФизическоеЛицо, НачалоМесяца( Дата ));
	Если тз.Количество() = 0 Тогда
		Возврат Неопределено
	Иначе
		Возврат тз[0].Подразделение;
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура ФизическоеЛицоПриИзменении(Элемент)
	Объект.Подразделение = ПодразделениеФизЛица( Объект.ФизическоеЛицо, Объект.ПериодРегистрации );
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	Объект.ПериодРегистрации = НачалоМесяца( Объект.ПериодРегистрации );
КонецПроцедуры

&НаКлиенте
Процедура РасходыЗадачаПроектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//
	ПараметрыПР = Новый Структура;
	Если ЗадачиВсехПодразделений Тогда
		ПараметрыПР.Вставить("Подразделение", ПредопределенноеЗначение("Справочник.Подразделения.ПустаяСсылка" ));
	Иначе
		ПараметрыПР.Вставить("Подразделение", Объект.Подразделение );
	КонецЕсли;
	ПараметрыПР.Вставить("РежимВыбора", 	Истина);
	
	
	ОткрытьФорму( "Справочник.ЗадачиПроектов.Форма.ФормаВыбораПоПодразделению", ПараметрыПР, Элемент );
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#Область ЗагрузкаИзФайла

//************************
//  Excel
&НаКлиенте
Процедура ФайлЗагрузкиExcelНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла( РежимДиалогаВыбораФайла.Открытие );
	ДиалогОткрытияФайла.ПолноеИмяФайла 	= "";
	ДиалогОткрытияФайла.Фильтр			= "Лист Excel(*.xls)|*.xls|Лист Excel2007-...(*.xlsx)|*.xlsx";
	ДиалогОткрытияФайла.ПолноеИмяФайла	= ФайлЗагрузкиExcel;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Укажите файл для загрузки'");
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ФайлЗагрузкиExcel = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
		Если ПустаяСтрока(ФайлЗагрузкиExcel) Тогда
		ПоказатьПредупреждение(,"Укажите файл Microsoft Excel.", 10);
		Возврат;
	КонецЕсли;
	Если Объект.Расходы.Количество() <> 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ОбработкаФайлаПоВопросу", ЭтаФорма);
		ПоказатьВопрос( Оповещение, "При загрузке документ будет очищен, продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
		
	ОбработкаФайла();
	// Вставить содержимое обработчика.

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаФайлаПоВопросу( Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОбработкаФайла();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаФайла() 
	ТаблицаЗагрузки = Новый ТабличныйДокумент;
	
	Попытка
		// Загрузка Microsoft Excel
		//Сообщить("Загрузка Microsoft Excel...");
		ExcelПриложение = Новый COMОбъект("Excel.Application");
		
	Исключение
		
		Сообщить("Ошибка при загрузке Microsoft Excel." + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Внимание);
		Возврат;
		
	КонецПопытки;
		
	Попытка
		
		// Открытие файла Microsoft Excel
		//Состояние("Открытие файла Microsoft Excel...");
		ExcelФайл = ExcelПриложение.WorkBooks.Open(ФайлЗагрузкиExcel);
		
		// Обработка файла Microsoft Excel
		//Состояние("Обработка файла Microsoft Excel...");
		ExcelЛист = ExcelФайл.Sheets(1);
		xlCellTypeLastCell = 11;
		ExcelПоследняяСтрока = ExcelЛист.Cells.SpecialCells(xlCellTypeLastCell).Row;
		ExcelПоследняяКолонка = ExcelЛист.Cells.SpecialCells(xlCellTypeLastCell).Column;
		
		//ТаблицаЗагрузки.Очистить();
		
		Для Строка = 1 По ExcelПоследняяСтрока Цикл
			
			Для Колонка = 1 По ExcelПоследняяКолонка Цикл
				
				//Состояние("Обработка файла Microsoft Excel : "
							//+ "строка " + Строка + " из " + ExcelПоследняяСтрока
							//+ ", колонка " + Колонка + " из " + ExcelПоследняяКолонка);
				ExcelЯчейка = ExcelЛист.Cells(Строка, Колонка);
				ТаблицаЗагрузки.Область(Строка, Колонка, Строка, Колонка).Текст = ExcelЯчейка.Value;
				
			КонецЦикла;
			
		КонецЦикла;
		
	Исключение
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при открытии/чтении файла " + ФайлЗагрузкиExcel + "." + Символы.ПС + ОписаниеОшибки();
		Сообщение.Сообщить();
		
	КонецПопытки;
			
	ExcelПриложение.Quit();
	
	ОтбработатьТаблицуЗагрузки( ТаблицаЗагрузки );
	//
	Объект.РКО	= Истина;
	ФизическоеЛицоПриИзменении("");
	ПересчетСуммыДокумента();
	
	
КонецПроцедуры // ОбработкаФайла(Элемент)


&НаСервере
Процедура ОтбработатьТаблицуЗагрузки( ТаблицаЗагрузки )
	
	//ТаблицаЗагрузки = Новый ТабличныйДокумент;
	ФИО = ТаблицаЗагрузки.Область(1,1).Текст;
	// тест
	//ФИО = "Дубровина Е.В.";
	Если НЕ ЗначениеЗаполнено( ФИО ) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан сотрудник!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	//
	Документ 				= РеквизитФормыВЗначение("Объект");
	ФизическоеЛицо			= Справочники.ФизическиеЛица.НайтиПоКоду( ФИО, Истина );
	Если Документ.ФизическоеЛицо <> ФизическоеЛицо Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Файл загрузки для другого физического лица ["+ФИО+"]";
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;
	//	
	Документ.Расходы.Очистить();
	
	СтатьяРасходов = Константы.СтатьяРасходовПоСотруднику.Получить();
	
	МаксимальнаяДата = Дата(1,1,1);
	// для 
	СдвигНачалаЗаДень 	= 0;
	ПредыдущаяДата 		= "";
	Для Н = 3 ПО ТаблицаЗагрузки.ВысотаТаблицы Цикл
		// т.к. из табеля, то не во всех строках будет сумма
		Сумма			= ТаблицаЗагрузки.Область(Н,6).Текст;
		Если НЕ ЗначениеЗаполнено( Сумма ) Тогда
			Продолжить;
		КонецЕсли;
		
		// дата 
		Дата = ДатаИзФайлаExcel( ТаблицаЗагрузки.Область(Н,1).Текст);
		Если Дата = Неопределено Тогда Прервать; КонецЕсли;
		МаксимальнаяДата  = Макс( МаксимальнаяДата , Дата);
		
		СтрДок					= Документ.Расходы.Добавить();
		СтрДок.Дата				= Дата;
		
		// представление проекта = план работ
		сПланРабот				= ПланРаботИзФайлаExcel( ТаблицаЗагрузки.Область(Н,4).Текст, Дата );
		СтрДок.ЗадачаПроекта 	= сПланРабот.Основание.ЗадачаПроекта;
		// 
		СтрДок.СтатьяРасходов	= СтатьяРасходов;
		СтрДок.Сумма			= Сумма;
		СтрДок.Комментарий		= ТаблицаЗагрузки.Область(Н,7).Текст;
		
	КонецЦикла;
	Документ.Расходы.Сортировать("Дата,ЗадачаПроекта");
	
	//Документ.Дата = МаксимальнаяДата;
	Документ.ПериодРегистрации = НачалоМесяца( МаксимальнаяДата );
	// закрываем
	ЗначениеВРеквизитФормы(Документ, "Объект");
	// меняем подразделение	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДатаИзФайлаExcel( ДатаТекст)
	Попытка
		День 	= Число(Лев(ДатаТекст,2));
		Месяц 	= Число(Сред(ДатаТекст,4,2));	 
		Год 	= Число(Сред(ДатаТекст,7,4));	 
		Возврат Дата( Год, Месяц, День );
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

&НаСервереБезКонтекста
Функция ПланРаботИзФайлаExcel( Знач НомерПланаРабот, Дата )
	Возврат УП_ПланыРаботПоПроектам.ПланРаботИзФайлаExcel( НомерПланаРабот, Дата );
КонецФункции

//&НаСервереБезКонтекста
//Функция СтатьяРасходовПоУмолчанию()
//	Возврат Справочники.СтатьиРасходов.НайтиПоНаименованию("Командировочные расходы");
//КонецФункции

#КонецОбласти