
// Добавлена директива &НаСервере (Панферов Артем)18.01.18

&НаСервере
Функция Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода ) Экспорт
	// печать технлологичкую форму структуру сметы 
	// печать счёта на оплату
	ГодПроекта = Формат( Год(ПараметрыПечати.ГодПроекта), "ЧЦ=4; ЧГ=0");
	ПодготовитьПечатнуюФорму(
		"РасчетСтруктурыСметы",
		НСтр("ru = 'Расчет структуры сметы задачи проекта в '"+ГодПроекта + "'году'"),
		"",
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		ПараметрыПечати);
	
		
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Ложь;
	

КонецФункции

&НаСервере
Процедура ПодготовитьПечатнуюФорму(Знач ИмяМакета, ПредставлениеМакета, ПолныйПутьКМакету = "", МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода, ПараметрыПечати)
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета);
	Если НужноПечататьМакет Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		ИмяМакета,
		ПредставлениеМакета,
		ПечатьСтруктурыСметы( МассивОбъектов, ОбъектыПечати, ИмяМакета, ПараметрыПечати),
		,
		ПолныйПутьКМакету);
	КонецЕсли;
	
КонецПроцедуры

// Добавлена директива &НаСервере (Панферов Артем)   18.01.18
&НаСервере
Функция ПечатьСтруктурыСметы(МассивОбъектов, ОбъектыПечати, ИмяМакета = "", ПараметрыПечати) Экспорт
	ТабличныйДокумент 	= Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "РасчетСтруктурыСметы";
	//
	ГодПроекта 		= Год( ПараметрыПечати.ГодПроекта );
	СтруктураСметы 	= УП_СметаПроекта.ПолучитьСтруктуруСметыЗадачи( ГодПроекта );	
	Если СтруктураСметы = Неопределено Тогда
		Сообщить("Структура сметы не определена на указанный год "+ ГодПроекта);
		Возврат ТабличныйДокумент;
	КонецЕсли;
	Макет 				= Справочники.СтруктураСметы.ПолучитьМакет("ПФ_MXL_РасчетСтруктурыСметы");
	
	Обл = Макет.ПолучитьОбласть("Заголовок");
	Обл.Параметры.ГодПроекта = ГодПроекта;
	ТабличныйДокумент.Вывести( Обл );
	
	// по табличной части документа
	Для Каждого СтрСС ИЗ СтруктураСметы Цикл
		
		
		Если СтрСС.Значение.Итоговая Тогда 
			Обл = Макет.ПолучитьОбласть("РасчетИтоговая");
		Иначе
		
			Обл = Макет.ПолучитьОбласть("Расчет");
			СтрРаспределения = РегистрыСведений.РаспределениеСтатейПоМесяцам.ПолучитьПоследнее(ПараметрыПечати.ГодПроекта, Новый Структура("СтатьяСметы", СтрСс.Значение.Статья ));
			ЗаполнитьЗначенияСвойств( Обл.Параметры, СтрРаспределения );
			
		КонецЕсли;
		
		//
		ЗаполнитьЗначенияСвойств( Обл.Параметры, СтрСС.Значение );
		ТабличныйДокумент.Вывести( Обл );
	КонецЦикла;
	
	//
	ТабличныйДокумент.АвтоМасштаб 			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы 	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.Защита				= Истина;
	Возврат ТабличныйДокумент;
	
КонецФункции


