
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("СформироватьПриОткрытии",  Истина );
	
	ПараметрыФормы.Вставить("ЗадачаПроекта",  ЗадачаСметы(ПараметрКоманды));
	
	ОткрытьФорму("Отчет.БДРпоЗадаче.Форма.ФормаОтчетаПоЗадаче", 
					ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, 
					Новый УникальныйИдентификатор, 
					ПараметрыВыполненияКоманды.Окно, 
					ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

&НаСервере
Функция ЗадачаСметы(Смета)
	Возврат Смета.ЗадачаПроекта;
КонецФункции	