&НаКлиенте
Процедура ТекущийАктивнаяПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора( Список.Отбор,
		"Активная",
		ТекущийАктивная,
		ВидСравненияКомпоновкиДанных.Равно,,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТекущийГодПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора( Список.Отбор,
		"ГодЗадачи",
		ТекущийГод,
		ВидСравненияКомпоновкиДанных.Равно,,Истина);
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора( Список.Отбор,
		"ГодЗадачи",
		ТекущийГод,
		ВидСравненияКомпоновкиДанных.Равно,,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора( Список.Отбор,
		"Активная",
		ТекущийАктивная,
		ВидСравненияКомпоновкиДанных.Равно,,Истина);
КонецПроцедуры
