
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//ПараметрыФормы = Новый Структура("Отбор", Новый Структура("ЗадачаПроекта", ПараметрКоманды));
	ПараметрыФормы = Новый Структура("ЗадачаПроекта", ПараметрКоманды);
	ОткрытьФорму("Документ.Договор.Форма.ФормаСпискаЗадачиПроекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, 
				ПараметрыВыполненияКоманды.Уникальность, 
				ПараметрыВыполненияКоманды.Окно, 
				ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
