
&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)
	ЗаполнитьПоОстаткамНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОстаткамНаСервере()
	ДокументВКР = РеквизитФормыВЗначение("Объект");
	ДокументВКР.ВыплатыКР.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКР_Остатки.КлиентМенеджер КАК КлиентМенеджер,
		|	ВКР_Остатки.ВидТЗ КАК ВидТЗ,
		|	СУММА(ВКР_Остатки.СуммаОстаток) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВыплатыКоммерческихРасходов.Остатки(&ДатаОстатков, ) КАК ВКР_Остатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКР_Остатки.КлиентМенеджер,
		|	ВКР_Остатки.ВидТЗ
		|
		|УПОРЯДОЧИТЬ ПО
		|	КлиентМенеджер,
		|	ВидТЗ";

	
	Запрос.УстановитьПараметр("ДатаОстатков", НачалоМесяца( Объект.Дата ));
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	РезультатЗапроса.Сортировать("КлиентМенеджер");

	ДокументВКР.ВыплатыКР.Загрузить( РезультатЗапроса );
	
	ЗначениеВРеквизитФормы( ДокументВКР, "Объект");
	

КонецПроцедуры
