// остаток запланированного расхода по указанной документу, статье,  РКО
Функция ПолучитьПланПоСтатьеРасхода( ЗаявкаНаВыплату ) Экспорт
	Отбор 	= Новый Структура;
	Отбор.Вставить("СтатьяРасходов", 	ЗаявкаНаВыплату.СтатьяРасходов );
	Отбор.Вставить("РКО", 		ЗаявкаНаВыплату.РКО );
	План 	= ЗаявкаНаВыплату.РасходПоЗадаче.Описание.Выгрузить(Отбор, "Сумма");
	Возврат План.Итог("Сумма"); 
	
КонецФункции


// остаток запланированного расхода по указанной документу, статье,  РКО
Функция ПолучитьОстатокПоСтатьеРасхода( ЗаявкаНаВыплату, СтатьяРасходов, РКО ) Экспорт
	РасходПоЗадаче 	= ЗаявкаНаВыплату.РасходПоЗадаче;
	
	
	Если ЗначениеЗаполнено(РасходПоЗадаче)
	и	 ЗначениеЗаполнено(СтатьяРасходов) Тогда
	Иначе
		Возврат 0;
	КонецЕсли;
	Если ТипЗнч( РасходПоЗадаче ) = Тип("ДокументСсылка.РасходПоЗадачеПроекта") Тогда
		НазвТипа = "РасходПоЗадачеПроекта"
	Иначе
		НазвТипа = "РасходПоЗадачеПроизводство"
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(План.Сумма) КАК СуммаПлан,
		|	СУММА(0) КАК СуммаВыплачено
		|ИЗ
		|	Документ." + НазвТипа + ".Описание КАК План
		|ГДЕ
		|	План.СтатьяРасходов = &СтатьяРасходов
		|	И План.РКО = &РКО
		|	И План.Ссылка.Проведен
		|	И План.Ссылка.Ссылка = &РасходПоЗадаче
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СУММА(0),
		|	СУММА(ЗаявкаНаВыплатуРасхода.СуммаДокумента)
		|ИЗ
		|	Документ.ЗаявкаНаВыплатуРасхода КАК ЗаявкаНаВыплатуРасхода
		|ГДЕ
		|	ЗаявкаНаВыплатуРасхода.Ссылка <> &Ссылка
		|	И ЗаявкаНаВыплатуРасхода.Проведен
		|	И ЗаявкаНаВыплатуРасхода.СтатьяРасходов = &СтатьяРасходов
		|	И ЗаявкаНаВыплатуРасхода.РКО = &РКО
		|	И ЗаявкаНаВыплатуРасхода.РасходПоЗадаче = &РасходПоЗадаче";

	//
	Запрос.УстановитьПараметр("РасходПоЗадаче", РасходПоЗадаче);
	Запрос.УстановитьПараметр("РКО", 			РКО);
	Запрос.УстановитьПараметр("СтатьяРасходов", СтатьяРасходов);
	Запрос.УстановитьПараметр("Ссылка", 		ЗаявкаНаВыплату);

	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 0 Тогда 
		Возврат 0;
	КонецЕсли;
	Возврат  Результат.Итог( "СуммаПлан")-Результат.Итог( "СуммаВыплачено")

КонецФункции
