
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходПоЗадачеПроекта") Тогда
		// Заполнение шапки
		РасходПоЗадаче = ДанныеЗаполнения.Ссылка;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходПоЗадачеПроизводство") Тогда
		// Заполнение шапки
		РасходПоЗадаче = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
	ИсполнительДокумента = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// !!! как указать задачи в движении 
	// до проведения !!!
	ОстатокРасхода = Документы.ЗаявкаНаВыплатуРасхода.ПолучитьОстатокПоСтатьеРасхода( Ссылка, Ссылка.СтатьяРасходов, Ссылка.РКО );
	Если ОстатокРасхода < СуммаДокумента Тогда
		Сообщить("Недостаточный остаток по статье " + Формат(ОстатокРасхода - СуммаДокумента, "ЧЦ=15; ЧДЦ=2"));
		//Отказ = Истина;
	КонецЕсли;
	
	// 29,04,2013
	Движения.БюджетПоМесяцам.Записывать = Истина;
	Движение = Движения.БюджетПоМесяцам.Добавить();
	Движение.Период 		= Дата;
	Движение.ЗадачаПроекта 	= РасходПоЗадаче.ЗадачаПроекта;
	Движение.СтатьяСметы	= РасходПоЗадаче.СтатьяСметы;
	Движение.ТипСуммы 		= Перечисления.ТипСуммыБюджета.Факт;  // факт
	// 23,10,2013
	Движение.Месяц			= НачалоМесяца(ПериодРегистрации);
	//
	Движение.Сумма 			= СуммаДокумента;
	// РКО - всегда нал
	Движение.РКО			= РКО;
	Движения.Записать();
		

КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если УП_ПереносДанных.ПроведениеПриПереносе() Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
	И НЕ РазрешеноПроводитьДокумент( Ссылка, Ссылка.РасходПоЗадаче.ЗадачаПроекта.Владелец  ) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;		

КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	// Вставить содержимое обработчика.
КонецПроцедуры

