
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходПоЗадачеПроекта") Тогда
		// Заполнение шапки
		РасходПоЗадаче = ДанныеЗаполнения.Ссылка;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходПоЗадачеПроизводство") Тогда
		// Заполнение шапки
		РасходПоЗадаче = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
	ИсполнительДокумента = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//Структура сметы
	Движения.БюджетПоМесяцам.Записывать = Истина;
	
	сСметы =  Новый Соответствие;
	сСтатей = Новый Соответствие;
	пСтатей = Новый Соответствие;            
	oСтатей = Новый Соответствие;
	УП_СметаПроекта.ПодготовкаФактБюджета(сСметы, сСтатей, пСтатей, oСтатей, РасходПоЗадаче.ЗадачаПроекта);	
	
	СтатьяСметы = РасходПоЗадаче.СтатьяСметы.ИмяПредопределенныхДанных;
	сСтатей[СтатьяСметы] = СуммаДокумента; 
	
	УП_СметаПроекта.ПроведениеФактБюджета(сСметы, сСтатей, oСтатей, Движения, РасходПоЗадаче.ЗадачаПроекта, ПериодРегистрации, Дата);
	
	// до проведения !!!
	ОстатокРасхода = Документы.ЗаявкаНаВыплатуРасхода.ПолучитьОстатокПоСтатьеРасхода( Ссылка, Ссылка.СтатьяРасходов, Ссылка.РКО );
	Если ОстатокРасхода < СуммаДокумента Тогда
		Сообщить("Недостаточный остаток по статье " + Формат(ОстатокРасхода - СуммаДокумента, "ЧЦ=15; ЧДЦ=2"));
		//Отказ = Истина;
	КонецЕсли;
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если УП_ПереносДанных.ПроведениеПриПереносе() Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
	И НЕ РазрешеноПроводитьДокумент( Ссылка, Ссылка.РасходПоЗадаче.ЗадачаПроекта.Владелец  ) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;		

КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	// Вставить содержимое обработчика.
КонецПроцедуры

