
Процедура ОбработкаПроведения(Отказ, Режим)
	//Статья = Справочники.СтатьиСметы.НалогНагрузкаВыч;
	
	
		
	// регистр БюджетПоМесяцам 
	Движения.БюджетПоМесяцам.Записывать = Истина;
	Для Каждого ТекСтрокаРаспределение Из Распределение Цикл
		СуммаНН	= ТекСтрокаРаспределение.Сумма;
		Если СуммаНН = 0 Тогда Продолжить; КонецЕсли;
		
		Движение = Движения.БюджетПоМесяцам.Добавить();
		Движение.Период 		= Дата;
		Движение.ЗадачаПроекта 	= ТекСтрокаРаспределение.ЗадачаПроекта;
		Движение.СтатьяСметы	= СтатьяСметы; 	
		Движение.ТипСуммы 		= Перечисления.ТипСуммыБюджета.Факт; 		// факт
		Движение.Месяц 			= НачалоМесяца(ТекСтрокаРаспределение.МесяцОплаты);
		// сумма
		Движение.Сумма 			= СуммаНН;
			
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ИсполнительДокумента 	= ПараметрыСеанса.ТекущийПользователь;

КонецПроцедуры

