
// с учетом директора проекта
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора( Список.Отбор.Элементы,
	"Менеджеры проектов", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли );
	
	//
	ТекущийКлиентМенеджер = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
	мПользователей = СКД_ДоступныеФЛ( ТекущийКлиентМенеджер );
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ГруппаОтбора, "ПланРаботТиражный.ЗадачаПроекта.Владелец.МенеджерПроекта", 
		ВидСравненияКомпоновкиДанных.ВСписке, 
		мПользователей);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ГруппаОтбора, "ПланРаботТиражный.ЗадачаПроекта.Владелец.ДиректорПроекта", ВидСравненияКомпоновкиДанных.ВСписке, мПользователей);
		
КонецПроцедуры
