&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущийТип = Перечисления.ТипОтбораДоговора.Все;
	ДатаС = НачалоГода(ТекущаяДата());
	ДатаПо = КонецГода(ТекущаяДата());
	
	ТекущийГодПриИзмененииСервер();
	
	Если НЕ СКД_ВсеМенеджеры() Тогда 
		ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора( Список.Отбор.Элементы,
			"Менеджеры проектов", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли );
		
		ТекущийКлиентМенеджер = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
		мПользователей = СКД_ДоступныеФЛ(ТекущийКлиентМенеджер);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаОтбора, "Проект.Куратор", ВидСравненияКомпоновкиДанных.ВСписке, мПользователей);
			
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаОтбора, "Проект.МенеджерПроекта", ВидСравненияКомпоновкиДанных.ВСписке, мПользователей);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаОтбора, "Проект.ДиректорПроекта", ВидСравненияКомпоновкиДанных.ВСписке, мПользователей);			
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТекущийТипПриИзменении(Элемент)
	ТекущийТипПриИзмененииСервер();
КонецПроцедуры

&НаСервере
Процедура ТекущийТипПриИзмененииСервер()
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора( 
		Список.Отбор,
		"Фиктивный",
		ТекущийТип = Перечисления.ТипОтбораДоговора.Фиктивные,
		ВидСравненияКомпоновкиДанных.Равно,,ТекущийТип <> Перечисления.ТипОтбораДоговора.Все);
КонецПроцедуры

&НаКлиенте
Процедура ТекущийГодПриИзменении(Элемент)
	ТекущийГодПриИзмененииСервер();
КонецПроцедуры

&НаСервере
Процедура ТекущийГодПриИзмененииСервер()
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "ДатаС", ДатаС, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "ДатаПо", ДатаПо, Истина);
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	ТекущийТипПриИзмененииСервер();
	ТекущийГодПриИзмененииСервер();                           
КонецПроцедуры