
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Проекты") Тогда
		// Заполнение шапки
		Проект = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
	ИсполнительДокумента = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// перенос
	Если УП_ПереносДанных.ПроведениеПриПереносе() Тогда
		Возврат;
	КонецЕсли;
		
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И НЕ РазрешеноПроводитьДокумент( Ссылка, Ссылка.Проект ) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	объект = ЭтотОбъект.Проект.ПолучитьОбъект();
	объект.Статус = Перечисления.СтатусыПроектов.Согласование;
	объект.Записать();
	
	Сообщить("Проект переведен в состояние 'Согласование'");	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	объект = ЭтотОбъект.Проект.ПолучитьОбъект();	
	объект.Статус = Перечисления.СтатусыПроектов.Корректировка;
	объект.Записать();
	
	Сообщить("Проект переведен в состояние 'Корректировка'");	
КонецПроцедуры