
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ИсполнительДокумента = ПараметрыСеанса.ТекущийПользователь;

КонецПроцедуры

Функция ДокументУжеСуществует()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТабельПодразделения.Ссылка
		|ИЗ
		|	Документ.ТабельПодразделения КАК ТабельПодразделения
		|ГДЕ
		|	ТабельПодразделения.Проведен
		|	И ТабельПодразделения.ПериодРегистрации = &ПериодРегистрации
		|	И ТабельПодразделения.Ссылка <> &Ссылка
		|	И ТабельПодразделения.Подразделение = &Подразделение";

		
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("ПериодРегистрации", 	ПериодРегистрации);
	Запрос.УстановитьПараметр("Подразделение", 		Подразделение);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить("Табель подразделения " + Подразделение + Символы.ПС + 
				"за " + Формат( ПериодРегистрации, "ДФ = 'ММММ гг'") + " уже проведен");
		Возврат Истина;
	КонецЦикла;
	// 
	Возврат Ложь;
	
КонецФункции



Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если  ДокументУжеСуществует() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры
