//Добавлено 03.10.2018 по задаче #133466 ГумединАГ
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Год = 2018;
	Если ВвестиЧисло(Год, "Введите год нового проекта", 4, 0) Тогда
		ВыделенныеСтроки = ПараметрыВыполненияКоманды.Источник.Элементы.Список.ВыделенныеСтроки;
    	СкопироватьПроектыНаСервере(Год, ВыделенныеСтроки);
	КонецЕсли;
КонецПроцедуры

//Добавлено 03.10.2018 по задаче #133466 ГумединАГ
&НаСервере
Процедура СкопироватьПроектыНаСервере(Год, ВыделенныеСтроки)
	//Массив проектов и их копий
	СоответствиеПроектов = Новый Соответствие; //Требуется, что бы не потерять связь между проектом и копией
	МассивПроектов = Новый Массив; //Треьуется, что бы быстро отобрать все требуеющиеся задачи
	
	Для Каждого Элем Из ВыделенныеСтроки Цикл 
		ТекПроект = Элем.Ссылка;
		НовыйПроект = ТекПроект.Скопировать();
		НовыйПроект.ГодПроекта = Год;
		НовыйПроект.Наименование = ТекПроект.Наименование + " Копия";
		НовыйПроект.Записать();
		
		СоответствиеПроектов.Вставить(Элем, НовыйПроект);
		МассивПроектов.Добавить(Элем);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачиПроектов.Ссылка КАК ЗадачаПроекта,
		|	СметаЗадачиПроекта.Ссылка КАК СметаЗадачи
		|ИЗ
		|	Справочник.ЗадачиПроектов КАК ЗадачиПроектов
		|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.СметаЗадачиПроекта КАК СметаЗадачиПроекта
		|		ПО ЗадачиПроектов.Ссылка = СметаЗадачиПроекта.ЗадачаПроекта
		|ГДЕ
		|	ЗадачиПроектов.Владелец В(&Проекты)
		|	И ЗадачиПроектов.ПометкаУдаления = &ПометкаУдаления
		|	И СметаЗадачиПроекта.ПометкаУдаления = &ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Проекты", МассивПроектов);
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МассивДанных = РезультатЗапроса.Выгрузить();
	
	//Копируем так же все задачи
	ТекущаяЗадача = "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ТекущаяЗадача = "" Или Не ТекущаяЗадача = ВыборкаДетальныеЗаписи.ЗадачаПроекта Тогда 
			ТекущаяЗадача = ВыборкаДетальныеЗаписи.ЗадачаПроекта;
			
			СкопироватьЗадачуПроектовНаСервере(
				СоответствиеПроектов.Получить(ВыборкаДетальныеЗаписи.ЗадачаПроекта.Владелец), 	//Новый проект
				ВыборкаДетальныеЗаписи.ЗадачаПроекта,  											//Задача проекта		
				МассивДанных);                                                                  //Для копирования смет задач
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

//Добавлено 03.10.2018 по задаче #133466 ГумединАГ
//Копируем так же все задачи
&НаСервере
Процедура СкопироватьЗадачуПроектовНаСервере(НовыйПроект, ЗадачаПроекта, МассивДанных)
	
	НоваяЗадача = ЗадачаПроекта.Скопировать();
	НоваяЗадача.Наименование = НоваяЗадача.Наименование + " Копия";
	НоваяЗадача.Владелец = НовыйПроект.Ссылка;
	НоваяЗадача.ОбменДанными.Загрузка = Истина;
	НоваяЗадача.Записать();
	
	СкопироватьСметуЗадачиНаСервере(ЗадачаПроекта, НоваяЗадача, МассивДанных);
	
КонецПроцедуры

//Добавлено 03.10.2018 по задаче #133466 ГумединАГ
//Копируем так же все сметы задачи
&НаСервере
Процедура СкопироватьСметуЗадачиНаСервере(ЗадачаПроекта, НоваяЗадача, МассивДанных)
	
	Для Каждого Элемент Из МассивДанных Цикл
		Если Элемент.ЗадачаПроекта = ЗадачаПроекта Тогда
			СметаЗадачи = Элемент.СметаЗадачи;
			НоваяСмета = СметаЗадачи.Скопировать();
			НоваяСмета.Дата = ТекущаяДата();
			НоваяСмета.ЗадачаПроекта = НоваяЗадача.Ссылка;
			НоваяСмета.Записать();
		КонецЕсли;	
	КонецЦикла;
			
КонецПроцедуры

