&НаСервереБезКонтекста
Функция ПолучитьОстатокПоЗакупке( ЗаявкаНаВыплату )
	Возврат Документы.ЗаявкаНаОплатуПоставщику.ПолучитьОстатокПоЗакупкеППЛО( ЗаявкаНаВыплату );
КонецФункции

&НаКлиенте
Процедура УстановитьОстатокПоЗакупке()
	ОстатокПоЗакупке	= ПолучитьОстатокПоЗакупке( Объект.Ссылка );
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьОстатокПоЗакупке();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОстатокПоЗакупке();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение 
	//И НЕ РазрешеноПроводитьДокумент( ТекущийОбъект.Ссылка, ТекущийОбъект.ЗакупкаППЛО.ЗадачаПроекта.Владелец ) Тогда
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;		
КонецПроцедуры

//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	Если НЕ РазрешеноСоздаватьДокумент( Объект.Ссылка, Объект.ЗакупкаППЛО.ЗадачаПроекта.Владелец ) Тогда
//		Сообщить("Документ создается только на основании проекта в статусе 'В работе !");
//		Отказ = Истина;
//		Возврат;
//	КонецЕсли;		
//КонецПроцедуры



