
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ПараметрыВыполненияКоманды.Источник.Элементы.Найти("Список") <> Неопределено Тогда
		Если ТипЗнч(ПараметрыВыполненияКоманды.Источник.Элементы.Список) = Тип("ТаблицаФормы") Тогда
			Для Каждого проект из ПараметрыВыполненияКоманды.Источник.Элементы.Список.ВыделенныеСтроки Цикл
				УстановитьСтатусаЗадач(проект); 
			КонецЦикла;
			ОповеститьОбИзменении(ПараметрКоманды);
		КонецЕсли;
	ИначеЕсли ПараметрыВыполненияКоманды.Источник.Элементы.Найти("СтатусЗадач") <> Неопределено Тогда
		Объект = ПараметрыВыполненияКоманды.Источник.Объект;
		Результат = ПроверкаСтатусаЗадач(Объект);
		ПараметрыВыполненияКоманды.Источник.Объект.СтатусЗадач = Результат;
		ПараметрыВыполненияКоманды.Источник.Модифицированность = Истина;
	Иначе 
		Сообщить("Проверка статуса задач. Неизвестный источник вызова.");     
	КонецЕсли	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусаЗадач(НаименованиеПроекта)
	проект = Справочники.Проекты.НайтиПоНаименованию(НаименованиеПроекта).ПолучитьОбъект();
	Результат = ПроверкаСтатусаЗадач(проект);
	проект.СтатусЗадач = Результат;
	проект.Записать();
КонецПроцедуры

&НаСервере
Функция ПроверкаСтатусаЗадач(проект)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачиПроектов.Ссылка
		|ИЗ
		|	Справочник.ЗадачиПроектов КАК ЗадачиПроектов
		|ГДЕ
		|	ЗадачиПроектов.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", проект.Ссылка);
	
	Результат = Перечисления.СтатусыЗадачПроектов.Корректный;
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Для Каждого задача Из РезультатЗапроса Цикл 
		Если Справочники.ЗадачиПроектов.ПроверкаСтатусаЗадач(задача.Ссылка) <> Перечисления.СтатусыЗадачПроектов.Корректный Тогда 
			Результат = Перечисления.СтатусыЗадачПроектов.Ошибки;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции