
// с учетом директора проекта
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора( Список.Отбор.Элементы,
	"Менеджеры проектов", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли );
	
	// доступные физические лица 
	ТекущееФизЛицо 	= ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
	мФизическихЛиц	= СКД_ДоступныеФЛ( ТекущееФизЛицо );
	
	Если Параметры.Свойство("КлиентМенеджер") Тогда
	
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаОтбора, "ЗадачаПроекта.Владелец.МенеджерПроекта", ВидСравненияКомпоновкиДанных.ВСписке, мФизическихЛиц);
			
	КонецЕсли;			
	
	Если Параметры.Свойство("ДиректорПроекта") Тогда
	
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаОтбора, "ЗадачаПроекта.Владелец.ДиректорПроекта", ВидСравненияКомпоновкиДанных.ВСписке, мФизическихЛиц);
		
	КонецЕсли;			
		
КонецПроцедуры
