
//Процедура ОбработкаПроведения(Отказ, Режим)
//	СтатьяДокумента = Справочники.СтатьиСметы.ВознаграждениеКМ;
//	// регистр БюджетПоМесяцам 
//	Движения.БюджетПоМесяцам.Записывать = Истина;
//	Для Каждого ТекСтрокаРаспределение Из Распределение Цикл
//		Движение 				= Движения.БюджетПоМесяцам.Добавить();
//		Движение.Период 		= Дата;
//		Движение.ЗадачаПроекта 	= ТекСтрокаРаспределение.ЗадачаПроекта;
//		Движение.СтатьяСметы	= СтатьяДокумента;
//		Движение.ТипСуммы		= Перечисления.ТипСуммыБюджета.Факт;
//		Движение.Месяц			= НачалоМесяца( ПериодРегистрации );
//		
//		Движение.Сумма 			= ТекСтрокаРаспределение.Сумма;
//		// 2017 08 08
//		Движение.РКО			= Истина;
//	КонецЦикла;

//КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	СтатьяДокумента = Справочники.СтатьиСметы.ВознаграждениеКМ;
	// регистр ОбеспеченоПоСтатье Расход
	Движения.ОбеспеченоПоСтатье.Записывать = Истина;
	Для Каждого ТекСтрокаРаспределение Из Распределение Цикл
		Если ТекСтрокаРаспределение.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		Движение = Движения.ОбеспеченоПоСтатье.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Период 		= Дата;
		Движение.ЗадачаПроекта 	= ТекСтрокаРаспределение.ЗадачаПроекта;
		Движение.СтатьяСметы	= СтатьяДокумента;
		Движение.Сумма 			= ТекСтрокаРаспределение.Сумма;
	КонецЦикла;

КонецПроцедуры



Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ИсполнительДокумента = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры
