
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(РасчетСметы)
	ТабДок = Новый ТабличныйДокумент;
	РасчетСметы(ТабДок, ПараметрКоманды);

	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб			= Истина;
	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Защита 				= Ложь;
	ТабДок.ТолькоПросмотр 		= Ложь;
	ТабДок.ОтображатьЗаголовки 	= Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура РасчетСметы(ТабДок, ПараметрКоманды)
	Справочники.РасчетыСтатейСметы.РасчетСметы(ТабДок, ПараметрКоманды);
КонецПроцедуры
