
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ЗадачиПроектов") Тогда
		// Заполнение шапки
		ЗадачаПроекта 		= ДанныеЗаполнения.Ссылка;
		Проект				= ЗадачаПроекта.Владелец;
		//
		ВидНоменклатуры		= ЗадачаПроекта.ТиповаяЗадача.ВидНоменклатуры;  
		Правообладатель		= ВидНоменклатуры.Правообладатель;  
	КонецЕсли;
	ИсполнительДокумента 		= ПараметрыСеанса.ТекущийПользователь;
	ДатаОплатыПравообладателю	= ТекущаяДата();
	ДатаОплатыКлиента			= ТекущаяДата();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//  + месяц - проект
	Движения.БюджетПоМесяцам.Записывать = Истина;
	
	// 1. доходы ПП Лок
	Движение = Движения.БюджетПоМесяцам.Добавить();
	Движение.Период 			= Дата; // ДатаОплатыКлиента;
	Движение.ЗадачаПроекта		= ЗадачаПроекта;
	Движение.СтатьяСметы 		= Справочники.СтатьиСметы.ДоходыВс;
	// 
	Движение.ТипСуммы 			= Перечисления.ТипСуммыБюджета.ПервичныйДокумент;  // первичка
	Движение.Месяц	 			= НачалоМесяца( ДатаОплатыКлиента );  
	Движение.Сумма				= СуммаДопОтКлиента + Товар.Итог("СуммаПП");

	// 2 расходы на покупку ПП ЛО 
	Движение = Движения.БюджетПоМесяцам.Добавить();
	Движение.Период 			= Дата;
	Движение.ЗадачаПроекта		= ЗадачаПроекта;
	Движение.СтатьяСметы		= Справочники.СтатьиСметы.РасходыППЛО;
	// 
	Движение.ТипСуммы 			= Перечисления.ТипСуммыБюджета.ПервичныйДокумент;  // первичка
	Движение.Месяц	 			= НачалоМесяца( ДатаОплатыПравообладателю );  
	Движение.Сумма 				= Товар.Итог("СуммаПравоОбл") - СуммаДопОтВендора;
	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	Если УП_СметаПроекта.Есть_СметаЗадачи_СодержащаяДокумент( Ссылка ) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// перенос
	Если УП_ПереносДанных.ПроведениеПриПереносе() Тогда
		Возврат;
	КонецЕсли;
		
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
	И НЕ РазрешеноПроводитьДокумент( Ссылка, Ссылка.ЗадачаПроекта.Владелец ) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;		

КонецПроцедуры
