Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	//Исправлено по задаче #131618 05.07.2018 Гумедин А.Г.
	Статус 	= Перечисления.СтатусыПроектов.Прогноз;
	//Куратор = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

Функция ВыполнитьПроверкуСтатусаЗадач() Экспорт
	Протокол = Новый ТаблицаЗначений();
	Протокол.Колонки.Добавить("Результат");
	Протокол.Колонки.Добавить("Сообщение");
	Протокол.Колонки.Добавить("Задача");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачиПроектов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЗадачиПроектов КАК ЗадачиПроектов
		|ГДЕ
		|	ЗадачиПроектов.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Ссылка);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		Объект = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		Объект.ПроверкаСтатусаЗадач(Протокол);
	КонецЦикла;
	
	Если Протокол.Количество() > 0 Тогда 
		Статус = Перечисления.СтатусыЗадачПроектов.Ошибки;
	Иначе 
		Статус = Перечисления.СтатусыЗадачПроектов.Корректный;
	КонецЕсли;
	
	СтатусДата = ТекущаяДата();
	Записать();
	
	Возврат Протокол;
КонецФункции	