&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ГодЗадачи") Тогда 
		ГодЗадачи = Параметры["ГодЗадачи"];
	КонецЕсли;
	
	Если Параметры.Свойство("Контрагент") Тогда 
		Контрагент = Параметры["Контрагент"];
	КонецЕсли;
	
	Если Параметры.Свойство("Проекты") Тогда 
		Проекты = Новый СписокЗначений();
		Для Каждого запись Из Параметры["Проекты"] Цикл
			Проекты.Добавить(запись.Проект);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	Если ТекущийГод = 0 Тогда
		ТекущийГод = Год(ТекущаяДата());	
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора( Список.Отбор,
		"ГодЗадачи",
		ТекущийГод,
		ВидСравненияКомпоновкиДанных.Равно,,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора( Список.Отбор,
		"Активная",
		ТекущийАктивная,
		ВидСравненияКомпоновкиДанных.Равно,,Истина);		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора( Список.Отбор,
		"Контрагент",
		Контрагент,
		ВидСравненияКомпоновкиДанных.Равно,,СУчетомКонтрагента);		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора( Список.Отбор,
		"Владелец",
		Проекты,
		ВидСравненияКомпоновкиДанных.ВСписке,,СУчетомПроектов);		
КонецПроцедуры

&НаКлиенте
Процедура ТекущийАктивнаяПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора( Список.Отбор,
		"Активная",
		ТекущийАктивная,
		ВидСравненияКомпоновкиДанных.Равно,,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТекущийГодПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора( Список.Отбор,
		"ГодЗадачи",
		ТекущийГод,
		ВидСравненияКомпоновкиДанных.Равно,,Истина);
КонецПроцедуры

&НаКлиенте
Процедура СУчетомКонтрагентаПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора( Список.Отбор,
		"Контрагент",
		Контрагент,
		ВидСравненияКомпоновкиДанных.Равно,,СУчетомКонтрагента);		
КонецПроцедуры

&НаКлиенте
Процедура СУчетомПроектовПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора( Список.Отбор,
		"Владелец",
		Проекты,
		ВидСравненияКомпоновкиДанных.ВСписке,,СУчетомПроектов);		
КонецПроцедуры