
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить( "Отбор", 					Новый Структура("Подразделение", ПараметрКоманды ));
	ПараметрыФормы.Вставить( "СформироватьПриОткрытии", Истина );
	ПараметрыФормы.Вставить( "КлючВарианта", 			"АнализЗагруженности" );
	
	//
	ОткрытьФорму("Отчет.АнализЗагруженностиПодразделений.Форма", 
					ПараметрыФормы, 
					ПараметрыВыполненияКоманды.Источник, 
					ПараметрыВыполненияКоманды.Уникальность, 
					ПараметрыВыполненияКоманды.Окно, 
					ПараметрыВыполненияКоманды.НавигационнаяСсылка);

КонецПроцедуры
