
&НаСервере
Функция РеквизитОбъекта( Объект, ИмяРеквизита )
	Возврат Объект[ИмяРеквизита];
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	Если 		ТипЗнч( ПараметрКоманды )= Тип("ДокументСсылка.Смета")     			Тогда
		//ПолностьюПроект = Истина;
		ЗадачаПроекта	= ПредопределенноеЗначение("Справочник.ЗадачиПроектов.ПустаяСсылка");
		Проект			= РеквизитОбъекта( ПараметрКоманды, "Проект");
		
	ИначеЕсли 	ТипЗнч( ПараметрКоманды )= Тип("ДокументСсылка.СметаЗадачиПроекта") 	Тогда
		//ПолностьюПроект = Ложь;
		ЗадачаПроекта	= РеквизитОбъекта( ПараметрКоманды, "ЗадачаПроекта");
		Проект			= ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");
		
		
	ИначеЕсли 	ТипЗнч( ПараметрКоманды )= Тип("СправочникСсылка.Проекты") 			Тогда
		//ПолностьюПроект = Истина;
		ЗадачаПроекта	= ПредопределенноеЗначение("Справочник.ЗадачиПроектов.ПустаяСсылка");
		Проект			= ПараметрКоманды;
		
	ИначеЕсли 	ТипЗнч( ПараметрКоманды )= Тип("СправочникСсылка.ЗадачиПроектов") 		Тогда
		//ПолностьюПроект = Ложь;
		ЗадачаПроекта	= ПараметрКоманды;
		Проект			= ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");
		//Проект			= РеквизитОбъекта( ПараметрКоманды, "Владелец");
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	//ПараметрыФормы.Вставить("ПолностьюПроект", 			ПолностьюПроект);
	ПараметрыФормы.Вставить("ЗадачаПроекта", 			ЗадачаПроекта);
	ПараметрыФормы.Вставить("Проект", 					Проект);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", 	Истина);
	ПараметрыФормы.Вставить("КлючВарианта",				"Основной");
	
	
	ОткрытьФорму("Отчет.ПланФактЗадачиПроекта.Форма.ФормаОтчета", ПараметрыФормы, 
				ПараметрыВыполненияКоманды.Источник, 
				Новый УникальныйИдентификатор,//ПараметрыВыполненияКоманды.Уникальность, 
				ПараметрыВыполненияКоманды.Окно, 
				ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
