&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДоступныВсеПроекты = СКД_ВсеМенеджеры();
	
	//!!!!!!!!!!!!!! При присвоении значения праметру считает что оно пустое и не вставляет в запрос
	Если ДоступныВсеПроекты = 0 Тогда 
		ДоступныВсеПроекты = -1;
	КонецЕсли;
	
	СКД_ЗначенияМассив(СКД_ДоступныеФЛ(), ФизЛицаПользователя, Истина);
	
	УстановитьПараметрыПоУмолчанию();                                   
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыПоУмолчанию(Принудительно = Ложь)
	ГодЗадачи = Год(ТекущаяДата());
	СКД_ЗначенияСправочника("Справочник.ИсточникФинансирования", ИсточникФинансирования, Принудительно);
	СКД_ЗначенияСправочника("Справочник.Организации", Организация, Принудительно, Справочники.Организации.ПустаяСсылка());     
	СКД_ЗначенияСправочника("Перечисление.СтатусыПроектов", Статус, Принудительно);     
	
	Запрос = "ВЫБРАТЬ
	         |	ЗадачиПроектов.Подразделение.Ссылка КАК Ссылка
	         |ИЗ
	         |	Справочник.ЗадачиПроектов КАК ЗадачиПроектов
	         |ГДЕ
	         |	ЗадачиПроектов.ГодЗадачи = " + Формат(ГодЗадачи, "ЧГ=0") + "
	         |
	         |СГРУППИРОВАТЬ ПО
	         |	ЗадачиПроектов.Подразделение";
	СКД_ЗначенияЗапрос(Запрос, Подразделение, Принудительно);                   
	
	Запрос = "ВЫБРАТЬ
	         |	ЗадачиПроектов.Подразделение.Ссылка КАК Ссылка
	         |ИЗ
	         |	Справочник.ЗадачиПроектов КАК ЗадачиПроектов
	         |ГДЕ
	         |	ЗадачиПроектов.ГодЗадачи = " + Формат(ГодЗадачи, "ЧГ=0") + "
	         |
	         |СГРУППИРОВАТЬ ПО
	         |	ЗадачиПроектов.Подразделение";
	СКД_ЗначенияЗапрос(Запрос, Подразделение, Принудительно);     
	
	Запрос = "ВЫБРАТЬ
	         |	ЗадачиПроектов.ТиповаяЗадача.Ссылка КАК Ссылка
	         |ИЗ
	         |	Справочник.ЗадачиПроектов КАК ЗадачиПроектов
	         |ГДЕ
	         |	ЗадачиПроектов.ГодЗадачи = " + Формат(ГодЗадачи, "ЧГ=0") + "
	         |
	         |СГРУППИРОВАТЬ ПО
	         |	ЗадачиПроектов.ТиповаяЗадача";
	СКД_ЗначенияЗапрос(Запрос, ТиповаяЗадача, Принудительно); 
	
	км = СКД_МассивРазрешенныхКлиентМенеджеров(ГодЗадачи);
	СКД_ЗначенияМассив(км, КлиентМенеджер, Принудительно);
КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	мРеквизиты = ЭтотОбъект.ПолучитьРеквизиты();
	сзПараметры = Новый СписокЗначений();
	Для Каждого реквизит Из мРеквизиты Цикл 
		сзПараметры.Добавить(реквизит.Имя);
	КонецЦикла;
	
	Для Каждого Эл ИЗ Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		Если сзПараметры.НайтиПоЗначению(Строка(Эл.Параметр)) <> Неопределено Тогда 
			параметр = ЭтотОбъект[Строка(Эл.Параметр)];
			Если ТипЗнч(Эл.Значение) = Тип("СписокЗначений") Тогда 
				Эл.Значение.Очистить();
				Для Каждого элСписка Из параметр Цикл 
					Если элСписка.Отметка Тогда 
						Если элСписка.Свойство("Ссылка") Тогда 
							Эл.Значение.добавить(элСписка.Значение.Ссылка);
						Иначе 
							Эл.Значение.добавить(элСписка.Значение);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			Иначе 
				Эл.Значение = параметр;
			КонецЕсли;
			Эл.Использование = Истина;
		Иначе 
			Сообщить("Параметр '" + Строка(Эл.Параметр) + "' не найден.")
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	ПриОбновленииСоставаПользовательскихНастроекНаСервере("");
КонецПроцедуры

&НаКлиенте
Процедура кмдУстановитьПараметрыПоУмолчанию(Команда)
	УстановитьПараметрыПоУмолчанию(Истина);
КонецПроцедуры
