// статьи для ввбора и ручного ввода бюджета расходов
&НаСервере
Функция ДоступныеПроекты( КлиентМенеджер );
	
	// только по клиент менеджеру
	Если НЕ ЗначениеЗаполнено( КлиентМенеджер ) Тогда
		Возврат Неопределено;
	КонецЕсли;
		

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВознаграждениеПосредникаОстатки.Проект,
		|	ВознаграждениеПосредникаОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВознаграждениеПосредника.Остатки(, Проект.МенеджерПроекта = &КлиентМенеджер) КАК ВознаграждениеПосредникаОстатки
		|ГДЕ
		|	ВознаграждениеПосредникаОстатки.СуммаОстаток > 0";
		
	//
	Запрос.УстановитьПараметр("КлиентМенеджер", КлиентМенеджер);
	Результат = Запрос.Выполнить().Выгрузить();

	//
	м = Результат.ВыгрузитьКолонку("Проект");
	Возврат м;
КонецФункции

&НаКлиенте
Процедура ПроектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	мДоступныхПроектов = ДоступныеПроекты( Объект.КлиентМенеджер );
	Если мДоступныхПроектов <>  Неопределено Тогда
		ЭтаФорма.Элементы.Проект.РежимВыбораИзСписка	=	Истина;
		ЭтаФорма.Элементы.Проект.СписокВыбора.ЗагрузитьЗначения( мДоступныхПроектов );
	Иначе
		// сбрасываем проект
		Объект.Проект 			= "";
		СтандартнаяОбработка 	= Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОстатокВознаграждения( Проект, Посредник )
	Возврат УП_СметаПроекта.ПолучитьОстатокВознагражденияПоПроекту( Проект, Посредник );
КонецФункции

&НаКлиенте
Процедура УстановитьОстатокВознаграждения()
	ОстатокВознаграждения = ПолучитьОстатокВознаграждения( Объект.Проект, Объект.Посредник );
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	УстановитьОстатокВознаграждения();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОстатокВознаграждения();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьОстатокВознаграждения();
КонецПроцедуры

&НаСервереБезКонтекста
Функция мКлМен()
	Возврат МассивКлиентМенджеров()
КонецФункции

&НаКлиенте
Процедура КлиентМенеджерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// клиент менеджеры
	
	мКМ = мКлМен();
	Если мКМ = Неопределено Тогда
	ИначеЕсли мКМ.Количество()  <>   0 Тогда
		ЭтаФорма.Элементы.КлиентМенеджер.РежимВыбораИзСписка=Истина;
		ЭтаФорма.Элементы.КлиентМенеджер.СписокВыбора.ЗагрузитьЗначения( мКМ );
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПосредникПриИзменении(Элемент)
	УстановитьОстатокВознаграждения();
КонецПроцедуры

