&НаСервереБезКонтекста
Функция  КонтрагентТИражногоПроекта( ТиражныйПроект) ;
	Возврат ТиражныйПроект.Контрагент;
КонецФункции

&НаСервереБезКонтекста
Функция  ПланРаботТиражногоПроекта( ТиражныйПроект )
	Возврат ТиражныйПроект.ПланРабот;
КонецФункции

&НаКлиенте
Процедура ЛимитыДоговорКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Объект.Проект.Пустая() Тогда
		ПоказатьПредупреждение(,"Укажите тиражный проект!", 10);
		Возврат;
	КонецЕсли;
	
		
	Договор = ЭтаФорма.Элементы.Лимиты.ТекущиеДанные.Договор;
	Если ТипЗнч( Договор ) = Тип( "ДокументСсылка.Договор" ) Тогда
		// Вставить содержимое обработчика.
		СтандартнаяОбработка = Ложь;
		//
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора", 	Истина);
		ПараметрыФормы.Вставить("Контрагент",	КонтрагентТИражногоПроекта( Объект.Проект));
		
		ОткрытьФорму("Документ.Договор.Форма.ФормаВыбораПоКонтрагенту", ПараметрыФормы, Элемент );
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ТиражныйПроектПриИзменении(Элемент)
	Объект.ПланРабот = ПланРаботТиражногоПроекта( Объект.Проект );
	// Вставить содержимое обработчика.
КонецПроцедуры
