&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСписка(Список, ПараметрыОтбора)
	
	// подразделение
	Проект = ПараметрыОтбора.Получить("Проект");
	Если Проект <> Неопределено Тогда 
		Если Не ЗначениеЗаполнено(Проект) Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
				"Проект");
		Иначе
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора( Список.Отбор,
				"Проект",
				Проект,
				ВидСравненияКомпоновкиДанных.ВИерархии,,Истина);
		КонецЕсли;
	КонецЕсли;
	
	// тип проекта
	ТипПроекта = ПараметрыОтбора.Получить("ТипПроекта");
	Если ТипПроекта <> Неопределено Тогда 
		Если Не ЗначениеЗаполнено(ТипПроекта) Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
				"ТипПроекта");
		Иначе
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора( Список.Отбор,
				"ТипПроекта",
				ТипПроекта,
				ВидСравненияКомпоновкиДанных.Равно,,Истина);
		КонецЕсли;
	КонецЕсли;
	
	// тип проекта
	ГодПроекта = ПараметрыОтбора.Получить("ГодПроекта");
	Если ГодПроекта <> Неопределено Тогда 
		Если Не ЗначениеЗаполнено(ГодПроекта) Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,
				"ГодПроекта");
		Иначе
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора( Список.Отбор,
				"ГодПроекта",
				ГодПроекта,
				ВидСравненияКомпоновкиДанных.Равно,,Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПодразделениеПроектовПриИзменении(Элемент)
	ПараметрыОтбора = Новый Соответствие();
	Параметрыотбора.Вставить("Проект", Проект );
	
	УстановитьОтборСписка(Список, ПараметрыОтбора);
КонецПроцедуры

&НаКлиенте
Процедура ГодПроектовПриИзменении(Элемент)
	ПараметрыОтбора = Новый Соответствие();
	Параметрыотбора.Вставить("ГодПроекта", ГодПроектов);
	
	УстановитьОтборСписка(Список, ПараметрыОтбора);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры
