&НаСервере
Процедура ПечатьЗаявкиНаВыплату(ТабДок, ДокСсылка)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Метаданные.ОбщиеМакеты.Найти("ЗаявкаНаВыплату");
	Если Макет <> Неопределено Тогда
		Макет = ПолучитьОбщийМакет(Макет);
	Иначе	
		Сообщить("Нет общего макета заявки на выплату!");
		Возврат;
	КонецЕсли;
	//
	ТабДок.Очистить();
	Рубль = Справочники.Валюты.НайтиПоКоду("643");
	Если ТипЗнч( ДокСсылка ) = Тип("ДокументСсылка.ЗаявкаНаВыплатуКоммРасходов") Тогда
		// ??? вопросы, что вместо Суммы
		СуммаД	= ДокСсылка.РаспределениеПоДокументам.Итог("СуммаКРпоОплате");
	Иначе
		СуммаД	= ДокСсылка.СуммаДокумента;
	КонецЕсли;
	// 
	СуммаДокумента		= Формат( СуммаД, "ЧЦ=15; ЧДЦ=2");
	СуммаПрописью 		= РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаД, Рубль);
	
	//
	Если 		ТипЗнч( ДокСсылка ) = Тип("ДокументСсылка.ЗаявкаНаВыплату") Тогда
		Шапка = Макет.ПолучитьОбласть("ШапкаВознаграждение");
		Проект							= ДокСсылка.Проект;
		Шапка.Параметры.Проект 			= Проект;
		Шапка.Параметры.Посредник		= ДокСсылка.Посредник;
		
		Шапка.Параметры.ТекстЗаявки	  	= "Сумма в размере " + СуммаДокумента + " ("+ СуммаПрописью + ") получена ____________";
		Шапка.Параметры.КлиентМенеджер 	= ДокСсылка.КлиентМенеджер;
		// 
		ТипСуммы = Перечисления.ТипСуммыБюджета.План;
		СуммаПлан						= УП_СметаПроекта.ПолучитьОборотБюджетаПоСтатье( Справочники.СтатьиСметы.ВознагрПосредника, Проект,, ТипСуммы );
		СуммаНеВыплачено				= УП_СметаПроекта.ПолучитьОстатокВознагражденияПоПроекту( Проект );
		
		
	ИначеЕсли	ТипЗнч( ДокСсылка ) = Тип("ДокументСсылка.ЗаявкаНаВыплатуРасхода") Тогда
		Шапка = Макет.ПолучитьОбласть("ШапкаППР");
		Шапка.Параметры.Проект 			= ДокСсылка.РасходПоЗадаче.ЗадачаПроекта.Владелец;
		Шапка.Параметры.ЗадачаПроекта	= ДокСсылка.РасходПоЗадаче.ЗадачаПроекта;
		Шапка.Параметры.КлиентМенеджер 	= ДокСсылка.РасходПоЗадаче.ЗадачаПроекта.Владелец.МенеджерПроекта;
		Шапка.Параметры.Статья 			= ДокСсылка.СтатьяРасходов;
		//							  
		Шапка.Параметры.ТекстЗаявки	= "Прошу выплатить " + ?(ДокСсылка.РКО, "наличными ", "безналичными ") + 
									   СуммаДокумента + " в размере ("+ СуммаПрописью + ")";
		
		СуммаПлан						= Документы.ЗаявкаНаВыплатуРасхода.ПолучитьПланПоСтатьеРасхода(	ДокСсылка );
		СуммаНеВыплачено				= Документы.ЗаявкаНаВыплатуРасхода.ПолучитьОстатокПоСтатьеРасхода( ДокСсылка, ДокСсылка.СтатьяРасходов, ДокСсылка.РКО );
		
	ИначеЕсли	ТипЗнч( ДокСсылка ) = Тип("ДокументСсылка.ЗаявкаНаОплатуПоставщику") Тогда
		Шапка = Макет.ПолучитьОбласть("ШапкаППЛО");
		Шапка.Параметры.Проект 			= ДокСсылка.ЗакупкаППЛО.ЗадачаПроекта.Владелец;
		Шапка.Параметры.ЗадачаПроекта	= ДокСсылка.ЗакупкаППЛО.ЗадачаПроекта;
		//							  
		Шапка.Параметры.ТекстЗаявки	= "Прошу оплатить поставщику по проекту __________ сумму в размере " + СуммаДокумента + " ("+ СуммаПрописью + ")";
		
		СуммаПлан						= Документы.ЗаявкаНаОплатуПоставщику.ПолучитьПланПоЗакупкеППЛО( ДокСсылка );;
		СуммаНеВыплачено				= Документы.ЗаявкаНаОплатуПоставщику.ПолучитьОстатокПоЗакупкеППЛО( ДокСсылка );
		
		
	ИначеЕсли	ТипЗнч( ДокСсылка ) = Тип("ДокументСсылка.ЗаявкаНаВыплатуКоммРасходов") Тогда
		Шапка = Макет.ПолучитьОбласть("ШапкаКоммРасх");
		//							  
		Шапка.Параметры.ТекстЗаявки		= "Прошу выплатить  " + СуммаДокумента + " ("+ СуммаПрописью + ")";
		Шапка.Параметры.КлиентМенеджер	= ДокСсылка.КлиентМенеджер;
		
		// непонятно что является планом
		СуммаПлан						= Документы.ЗаявкаНаВыплатуКоммРасходов.ПолучитьПланКРпоЗаявкеНаРасход( ДокСсылка );
		СуммаНеВыплачено				= ПолучитьОстатокКоммерческихРасходовПоМенеджеру( ДокСсылка.КлиентМенеджер );
		
	КонецЕсли;		
	// 
	Шапка.Параметры.Заполнить(ДокСсылка);
	Шапка.Параметры.Дата = Формат( ДокСсылка.Дата, "ДЛФ=D");
	//
	Шапка.Параметры.СуммаПлан			= СуммаПлан;
	Шапка.Параметры.СуммаНеВыплачено	= СуммаНеВыплачено;
	Шапка.Параметры.СуммаДокумента 		= СуммаДокумента;
	
	
	ТабДок.Вывести(Шапка);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьЗаявкиНаВыплату(ТабДок, ПараметрКоманды);
	//
	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Защита 				= Ложь;
	ТабДок.ТолькоПросмотр 		= Ложь;
	ТабДок.ОтображатьЗаголовки 	= Ложь;
	ТабДок.Показать();
КонецПроцедуры
