
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ИсполнительДокумента = ПараметрыСеанса.ТекущийПользователь;
	МесяцНачисления		 = ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), -1);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	ТипСуммы = Перечисления.ТипСуммыБюджета.Факт;
	
	
	Движения.БюджетПоМесяцам.Записывать = Истина;
	Для Каждого ТекСтрокаРаспределение Из Распределение Цикл
		Движение = Движения.БюджетПоМесяцам.Добавить();
		Движение.Период 		= Дата;
		Движение.ЗадачаПроекта 	= ТекСтрокаРаспределение.ЗадачаПроекта;
		Движение.СтатьяСметы 	= Статья;
		Движение.ТипСуммы 		= ТипСуммы;
		Движение.Месяц			= НачалоМесяца(МесяцНачисления);
		Движение.Сумма 			= ТекСтрокаРаспределение.СуммаРКО;
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
	И НЕ ВсеЗадачиВУказанномСтатусе( Перечисления.СтатусыПроектов.ВРаботе, 
										Ссылка.Распределение.Выгрузить(, "ЗадачаПроекта") ) Тогда
		Сообщить("Не все проекты в статусе " + Перечисления.СтатусыПроектов.ВРаботе );
		Отказ = Истина;
		Возврат;
	КонецЕсли;

КонецПроцедуры
