&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПараметрыПоУмолчанию();                                   
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыПоУмолчанию(Принудительно = Ложь)
	ГодЗадачи = Год(ТекущаяДата());
	СКД_ЗначенияСправочника("Справочник.Организации", Организация, Принудительно, Справочники.Организации.ПустаяСсылка());     
	СКД_ЗначенияСправочника("Справочник.СтатусыСотрудников", СтатусСотрудника, Принудительно);     
	
	Запрос = "ВЫБРАТЬ
	         |	СотрудникиСрезПоследних.Подразделение.Ссылка КАК Ссылка
	         |ИЗ
	         |	РегистрСведений.Сотрудники.СрезПоследних КАК СотрудникиСрезПоследних
	         |
	         |СГРУППИРОВАТЬ ПО
	         |	СотрудникиСрезПоследних.Подразделение.Ссылка
	         |
	         |УПОРЯДОЧИТЬ ПО
	         |	СотрудникиСрезПоследних.Подразделение.Наименование";
	СКД_ЗначенияЗапрос(Запрос, Подразделение, Принудительно);     
	
	Запрос = "ВЫБРАТЬ
	         |	СотрудникиСрезПоследних.ТарифнаяСтавка.Ссылка КАК Ссылка
	         |ИЗ
	         |	РегистрСведений.Сотрудники.СрезПоследних КАК СотрудникиСрезПоследних
	         |
	         |СГРУППИРОВАТЬ ПО
	         |	СотрудникиСрезПоследних.ТарифнаяСтавка.Ссылка
	         |
	         |УПОРЯДОЧИТЬ ПО
	         |	СотрудникиСрезПоследних.ТарифнаяСтавка.Наименование";
	СКД_ЗначенияЗапрос(Запрос, ТарифнаяСтавка, Принудительно);     
КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	мРеквизиты = ЭтотОбъект.ПолучитьРеквизиты();
	сзПараметры = Новый СписокЗначений();
	Для Каждого реквизит Из мРеквизиты Цикл 
		сзПараметры.Добавить(реквизит.Имя);
	КонецЦикла;
	
	Для Каждого Эл ИЗ Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		Если сзПараметры.НайтиПоЗначению(Строка(Эл.Параметр)) <> Неопределено Тогда 
			параметр = ЭтотОбъект[Строка(Эл.Параметр)];
			Если ТипЗнч(Эл.Значение) = Тип("СписокЗначений") Тогда 
				Эл.Значение.Очистить();
				Для Каждого элСписка Из параметр Цикл 
					Если элСписка.Отметка Тогда 
						Если элСписка.Свойство("Ссылка") Тогда 
							Эл.Значение.добавить(элСписка.Значение.Ссылка);
						Иначе 
							Эл.Значение.добавить(элСписка.Значение);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			Иначе 
				Эл.Значение = параметр;
			КонецЕсли;
			Эл.Использование = Истина;
		Иначе 
			Сообщить("Параметр '" + Строка(Эл.Параметр) + "' не найден.")
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	ПриОбновленииСоставаПользовательскихНастроекНаСервере("");
КонецПроцедуры

&НаКлиенте
Процедура кмдУстановитьПараметрыПоУмолчанию(Команда)
	УстановитьПараметрыПоУмолчанию(Истина);
КонецПроцедуры
