
Процедура РасчетСметы(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(РасчетСметы)
	Макет = Справочники.РасчетыСтатейСметы.ПолучитьМакет("РасчетСметы");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасчетыСтатейСметы.Наименование,
	|	РасчетыСтатейСметы.РасчетСметы.(
	|		НомерСтроки,
	|		КодСтатьи,
	|		ИмяСтатьи,
	|		Статья,
	|		ЗнПараметраРучнойВвод,
	|		ЗнПараметраФормула,
	|		СуммаРучнойВвод,
	|		СуммаФормула,
	|		ЗаполняетсяДокументами
	|	)
	|ИЗ
	|	Справочник.РасчетыСтатейСметы КАК РасчетыСтатейСметы
	|ГДЕ
	|	РасчетыСтатейСметы.Ссылка В(&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок 		= Макет.ПолучитьОбласть("Заголовок");
	Шапка 					= Макет.ПолучитьОбласть("Шапка");
	ОбластьРасчетСметыШапка = Макет.ПолучитьОбласть("РасчетСметыШапка");
	ОбластьРасчетСметы 		= Макет.ПолучитьОбласть("РасчетСметы");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьРасчетСметыШапка);
		ВыборкаРасчетСметы = Выборка.РасчетСметы.Выбрать();
		Пока ВыборкаРасчетСметы.Следующий() Цикл
			ОбластьРасчетСметы.Параметры.Заполнить(ВыборкаРасчетСметы);
			ТабДок.Вывести(ОбластьРасчетСметы, ВыборкаРасчетСметы.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
