
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ИзменитьТХ(ПараметрКоманды);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьТХ(Контрагент )
	МнемоКод = ПрочитатьТХ( Контрагент );
	ОписаниеОпов = Новый ОписаниеОповещения("ПослеВводаТХ", ЭтотОбъект, Контрагент);
	ПоказатьВводСтроки(ОписаниеОпов, МнемоКод, "Техническая характеристика " + Контрагент, РазмерТХ(), Истина);
КонецПроцедуры

&НаСервере
Функция  РазмерТХ()
	Размер  = Метаданные.Справочники.Контрагенты.Реквизиты.ТехническаяХарактеристка.Тип.КвалификаторыСтроки.Длина;
	Возврат Размер;
	
КонецФункции
	
&НаСервере
Функция  ПрочитатьТХ( Контрагент )
	Возврат Контрагент.ТехническаяХарактеристка;
КонецФункции

&НаКлиенте
Процедура ПослеВводаТХ( Строка, Параметры) Экспорт
	Если Строка <> Неопределено Тогда
		ЗаписатьТХ( Строка, Параметры );
		ОповеститьОбИзменении( Тип("РегистрСведенийКлючЗаписи.КонтрагентыПосещений" ));
		Оповестить("Изменение_Контрагента");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьТХ( ТехническаяХарактеристка, КонтрагентСсылка )
	Если КонтрагентСсылка.ЭтоГруппа Тогда 
		Возврат;
	КонецЕсли;
	СпрОб = КонтрагентСсылка.ПолучитьОбъект();
	СпрОб.ТехническаяХарактеристка = ТехническаяХарактеристка;
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		СпрОб.Записать();
		
		
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры
