Процедура ПроверкаСтатусовЗадач(Проверка, ПараметрыПроверки) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачиПроектов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЗадачиПроектов КАК ЗадачиПроектов
		|ГДЕ
		|	ЗадачиПроектов.ГодЗадачи >= &ГодЗадачи";
	
	Запрос.УстановитьПараметр("ГодЗадачи", Год(ТекущаяДата())); 
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Протокол = Новый ТаблицаЗначений();
	Протокол.Колонки.Добавить("Результат");
	Протокол.Колонки.Добавить("Сообщение");
	Протокол.Колонки.Добавить("Задача");
	
	Пока РезультатЗапроса.Следующий() Цикл
		Объект = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		Объект.ПроверкаСтатусаЗадач(Протокол);
	КонецЦикла;
	
	Для Каждого строка Из Протокол Цикл 
        Проблема = КонтрольВеденияУчета.ОписаниеПроблемы(строка.Задача, ПараметрыПроверки);
        //Проблема.Ответственный = строка.Задача.Владелец.МенеджерПроекта;
        Проблема.УточнениеПроблемы = НСтр("ru = '" + строка.Сообщение + "'");
        КонтрольВеденияУчета.ЗаписатьПроблему(Проблема, ПараметрыПроверки);	
		
		УстановитьПривилегированныйРежим(Истина);
		
		ЗадачаОбъект = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
		ЗадачаОбъект.Дата = ТекущаяДатаСеанса();
		ЗадачаОбъект.Автор = Пользователи.ТекущийПользователь();
		//ЗадачаОбъект.РольИсполнителя = Роль;
		ЗадачаОбъект.ОсновнойОбъектАдресации = строка.Задача.Владелец;
		ЗадачаОбъект.ДополнительныйОбъектАдресации = строка.Задача;
		ЗадачаОбъект.Описание = НСтр("ru = 'Задача сгенерирована автоматически.'");
		ЗадачаОбъект.Наименование = "Корректировка задачи";
		ЗадачаОбъект.СрокИсполнения = ТекущаяДата();
		ЗадачаОбъект.Записать();
		
		//Задача = Строка(ЗадачаОбъект);
		//ЗадачаСсылка = ЗадачаОбъект.Ссылка;
	КонецЦикла;
КонецПроцедуры
