&НаСервереБезКонтекста
Функция  ПересчетСуммыЗакупки( ЗакупкаППЛО )
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЗаявкаНаОплатуПоставщику.СуммаДокумента) КАК Сумма
		|ИЗ
		|	Документ.ЗаявкаНаОплатуПоставщику КАК ЗаявкаНаОплатуПоставщику
		|ГДЕ
		|	ЗаявкаНаОплатуПоставщику.Проведен
		|	И ЗаявкаНаОплатуПоставщику.ЗакупкаППЛО = &ЗакупкаППЛО";

	Запрос.УстановитьПараметр("ЗакупкаППЛО", ЗакупкаППЛО);

	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	Возврат Результат.Итог("Сумма");
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗакупкаППЛО = ЭтаФорма.Параметры.Отбор["ЗакупкаППЛО"];
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СуммаЗакупки = ПересчетСуммыЗакупки( ЗакупкаППЛО );
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	СуммаЗакупки = ПересчетСуммыЗакупки( ЗакупкаППЛО );
КонецПроцедуры
