
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ИсполнительДокумента 	= ПараметрыСеанса.ТекущийПользователь;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Лицензия") Тогда
		// Заполнение шапки
		Контрагент 		= ДанныеЗаполнения.Контрагент;
		Организация 	= ДанныеЗаполнения.Организация;
		Лицензия 		= ДанныеЗаполнения.Ссылка;
		//
		ВидНоменклатуры	= ДанныеЗаполнения.ВидНоменклатуры;
		//
		ПроцентЛО		= 30;
		СуммаАбонемента = ДанныеЗаполнения.Состав.Итог("Сумма") * ПроцентЛО / 100;
		СуммаОплачено	= СуммаАбонемента;
		//
		СкидкаВендора	= 45;
		СуммаВендора    = СуммаАбонемента * СкидкаВендора / 100;
		
	КонецЕсли;
КонецПроцедуры
