&НаКлиенте
Функция КлиентПодключитьсяКБазеОЛЕ_Парам( ПараметрыБазы ) Экспорт
	Перем БазаОЛЕ;
	//	
	ConnectorV8 	= Новый COMОбъект("V83.COMConnector");
	
	Если ПараметрыБазы["НаСервере"] = Ложь Тогда
		БазаОЛЕ 	= ConnectorV8.Connect("File=" + 
					  	СокрЛП( ПараметрыБазы["Расположение"] )+
						"; Usr=" + 
						СокрЛП(ПараметрыБазы["Пользователь"]) + 
						"; Pwd=" +
						СокрЛП(ПараметрыБазы["Пароль"]) + ";");	
	Иначе
		НазваниеБазыНаСервере = ""; 					
		БазаОЛЕ 	= ConnectorV8.Connect("Srvr=" + 
					  	СокрЛП(ПараметрыБазы["ИмяСервера"])+    
						"; Ref=" + 
						СокрЛП( ПараметрыБазы["Расположение"] )+
						"; Usr=" + 
						СокрЛП(ПараметрыБазы["Пользователь"]) + 
						"; Pwd=" +
						СокрЛП(ПараметрыБазы["Пароль"]) + 
						";");	
	КонецЕсли;
	Возврат	БазаОЛЕ;
	
КонецФункции


&НаКлиенте
Функция КлиентПодключитьсяКБазеОЛЕ_ПоИмени( ИмяБазы ) Экспорт
	ПараметрыБазыОЛЕ = Новый Структура;
	
	Если 		ИмяБазы = "Договоры8" Тогда 
		ПараметрыБазыОЛЕ.Вставить( "НаСервере", 	Истина );
		ПараметрыБазыОЛЕ.Вставить( "ИмяСервера", 	"srv1csql" );
		ПараметрыБазыОЛЕ.Вставить( "Расположение", 	"up8" );
		ПараметрыБазыОЛЕ.Вставить( "Пользователь", 	"Администратор" );
		ПараметрыБазыОЛЕ.Вставить( "Пароль", 		"28041995" );
		
	ИначеЕсли 	ИмяБазы = "ЗиУП" Тогда 
		ПараметрыБазыОЛЕ.Вставить( "НаСервере", 	Истина );
		ПараметрыБазыОЛЕ.Вставить( "ИмяСервера", 	"srv1csql" );
		ПараметрыБазыОЛЕ.Вставить( "Расположение", 	"zup" );
		ПараметрыБазыОЛЕ.Вставить( "Пользователь", 	"Администратор" );
		ПараметрыБазыОЛЕ.Вставить( "Пароль", 		"90545" );
		
	ИначеЕсли 	ИмяБазы = "УправлениеТорговлей" Тогда		
		ПараметрыБазыОЛЕ.Вставить( "НаСервере", 	Истина );
		ПараметрыБазыОЛЕ.Вставить( "ИмяСервера", 	"srv1csql" );
		ПараметрыБазыОЛЕ.Вставить( "Расположение", 	"UT11" );
		ПараметрыБазыОЛЕ.Вставить( "Пользователь", 	"Администратор" );
		ПараметрыБазыОЛЕ.Вставить( "Пароль", 		"71117" );
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	Возврат КлиентПодключитьсяКБазеОЛЕ_Парам( ПараметрыБазыОЛЕ );
	
КонецФункции

Функция ФильтрФайловИзображений() Экспорт
	Возврат НСтр("ru = 'Все картинки (*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf)|*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf"
		                            + "|Все файлы(*.*)|*.*"
		                            + "|Формат bmp(*.bmp*;*.dib;*.rle)|*.bmp;*.dib;*.rle"
		                            + "|Формат GIF(*.gif*)|*.gif"
		                            + "|Формат JPEG(*.jpeg;*.jpg)|*.jpeg;*.jpg"
		                            + "|Формат PNG(*.png*)|*.png"
		                            + "|Формат TIFF(*.tif)|*.tif"
		                            + "|Формат icon(*.ico)|*.ico"
		                            + "|Формат метафайл(*.wmf;*.emf)|*.wmf;*.emf'");
КонецФункции
