
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("СформироватьПриОткрытии",  Истина );
	ПараметрыФормы.Вставить("ЗадачаПроекта",  ПараметрКоманды);
	
	ОткрытьФорму("Отчет.БДРпоТипамДохода.Форма", 
					ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, 
					Новый УникальныйИдентификатор, 
					ПараметрыВыполненияКоманды.Окно, 
					ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	
КонецПроцедуры
