
//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	ТекущийКлиентМенеджер = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
//	мПользователей = СКД_ДоступныеФЛ( ТекущийКлиентМенеджер );
//	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора( Список.Отбор,
//		"МенеджерПроекта",
//		мПользователей,
//		ВидСравненияКомпоновкиДанных.ВСписке,,Истина);

//КонецПроцедуры

// с учетом директора проекта
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущийКлиентМенеджер = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
	Если НЕ СКД_ВсеМенеджеры()Тогда
		ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора( Список.Отбор.Элементы,
		"Менеджеры проектов", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли );
		
		//
		мПользователей = СКД_ДоступныеФЛ( ТекущийКлиентМенеджер );
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаОтбора, "МенеджерПроекта", ВидСравненияКомпоновкиДанных.ВСписке, мПользователей);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаОтбора, "ДиректорПроекта", ВидСравненияКомпоновкиДанных.ВСписке, мПользователей);
			
	КонецЕсли;			
КонецПроцедуры

