
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЗадачаПроекта", ПараметрКоманды);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина );
	ОткрытьФорму("Отчет.ПлановыеЗадачи.Форма.ФормаОтчета", ПараметрыФормы, 
			ПараметрыВыполненияКоманды.Источник, 
			ПараметрыВыполненияКоманды.Уникальность, 
			ПараметрыВыполненияКоманды.Окно, 
			ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
