
Процедура ОбработкаПроведения(Отказ, Режим)
	Отказ = Истина;
	
	// регистр Сотрудники
	Движения.Сотрудники.Записывать = Истина;
	Для Каждого ТекСтрокаСотрудник Из Сотрудник Цикл
		Если ТекСтрокаСотрудник.Активна Тогда
			Отказ = Ложь;
			
			Движение = Движения.Сотрудники.Добавить();
			// дата увольнения - пследний день работы
			// статус не работает - следующий день 
			Движение.Период 			= ДатаУвольнения + 24 * 60 * 60; 
			Движение.Подразделение 		= ТекСтрокаСотрудник.Подразделение;
			Движение.Должность 			= ТекСтрокаСотрудник.Должность;
			Движение.ТарифнаяСтавка 	= ТекСтрокаСотрудник.ТарифнаяСтавка;
			Движение.ФизическоеЛицо 	= ФизическоеЛицо;
			//
			Движение.СтатусСотрудника 	= Справочники.СтатусыСотрудников.Уволен;
			Движение.Количество 		= ТекСтрокаСотрудник.Количество;
			//
			Движение.Основание 			= Основание;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ИсполнительДокумента 	= ПараметрыСеанса.ТекущийПользователь;

КонецПроцедуры
