&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущаяВерсия = Константы.ТелеграмТекущаяВерсия.Получить();
	ПоследняяВерсия = "1.02";
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
	
	НомераВерсий = Новый Массив;
	ОбновитьСервер(НомераВерсий);
	Для Каждого НомерВерсии Из НомераВерсий Цикл
		ТекстОбновления = ПолучитьОписаниеОбновления(НомерВерсии);
		ТД = Новый ТекстовыйДокумент;
		ТД.ДобавитьСтроку(ТекстОбновления);
		ТД.Показать("Конструктор ботов Telegram на 1С, описание обновления " + НомерВерсии);
	КонецЦикла;
	УстановитьВидимостьДоступность();
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьОписаниеОбновления(НомерВерсии)
	
	Возврат Обработки.ТелеграмОбновлениеВерсии.ПолучитьОписаниеОбновления(НомерВерсии);
	
КонецФункции


&НаСервере
Процедура ОбновитьСервер(НомераВерсий)
	
	Если РольДоступна("ТелеграмАдминистратор") = ЛОЖЬ Тогда
		Сообщить("Для запуска обновления необходимо обладать правами администратора");
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущаяВерсия = Константы.ТелеграмТекущаяВерсия.Получить();
	Если ТекущаяВерсия = "" Тогда
		Обработки.ТелеграмОбновлениеВерсии.ПерейтиНаВерсию1_00();
	КонецЕсли;
	
	ТекущаяВерсия = Константы.ТелеграмТекущаяВерсия.Получить();
	Если ТекущаяВерсия = "1.00" Тогда
		Обработки.ТелеграмОбновлениеВерсии.ПерейтиНаВерсию1_01();
	КонецЕсли;
	
	ТекущаяВерсия = Константы.ТелеграмТекущаяВерсия.Получить();
	Если ТекущаяВерсия = "1.01" Тогда
		Обработки.ТелеграмОбновлениеВерсии.ПерейтиНаВерсию1_02();
		НомераВерсий.Добавить("1_02");
	КонецЕсли;
	
	ТекущаяВерсия = Константы.ТелеграмТекущаяВерсия.Получить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	Элементы.Обновить.Доступность = ТекущаяВерсия <> ПоследняяВерсия;
	
КонецПроцедуры