
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ИсполнительДокумента 	= ПараметрыСеанса.ТекущийПользователь;
	СтатьяБазыРаспределения = Справочники.СтатьиСметы.ДоходОтРеализации;
	ГодПроектов				= Год( ТекущаяДата());
	ПериодРегистрацииНачало 	= НачалоМесяца( ТекущаяДата());
	ПериодРегистрацииОкончание 	= ПериодРегистрацииНачало;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр БюджетПоМесяцам 
	Движения.БюджетПоМесяцам.Записывать = Истина;
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Если ТекСтрокаНачисления.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.БюджетПоМесяцам.Добавить();
		Движение.Период 		= Дата;
		Движение.ЗадачаПроекта 	= ТекСтрокаНачисления.ЗадачаПроекта;
		Движение.СтатьяСметы 	= СтатьяФонда;
		Движение.ТипСуммы		= Перечисления.ТипСуммыБюджета.Факт;
		Движение.Месяц 			= ТекСтрокаНачисления.ПериодРегистрации;
		Движение.Сумма 			= ТекСтрокаНачисления.Сумма;
		Движение.РКО			= Истина;
	КонецЦикла;

КонецПроцедуры
