
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ИсполнительДокумента 	= ПараметрыСеанса.ТекущийПользователь;
	СтатьяБазыРаспределения = Справочники.СтатьиСметы.ДоходОтРеализации;
	ГодПроектов				= Год( ТекущаяДата());
	ПериодРегистрацииНачало 	= НачалоМесяца( ТекущаяДата());
	ПериодРегистрацииОкончание 	= ПериодРегистрацииНачало;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр БюджетПоМесяцам 
	Движения.БюджетПоМесяцам.Записывать = Истина;
	Для Каждого ТекСтрокаРаспределение Из Начисления Цикл
		Если ТекСтрокаРаспределение.Сумма = 0 Тогда Продолжить; КонецЕсли;
		
		сСметы =  Новый Соответствие;
		сСтатей = Новый Соответствие;
		пСтатей = Новый Соответствие;            
		oСтатей = Новый Соответствие;
		УП_СметаПроекта.ПодготовкаФактБюджета(сСметы, сСтатей, пСтатей, oСтатей, ТекСтрокаРаспределение.ЗадачаПроекта);	
		
		статья = СтатьяФонда.ИмяПредопределенныхДанных;
		сСтатей[статья] = ТекСтрокаРаспределение.Сумма; 
		
		УП_СметаПроекта.ПроведениеФактБюджета(сСметы, сСтатей, oСтатей, Движения, ТекСтрокаРаспределение.ЗадачаПроекта,
			ТекСтрокаРаспределение.ПериодРегистрации, Дата);
	КонецЦикла;
КонецПроцедуры
