
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Добавлено по задаче #133697 от 18.10.2018 ГумединАГ	
	ПараметрыФормы = Новый Структура("Проект", ПараметрКоманды);
	//ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Проект", ПараметрКоманды));
	////////////////////////////////////////////////////
	ОткрытьФорму("Документ.Договор.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, 
				ПараметрыВыполненияКоманды.Уникальность, 
				ПараметрыВыполненияКоманды.Окно, 
				ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
