
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ОстаткиЛимитаТП Приход
	Движения.ОстаткиТирАиП.Записывать = Истина;
	Для Каждого ТекСтрокаЛимиты Из Лимиты Цикл
		Движение 					= Движения.ОстаткиТирАиП.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;
		Движение.Период 			= Дата;
		Движение.Источник 			= Проект;
		Движение.ПланРабот 			= ПланРабот;
		Движение.Сумма 				= ТекСтрокаЛимиты.Сумма;
		Движение.Договор 			= ТекСтрокаЛимиты.Договор;
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = Лимиты.Итог("Сумма");
КонецПроцедуры
