
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ОценкиСотрудников 
	Движения.ОценкиСотрудников.Записывать = Истина;
	Для Каждого ТекСтрокаОценки Из Оценки Цикл
		Движение 				= Движения.ОценкиСотрудников.Добавить();
		Движение.Период 		= МесяцОценки;
		Движение.ФизическоеЛицо = ТекСтрокаОценки.ФизическоеЛицо;
		Движение.Оценщик 		= Оценщик;
		Движение.КритерийОценки = ТекСтрокаОценки.КритерийОценки;
		Движение.Проект 		= Проект;
		Движение.Оценка 		= ТекСтрокаОценки.Оценка;
		Движение.Комментарий 	= ТекСтрокаОценки.Комментарий;
	КонецЦикла;

КонецПроцедуры
