
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура();
	Отбор = Новый Структура;
	Отбор.Вставить("ПланРабот", ПараметрКоманды );
	ПараметрыФормы.Вставить("Отбор", Отбор );
	ПараметрыФормы.Вставить("СформироватьПриОткрытии",  Истина );
	ПараметрыФормы.Вставить("КлючВарианта",  "ПоПлануРабот");
	
	
	
	ОткрытьФорму("Отчет.ИсполнениеПланаРаботЗаМесяц.Форма", ПараметрыФормы, 
			ПараметрыВыполненияКоманды.Источник, 
			ПараметрыВыполненияКоманды.Уникальность, 
			ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
	
