Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ИсполнительДокумента 	= ПараметрыСеанса.ТекущийПользователь;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ЗадачиПроектов") Тогда
		// Заполнение шапки
		ЗадачаПроекта 	= ДанныеЗаполнения.Ссылка;
		Подразделение	= ДанныеЗаполнения.Подразделение;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//
	СтатьяФОТ				= Справочники.СтатьиСметы.ФОТ_ПП;
	Проект					= ЗадачаПроекта.Владелец;
	
	
	//****************************************************************
	// регистр Бюджет по месяцам
	ПоследнийМесяцПланаРабот = НачалоГода( Дата( ЗадачаПроекта.Владелец.ГодПроекта, 1, 1));
	
	Движения.БюджетПоМесяцам.Записывать = Истина;
	тзРасчет = Расчет.Выгрузить();
	тзРасчет.Свернуть("Месяц", "СуммаФОТ");
	Для Каждого СтрР ИЗ тзРасчет Цикл
		Если СтрР.СуммаФОТ <> 0 Тогда
			Движение = Движения.БюджетПоМесяцам.Добавить();
			Движение.Период 		= Дата;
			// измерения
			Движение.ЗадачаПроекта	= ЗадачаПроекта;
			Движение.СтатьяСметы 	= СтатьяФОТ;
			Движение.ТипСуммы 		= Перечисления.ТипСуммыБюджета.ПервичныйДокумент;  // первичка
			Движение.Месяц			= НачалоМесяца( СтрР.Месяц );
			//
			Движение.Сумма			= СтрР.СуммаФОТ;
		КонецЕсли;
	КонецЦикла;
	
	// 20160919
	Если ОстатокПоСмете <> 0 Тогда
	// записываем в бюджет по месяцам на последний месяц
		Движение = Движения.БюджетПоМесяцам.Добавить();
		Движение.Период 			= Дата;
		Движение.ЗадачаПроекта		= ЗадачаПроекта;
		Движение.СтатьяСметы		= СтатьяФОТ;
		// 28,03,2013
		Движение.ТипСуммы 			= Перечисления.ТипСуммыБюджета.ПервичныйДокумент;  // первичка
		Движение.Месяц 				= ПоследнийМесяцПланаРабот;
		Движение.Сумма				= ОстатокПоСмете;
		
	КонецЕсли;		
	
	
	// регистр ФронтРабот
	Движения.ФронтРабот.Записывать = Истина;
	тзФР = Расчет.Выгрузить();
	// 2016 09 19
	//тзФР.Свернуть("Месяц,Номенклатура", "Количество,Сумма");
	тзФР.Свернуть("Месяц,Номенклатура", "Количество,СуммаФОТ");
	Для Каждого СтрФР ИЗ тзФР Цикл
		Если СтрФР.СуммаФОТ <> 0 Тогда
			Движение = Движения.ФронтРабот.Добавить();
			Движение.Период 		= Дата;
			// измерения 
			Движение.ПланРабот		= Ссылка;
			Движение.ТарифнаяСтавка = СтрФР.Номенклатура;
			Движение.Месяц 			= НачалоМесяца( СтрФР.Месяц );
			Движение.ТипСуммы		= 0;
			// ресурсы 
			Движение.Количество		= СтрФР.Количество;
			// 2016 09 19
			//Движение.Сумма		= СтрФР.Сумма;
			Движение.Сумма			= СтрФР.СуммаФОТ;
		КонецЕсли;
	КонецЦикла;
	
	// Объемы работ в количестве консультаций
	тзРасчет = Ссылка.Расчет.Выгрузить();
	тзРасчет.Свернуть("Месяц,Номенклатура,Цена,ЦенаФОТ", "Количество");
	Движения.ПланТиражныхРабот.Записывать = Истина;
	Для Каждого СтрТЗ ИЗ тзРасчет Цикл
		Движение = Движения.ПланТиражныхРабот.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;
		Движение.Период 			= Дата;
		// измерения
		Движение.ПланРаботТиражный	= Ссылка;
		Движение.Номенклатура 		= СтрТЗ.Номенклатура;
		Движение.Цена 				= СтрТЗ.Цена;
		Движение.ЦенаФОТ			= СтрТЗ.ЦенаФОТ;
		// ресурс
		Движение.Количество 		= СтрТЗ.Количество;
		// реквизит
		Движение.Месяц 				= СтрТЗ.Месяц;
	КонецЦикла;
	

	// 2015 07 03
	// надо проверить, существуют ли сейчас движения прошлого перепроведения
	СметаПланаРабот 		= УП_ПланыРаботПоПроектам.СметаПланаРабот(  Ссылка );
	ЗакрытиеПоПлану			= Документы.ПланРаботТиражный.ЗакрытиеПланаРабот( Ссылка );
	
	//Если СметаПланаРабот <> Неопределено Тогда
	//	Если ОстатокПоСмете < 0 Тогда
	//		Сообщение = Новый СообщениеПользователю();
	//		Сообщение.Текст = "Остаток по смете " + ОстатокПоСмете + " меньше 0";
	//		Сообщение.Сообщить();
	//		
	//		Отказ = Истина;
	//		Возврат;			
	//	КонецЕсли;
	//	
	//	// есть смета в которую входит план работ, проверяем общую сумму
	//	ТекущаяСуммаПлан = Расчет.Итог("СуммаФОТ") + ОстатокПоСмете;
	//	Если СметаПланаРабот.СуммаПлан <>  ТекущаяСуммаПлан Тогда
	//		Сообщение = Новый СообщениеПользователю();
	//		Сообщение.Текст = "Сумма плана " + ТекущаяСуммаПлан + " не равна плану по смете " + СметаПланаРабот.СуммаПлан;
	//		Сообщение.Сообщить();
	//		
	//		Отказ = Истина;
	//		Возврат;
	//	КонецЕсли;
	//	// проверяем суммы закрытого периода
	//	СуммаЗакрыто = 0;
	//	Для Каждого СтрФР ИЗ Расчет Цикл
	//		Если СтрФР.Месяц <= ЗакрытиеПоПлану.Месяц Тогда
	//			СуммаЗакрыто = СуммаЗакрыто + СтрФР.СуммаФОТ;
	//			
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	Если ЗакрытиеПоПлану.СуммаЗакрыто <> СуммаЗакрыто Тогда
	//		Сообщение = Новый СообщениеПользователю();
	//		Сообщение.Текст = "План закрыт по " + Формат( ЗакрытиеПоПлану.Месяц, "ДФ = 'ММММ гг'") + 
	//						  " на сумму " + Формат( ЗакрытиеПоПлану.СуммаЗакрыто, "ЧЦ=15; ЧДЦ=2")  + Символы.ПС +
	//						  ", попытка изменить на " + Формат( СуммаЗакрыто, "ЧЦ=15; ЧДЦ=2" );
	//		Сообщение.Сообщить();
	//		
	//		Отказ = Истина;
	//		Возврат;
	//	КонецЕсли;
	//Иначе
	//	ОстатокПоСмете = 0;
	//КонецЕсли;			
	
	//
	Движения.Записать();			
	
	// перепроводим смету задачи проекта, считаем что одна !!!
	Если СметаПланаРабот <> Неопределено Тогда
		Попытка
			СмЗадачиОб = СметаПланаРабот.СметаЗадачиПроекта.ПолучитьОбъект();
			СмЗадачиОб.Записать( РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный );
		Исключение
			Сообщить(ОписаниеОшибки());
			Отказ = Истина;
		КонецПопытки;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если УП_СметаПроекта.Есть_СметаЗадачи_СодержащаяДокумент( Ссылка ) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// перенос
	Если УП_ПереносДанных.ПроведениеПриПереносе() Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
	И НЕ РазрешеноПроводитьДокумент( Ссылка, Ссылка.ЗадачаПроекта.Владелец ) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;		

КонецПроцедуры

