&НаСервере
Функция ПолучитьБазуРаспределения_Уст()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(Оплата.Сумма) КАК БазаРаспределения,
		|	Оплата.ЗадачаПроекта,
		|	СУММА(0) КАК Сумма,
		|	Оплата.ЗадачаПроекта.Владелец.Код КАК ЗадачаПроектаВладелецКод,
		|	НАЧАЛОПЕРИОДА(Оплата.Ссылка.Дата, МЕСЯЦ) КАК МесяцОплаты
		|ИЗ
		|	Документ.Оплата.РасшифровкаПлатежа КАК Оплата
		|ГДЕ
		|	Оплата.Ссылка.Проведен
		|	И Оплата.Сумма <> 0
		|	И Оплата.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Оплата.ЗадачаПроекта.Владелец.ГодПроекта = &ГодПроекта
		|	И (&ГодЗадачи = 0
		|			ИЛИ ВЫБОР
		|				КОГДА Оплата.ЗадачаПроекта.НачалоРабот = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА Оплата.ЗадачаПроекта.Владелец.ГодПроекта
		|				ИНАЧЕ ГОД(Оплата.ЗадачаПроекта.НачалоРабот)
		|			КОНЕЦ = &ГодЗадачи)
		|
		|СГРУППИРОВАТЬ ПО
		|	Оплата.ЗадачаПроекта,
		|	Оплата.ЗадачаПроекта.Владелец.Код,
		|	НАЧАЛОПЕРИОДА(Оплата.Ссылка.Дата, МЕСЯЦ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗадачаПроектаВладелецКод,
		|	МесяцОплаты";

	
	//
	Запрос.УстановитьПараметр("ГодПроекта", 	Объект.ГодПроекта );
	Запрос.УстановитьПараметр("ГодЗадачи", 		Объект.ГодЗадачи );
	Запрос.УстановитьПараметр("НачалоПериода", 	НачалоМесяца(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", 	КонецМесяца(Объект.ОкончаниеПериода));
	тзБазаРаспр = Запрос.Выполнить().Выгрузить();
	
	Возврат тзБазаРаспр;
КонецФункции

&НаСервере
Функция ПолучитьБазуРаспределения()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(Оплата.Сумма) КАК БазаРаспределения,
		|	Оплата.ЗадачаПроекта,
		|	СУММА(0) КАК Сумма,
		|	Оплата.ЗадачаПроекта.Владелец.Код КАК ЗадачаПроектаВладелецКод,
		|	НАЧАЛОПЕРИОДА(Оплата.Ссылка.Дата, МЕСЯЦ) КАК МесяцОплаты
		|ИЗ
		|	Документ.Оплата.РасшифровкаПлатежа КАК Оплата
		|ГДЕ
		|	Оплата.Ссылка.Проведен
		|	И Оплата.Сумма <> 0
		|	И Оплата.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (&ГодПроекта = 0
		|			ИЛИ Оплата.ЗадачаПроекта.Владелец.ГодПроекта = &ГодПроекта)
		|	И (&ГодЗадачи = 0
		|			ИЛИ Оплата.ЗадачаПроекта.ГодЗадачи = &ГодЗадачи)
		|
		|СГРУППИРОВАТЬ ПО
		|	Оплата.ЗадачаПроекта,
		|	Оплата.ЗадачаПроекта.Владелец.Код,
		|	НАЧАЛОПЕРИОДА(Оплата.Ссылка.Дата, МЕСЯЦ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗадачаПроектаВладелецКод,
		|	МесяцОплаты";

	
	//
	Запрос.УстановитьПараметр("ГодПроекта", 	Объект.ГодПроекта );
	Запрос.УстановитьПараметр("ГодЗадачи", 		Объект.ГодЗадачи );
	Запрос.УстановитьПараметр("НачалоПериода", 	НачалоМесяца(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", 	КонецМесяца(Объект.ОкончаниеПериода));
	тзБазаРаспр = Запрос.Выполнить().Выгрузить();
	
	Возврат тзБазаРаспр;
КонецФункции


&НаСервере
Процедура СформироватьБазуРаспределения_НаСервере( ЗаполнятьПоБазе = Истина )
	
	
	ДокОб = РеквизитФормыВЗначение("Объект");
	Если ЗаполнятьПоБазе Тогда
		тзБазаРаспр = ПолучитьБазуРаспределения();
	Иначе
		// выгружаем из табличной части
		тзБазаРаспр = ДокОб.Распределение.Выгрузить();
	КонецЕсли;
	
	ДокОб.Распределение.Очистить();
	Если ДокОб.СуммаДокумента <> 0 Тогда 
	
		// распредляем ОХР
		мКоэфф 	= тзБазаРаспр.ВыгрузитьКолонку( "БазаРаспределения" );
		мНН		= РаспределитьПропорционально( ДокОб.СуммаДокумента, мКоэфф);
		Для Каждого Стр из тзБазаРаспр Цикл
			Стр.Сумма = мНН[ тзБазаРаспр.Индекс( Стр )];
		КонецЦикла;
		
		// Записываем в таблицу документа 
		Для Каждого Стр из тзБазаРаспр Цикл
			СтрДок = ДокОб.Распределение.Добавить();
			ЗаполнитьЗначенияСвойств( СтрДок, Стр );
		КонецЦикла;
	КонецЕсли;		
		
	ЗначениеВРеквизитФормы(ДокОб, "Объект");
	
КонецПроцедуры


&НаКлиенте
Процедура СформироватьБазуРаспределения()

	Состояние( НСтр("ru = 'Документ рассчитывается...'"),,,БиблиотекаКартинок.ДлительнаяОперация48);

	СформироватьБазуРаспределения_НаСервере();
	ЭтаФорма.Модифицированность = Истина;
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры	


&НаКлиенте
Процедура ПересчетБазыРаспределения(Команда)
	СформироватьБазуРаспределения();
	//СформироватьБазуРаспределения_НаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Период.ДатаНачала 		= НачалоМесяца(Период.ДатаНачала);
	Объект.НачалоПериода 	= НачалоМесяца(Период.ДатаНачала);
	
	Период.ДатаОкончания	= КонецМесяца( Период.ДатаОкончания);
	Объект.ОкончаниеПериода	= КонецМесяца( Период.ДатаОкончания);
	
	//
	СформироватьБазуРаспределения();
	//СформироватьБазуРаспределения_НаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Период.ДатаНачала 		= Объект.НачалоПериода;
	Период.ДатаОкончания	= Объект.ОкончаниеПериода;
КонецПроцедуры


&НаКлиенте
Процедура РаспределениеПослеУдаления(Элемент)
	СформироватьБазуРаспределения();	
	//СформироватьБазуРаспределения_НаСервере(Ложь);
	//ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГодПроектаПриИзменении(Элемент)
	СформироватьБазуРаспределения();
	//СформироватьБазуРаспределения_НаСервере();
	//ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГодЗадачиПриИзменении(Элемент)
	СформироватьБазуРаспределения();	
	//СформироватьБазуРаспределения_НаСервере();
	//ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	СформироватьБазуРаспределения();	
	//СформироватьБазуРаспределения_НаСервере();
	//ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры
