
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьЗаявкиНаВыплатуИзФонда(ТабДок, ПараметрКоманды);
	//
	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Защита 				= Ложь;
	ТабДок.ТолькоПросмотр 		= Ложь;
	ТабДок.ОтображатьЗаголовки 	= Ложь;
	ТабДок.АвтоМасштаб			= Истина;
	ТабДок.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Процедура ПечатьЗаявкиНаВыплатуИзФонда(ТабДок, ДокСсылка)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Метаданные.ОбщиеМакеты.Найти("ЗаявкаНаВыплатуИзФонда");
	Если Макет <> Неопределено Тогда
		Макет = ПолучитьОбщийМакет(Макет);
	Иначе	
		Сообщить("Нет общего макета заявки на выплату из фонда подразделения !");
		Возврат;
	КонецЕсли;
	//
	ТабДок.Очистить();
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ЗаполнитьЗначенияСвойств( ОблШапка.Параметры, ДокСсылка );
	ОблШапка.Параметры.Дата = Формат( ДокСсылка.Дата, "ДЛФ=DD");
	ТабДок.Вывести(ОблШапка);
	
	Для Каждого СтрР ИЗ ДокСсылка.Расходы Цикл
		ОблСтрока = Макет.ПолучитьОбласть("СтрокаРасходов");
		ОблСтрока.Параметры.НомерСтроки = ДокСсылка.Расходы.Индекс( СтрР )+1;
		ЗаполнитьЗначенияСвойств( ОблСтрока.Параметры, СтрР  );
		ОблСтрока.Параметры.Проект = СтрР.ЗадачаПроекта.Владелец;
		ТабДок.Вывести(ОблСтрока);
	КонецЦикла;
	
	ОблПодвал = Макет.ПолучитьОбласть("Подвал");
	ОблПодвал.Параметры.СуммаДокумента 	= ДокСсылка.СуммаДокумента;
	
	Рубль 			= Справочники.Валюты.НайтиПоКоду("643");
	СуммаПрописью 	= РаботаСКурсамиВалют.СформироватьСуммуПрописью(ДокСсылка.СуммаДокумента, Рубль);
	
	
	ОблПодвал.Параметры.ТекстЗаявки 	= "Прошу выплатить " + ?(ДокСсылка.Наличные, "наличными", "безналичными" ) + " " + СуммаПрописью;
	ОблПодвал.Параметры.Дата			= Формат( ДокСсылка.Дата, "ДЛФ=DD");
	ОблПодвал.Параметры.РуководительПодразделения	= УП_КадрыСервер.РуководительПодразделения( ДокСсылка.Подразделение, ДокСсылка.Дата ).Руководитель;
	ТабДок.Вывести(ОблПодвал);

КонецПроцедуры
