&НаСервереБезКонтекста
Функция  ПолучитьПроцентРКО( ГодПроекта   )
	// из регистра	
	РКО = ПлановыйПоказательСметы( ГодПроекта , "СтавкаРКО" );
	Возврат РКО /100;
КонецФункции

&НаКлиенте
Процедура ОписаниеПриИзменении(Элемент)
	Стр = Элементы.Описание.ТекущиеДанные;
	Если Стр.РКО Тогда
		ПроцентРКО = ПолучитьПроцентРКО( Объект.ГодПроекта );
		Стр.СуммаКонвертации	= Стр.Сумма *  ПроцентРКО;
	Иначе
		Стр.СуммаКонвертации	= 0;
	КонецЕсли;

	ИтогоПоДокументу();
КонецПроцедуры

&НаКлиенте
Процедура ИтогоПоДокументу()
	ВсегоРасход = Объект.Описание.Итог("Сумма") + Объект.Описание.Итог("СуммаКонвертации");
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено( Объект.ГодПроекта ) Тогда
		Объект.ГодПроекта = Год( ТекущаяДата());
	КонецЕсли;
	
	ИтогоПоДокументу();
КонецПроцедуры

