Функция ВернутьТаблицуАнализМощности(Период)
	
	тзМПлР	= СКД_МощностьПоПланамРабот( Период.ДатаНачала, Период.ДатаОкончания);
	// мощность подразделений
	тзМП 	= СКД_МощностьПодразделенийЗаПериод( Период.ДатаНачала, Период.ДатаОкончания);
	тзМП.Колонки.Добавить("МощностьПоПлану", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,1)));
	
	Для Каждого Стр1 ИЗ тзМПлР Цикл
		Стр2 = тзМП.Добавить();
		ЗаполнитьЗначенияСвойств( Стр2, Стр1);
	КонецЦикла;
	
	тзМП.Свернуть("Подразделение,Должность,ТарифнаяСтавка,Месяц", "Мощность,МощностьПоПлану");
	тзМП.Сортировать("Подразделение,Должность,ТарифнаяСтавка,Месяц");
	//
	тзМП.Колонки.Добавить("Отклонение", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,1)));
	тзМП.Колонки.Добавить("ОтклонениеНак", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,1)));
	П 	= "";
	Д	= "";
	ТС	= "";
	ОтклонениеНак = 0;
	
	Для Каждого Стр ИЗ тзМП Цикл
		Если (П <> Стр.Подразделение)
		ИЛИ	 (Д <> Стр.Должность)
		ИЛИ	 (ТС<> Стр.ТарифнаяСтавка ) Тогда
			ОтклонениеНак = 0;
			П 	= Стр.Подразделение;
			Д	= Стр.Должность;
			ТС  = Стр.ТарифнаяСтавка;
		КонецЕсли;
		
		//
		Отклонение			= Стр.Мощность - Стр.МощностьПоПлану;
		ОтклонениеНак		= ОтклонениеНак + Отклонение;
		Стр.Отклонение 		= Отклонение;
		Стр.ОтклонениеНак 	= ОтклонениеНак;
	КонецЦикла;
	
	Возврат тзМП;	
	
КонецФункции


Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	//
	НастройкиСКД		= КомпоновщикНастроек.ПолучитьНастройки();
	
	//Получение самой СКД из макета
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	//
	
	
	//Макет компоновки
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,НастройкиСКД, ДанныеРасшифровки );
	
	// параметры из СКД
	ПериодОтчета		= МакетКомпоновки.ЗначенияПараметров.ПериодОтчета.Значение;
	//Связь между таблицей значений и именами в СКД
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТАнализ", ВернутьТаблицуАнализМощности(ПериодОтчета));
	
	
	//Компоновка данных
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,ДанныеРасшифровки);

	//Вывод результата
	ДокументРезультат.Очистить(); 
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//ДокументРезультат.Показать();

	//ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.АвтоМасштаб=Истина;
	ДокументРезультат.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	
КонецПроцедуры
