&НаСервере
Процедура РаспределитьРасходыПоЗадачам_НаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЗаявкаНаВыплатуКоммРасходовРаспределениеПоДокументам.Сумма) КАК БазаРаспределения,
		|	ЗаявкаНаВыплатуКоммРасходовРаспределениеПоДокументам.ЗадачаПроекта,
		|	СУММА(0) КАК Сумма
		|ИЗ
		|	Документ.ЗаявкаНаВыплатуКоммРасходов.РаспределениеПоДокументам КАК ЗаявкаНаВыплатуКоммРасходовРаспределениеПоДокументам
		|ГДЕ
		|	ЗаявкаНаВыплатуКоммРасходовРаспределениеПоДокументам.Ссылка.Проведен
		|	И ЗаявкаНаВыплатуКоммРасходовРаспределениеПоДокументам.Ссылка.ПериодРегистрации = &ПериодРегистрации
		|	И ЗаявкаНаВыплатуКоммРасходовРаспределениеПоДокументам.Сумма <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаявкаНаВыплатуКоммРасходовРаспределениеПоДокументам.ЗадачаПроекта";

	
	//
	Запрос.УстановитьПараметр("ПериодРегистрации", 	НачалоМесяца(Объект.МесяцНачисления));
	тзБазаРаспр = Запрос.Выполнить().Выгрузить();
	
	ДокОб = РеквизитФормыВЗначение("Объект");
	ДокОб.Распределение.Очистить();
	Если ДокОб.РасходыНаВыплатуКР <> 0 Тогда 
	
		// распредляем ОХР
		мКоэфф 	= тзБазаРаспр.ВыгрузитьКолонку( "БазаРаспределения" );
		мКР		= РаспределитьПропорционально( ДокОб.РасходыНаВыплатуКР, мКоэфф);
		Для Каждого Стр из тзБазаРаспр Цикл
			Стр.Сумма = мКР[ тзБазаРаспр.Индекс( Стр )];
		КонецЦикла;
		
		// Записываем в таблицу документа 
		Для Каждого Стр из тзБазаРаспр Цикл
			СтрДок = ДокОб.Распределение.Добавить();
			ЗаполнитьЗначенияСвойств( СтрДок, Стр );
		КонецЦикла;
	КонецЕсли;		
		
	ЗначениеВРеквизитФормы(ДокОб, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура Распределить(Команда)
	Если НЕ ЗначениеЗаполнено( Объект.МесяцНачисления ) Тогда
		ПоказатьПредупреждение(, "Укажите месяц начисления!", 10);
		Возврат;
	КонецЕсли;
	
	РаспределитьРасходыПоЗадачам_НаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение 
	//И НЕ ВсеЗадачиВУказанномСтатусе( Перечисления.СтатусыПроектов2013.ВРаботе, 
	//									ТекущийОбъект.Распределение.Выгрузить(, "ЗадачаПроекта") ) Тогда
	//	Сообщить("Не все проекты в статусе " + Перечисления.СтатусыПроектов2013.ВРаботе );
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;

КонецПроцедуры
