
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Отказ = Истина;
	// регистр Сотрудники
	Движения.Сотрудники.Записывать = Истина;
	Для Каждого ТекСтрокаСотрудник Из Сотрудник Цикл
		Если ТекСтрокаСотрудник.Активна Тогда
		// закрываем старую 
			Отказ = Ложь;
			// 2016 11 26
			// если измерения новой записи полностью совпадают с измерениями старой записи
			// например изменили  только количество, тогда старуб запись не закрываем
			Если 	ТекСтрокаСотрудник.Подразделение 	= Подразделение
			и		ТекСтрокаСотрудник.Должность		= Должность
			и		ТекСтрокаСотрудник.ТарифнаяСтавка	= ТарифнаяСтавка Тогда
			
			
			Иначе
		
				Движение 					= Движения.Сотрудники.Добавить();
				//Движение.Период 			= ДатаПеремещения - 24*60*60; // закрываем предыдущей датой
				
				// 2016 11 25
				// последний день работы на старом месте - предыдущий до перемещения
				// т.е закрывать надо утром в день перемещения
				Движение.Период 			= ДатаПеремещения; 
				
				
				Движение.Подразделение 		= ТекСтрокаСотрудник.Подразделение;
				Движение.Должность 			= ТекСтрокаСотрудник.Должность;
				Движение.ТарифнаяСтавка 	= ТекСтрокаСотрудник.ТарифнаяСтавка;
				Движение.ФизическоеЛицо 	= ФизическоеЛицо;
				//
				Движение.СтатусСотрудника 	= Справочники.СтатусыСотрудников.Закрыта;
				Движение.Количество 		= ТекСтрокаСотрудник.Количество;
				Движение.Основание 			= Основание;
			КонецЕсли;		
		
		КонецЕсли;
	КонецЦикла;
	
	// открываем новую должность
	Движение 					= Движения.Сотрудники.Добавить();
	Движение.Период 			= ДатаПеремещения; 
	Движение.Подразделение 		= Подразделение;
	Движение.Должность 			= Должность;
	Движение.ТарифнаяСтавка 	= ТарифнаяСтавка;
	Движение.ФизическоеЛицо 	= ФизическоеЛицо;
	//
	Движение.СтатусСотрудника 	= Справочники.СтатусыСотрудников.Работает;
	Движение.Количество 		= Количество;
	Движение.Основание 			= Основание;
	

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ИсполнительДокумента 	= ПараметрыСеанса.ТекущийПользователь;

КонецПроцедуры
