
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ИсполнительДокумента 	= ПараметрыСеанса.ТекущийПользователь;
	ПериодРегистрации		= НачалоМесяца( ТекущаяДата());
	СтатьяСметы				= Справочники.СтатьиСметы.РасходыППпоПроекту;
	ФизическоеЛицо			= ИсполнительДокумента.ФизическоеЛицо;
	мПодразделения 			= УП_КадрыСервер.ГдеРаботает( ФизическоеЛицо );
	Если мПодразделения.Количество() <> 0 Тогда
		Подразделение = мПодразделения[0];
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если УП_ПереносДанных.ПроведениеПриПереносе() Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
	И	НЕ ВсеЗадачиВУказанномСтатусе( Перечисления.СтатусыПроектов.ВРаботе, 
										Ссылка.Расходы.Выгрузить(, "ЗадачаПроекта") ) Тогда
		Сообщить("Не все проекты в статусе " + Перечисления.СтатусыПроектов.ВРаботе );
		Отказ = Истина;
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.БюджетПоМесяцам.Записывать = Истина;
	Для Каждого ТекСтрокаРасходы Из Расходы Цикл
		Движение = Движения.БюджетПоМесяцам.Добавить();
		Движение.Период 		= Дата;
		Движение.ЗадачаПроекта 	= ТекСтрокаРасходы.ЗадачаПроекта;
		Движение.СтатьяСметы 	= СтатьяСметы;
		Движение.ТипСуммы		= Перечисления.ТипСуммыБюджета.Факт;
		Движение.Месяц 			= НачалоМесяца( ПериодРегистрации );
		Движение.Сумма 			= ТекСтрокаРасходы.Сумма;
		Движение.РКО 			= РКО;
	КонецЦикла;

КонецПроцедуры
