&НаСервереБезКонтекста
Функция ПолучитьОстатокПоСтатье( ЗаявкаНаВыплату, Статья, РКО )
	Возврат Документы.ЗаявкаНаВыплатуРасхода.ПолучитьОстатокПоСтатьеРасхода( ЗаявкаНаВыплату, Статья, РКО );
КонецФункции


&НаКлиенте
Процедура УстановитьОстатокПоСтатье()
	//ОстатокПоСтатье = ПолучитьОстатокПоСтатье( Объект.Ссылка, Объект.Статья, Объект.РКО );
КонецПроцедуры



&НаСервереБезКонтекста
Функция мСтатьи( РасходПоЗадаче )
	Если НЕ ЗначениеЗаполнено( РасходПоЗадаче ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	//
	мС = Новый Массив;
	Для Каждого Стр ИЗ РасходПоЗадаче.Описание Цикл
		Если мС.Найти( Стр.Статья ) = Неопределено Тогда
			мС.Добавить( Стр.Статья );
		КонецЕсли;
	КонецЦикла;
    Возврат мС;
КонецФункции


&НаКлиенте
Процедура СтатьяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//мС = мСтатьи( Объект.РасходПоЗадаче );
	//Если мС = Неопределено Тогда
	//ИначеЕсли мС.Количество()  <>   0 Тогда
	//	ЭтаФорма.Элементы.Статья.РежимВыбораИзСписка=Истина;
	//	ЭтаФорма.Элементы.Статья.СписокВыбора.ЗагрузитьЗначения( мС );
	//Иначе
	//	СтандартнаяОбработка = Ложь;
	//КонецЕсли;
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура РКОПриИзменении(Элемент)
	УстановитьОстатокПоСтатье();
КонецПроцедуры

&НаКлиенте
Процедура СтатьяПриИзменении(Элемент)
	УстановитьОстатокПоСтатье();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОстатокПоСтатье();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьОстатокПоСтатье();
КонецПроцедуры

//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	Если НЕ РазрешеноСоздаватьДокумент( Объект.Ссылка, Объект.РасходПоЗадаче.ЗадачаПроекта.Владелец ) Тогда
//		Сообщить("Документ создается только на основании проекта в статусе 'В работе !");
//		Отказ = Истина;
//		Возврат;
//	КонецЕсли;		
//	//Вставить содержимое обработчика
//КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение 
	//И НЕ РазрешеноПроводитьДокумент( ТекущийОбъект.Ссылка, ТекущийОбъект.РасходПоЗадаче.ЗадачаПроекта.Владелец  ) Тогда
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если  НЕ ЗначениеЗаполнено( Объект.ПериодРегистрации ) Тогда
		Объект.ПериодРегистрации = НачалоМесяца(Объект.Дата);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	//Изменено Гумединым А.Г. 17:41 30.03.2018 по задаче #128854
	//Объект.ПериодРегистрации = НачалоМесяца(Объект.ПериодРегистрации);
КонецПроцедуры
