Функция РодительКалькуляции( Исполнитель, Проект )
	РодительКЗ 	= СоздатьИерархию( "КалькуляторРасходаПоЗадаче", 
									СокрЛП( Исполнитель ) + "/" + 
									СокрЛП( Проект ));
									
	Возврат РодительКЗ;
КонецФункции



Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Исполнитель = ПараметрыСеанса.ТекущийПользователь;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходПоЗадачеПроекта")
	ИЛИ  ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходПоЗадачеПроизводство") Тогда
		// Заполнение шапки
		
		Наименование 	= ДанныеЗаполнения.ЗадачаПроекта.Наименование;
		Подразделение 	= ДанныеЗаполнения.ЗадачаПроекта.Подразделение;
		СтатьяСметы		= ДанныеЗаполнения.СтатьяСметы;
		Комментарий		= ДанныеЗаполнения.Комментарий;
		ГодПроекта		= ДанныеЗаполнения.ЗадачаПроекта.Владелец.ГодПроекта;
		
		Родитель		= РодительКалькуляции( Исполнитель, ДанныеЗаполнения.ЗадачаПроекта.Владелец);
		
		Для Каждого ТекСтрокаОписание Из ДанныеЗаполнения.Описание Цикл
			НоваяСтрока 			= Описание.Добавить();
			ЗаполнитьЗначенияСвойств( НоваяСтрока, ТекСтрокаОписание );
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
