
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ИсполнительДокумента = ПараметрыСеанса.ТекущийПользователь;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗакупкаППЛО") Тогда
		// Заполнение шапки
		ЗакупкаППЛО 	= ДанныеЗаполнения.Ссылка;
		СуммаДокумента	= ДанныеЗаполнения.Товар.Итог("СуммаПравоОбл")-ДанныеЗаполнения.СуммаДопОтВендора;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//Структура сметы
	Движения.БюджетПоМесяцам.Записывать = Истина;

	сСметы =  Новый Соответствие;
	сСтатей = Новый Соответствие;
	пСтатей = Новый Соответствие;            
	oСтатей = Новый Соответствие;
	УП_СметаПроекта.ПодготовкаФактБюджета(сСметы, сСтатей, пСтатей, oСтатей, ЗакупкаППЛО.ЗадачаПроекта);	
	
	РасходыППЛО = Справочники.СтатьиСметы.РасходыППЛО.ИмяПредопределенныхДанных;
	сСтатей[РасходыППЛО] = СуммаДокумента; 
	
	УП_СметаПроекта.ПроведениеФактБюджета(сСметы, сСтатей, oСтатей, Движения, ЗакупкаППЛО.ЗадачаПроекта, Дата, Дата);
	
	// до проведения !!!
	Остаток = Документы.ЗаявкаНаОплатуПоставщику.ПолучитьОстатокПоЗакупкеППЛО( Ссылка );
	Если Остаток < СуммаДокумента Тогда
		Сообщить("Недостаточный остаток по документу закупки " + Формат(Остаток - СуммаДокумента, "ЧЦ=15; ЧДЦ=2"));
		//Отказ = Истина;
	КонецЕсли;
	
	// регистр ОбеспеченоПоСтатье Расход
	Движения.ОбеспеченоПоСтатье.Записывать = Истина;
	Движение = Движения.ОбеспеченоПоСтатье.Добавить();
	Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
	Движение.Период 		= Дата;
	//Движение.Проект			= ЗакупкаППЛО.ЗадачаПроекта.Владелец;
	Движение.ЗадачаПроекта	= ЗакупкаППЛО.ЗадачаПроекта;
	Движение.СтатьяСметы	= Справочники.СтатьиСметы.РасходыППЛО;
	Движение.Сумма 			= СуммаДокумента;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
	И НЕ РазрешеноПроводитьДокумент( Ссылка, Ссылка.ЗакупкаППЛО.ЗадачаПроекта.Владелец ) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;		

КонецПроцедуры


