
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ИсполнительДокумента 	= ПараметрыСеанса.ТекущийПользователь;
	ГодПроекта				= 2016;
КонецПроцедуры

//Процедура ОбработкаПроведения(Отказ, Режим)
//	// регистр БюджетПоМесяцам 
//	Движения.БюджетПоМесяцам.Записывать = Истина;
//	Для Каждого ТекСтрокаНачисление Из Начисление Цикл
//		Движение = Движения.БюджетПоМесяцам.Добавить();
//		Движение.Период 		= Дата;
//		Движение.ЗадачаПроекта 	= ТекСтрокаНачисление.ЗадачаПроекта;
//		Движение.СтатьяСметы	= СтатьяНачисления;
//		Движение.ТипСуммы		= Перечисления.ТипСуммыБюджета.Факт;
//		Движение.Месяц			= НачалоМесяца( ПериодРегистрации );
//		Движение.Сумма			= ТекСтрокаНачисление.СуммаНачислено;
//		//
//		Движение.РКО			= Истина;
//	КонецЦикла;

//КонецПроцедуры


// 2017 04 07
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр БюджетПоМесяцам 
	Движения.БюджетПоМесяцам.Записывать = Истина;
	Для Каждого ТекСтрокаНачисление Из Начисление Цикл
		Движение = Движения.БюджетПоМесяцам.Добавить();
		Движение.Период 		= Дата;
		Движение.ЗадачаПроекта 	= ТекСтрокаНачисление.ЗадачаПроекта;
		Движение.СтатьяСметы	= СтатьяНачисления;
		Движение.ТипСуммы		= Перечисления.ТипСуммыБюджета.Факт;
		Движение.Месяц			= НачалоМесяца( ПериодРегистрации );
		Движение.Сумма			= ТекСтрокаНачисление.СуммаНачислено;
		//
		Движение.РКО			= Истина;
	КонецЦикла;
	
	// 2017 06 14
	
	//// регистр ФондПодразделений Приход
	//Движения.ФондПодразделений.Записывать = Истина;
	//Если СтатьяНачисления = Справочники.СтатьиСметы.Начисление_ФондПодр Тогда
	//	
	//	Движение 				= Движения.ФондПодразделений.Добавить();
	//	Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
	//	Движение.Период 		= Дата;
	//	Движение.Подразделение 	= Подразделение;
	//	Движение.Год 			= Год( ПериодРегистрации ) ;
	//	Движение.Сумма 			= Начисление.Итог("СуммаНачислено");
	//	
	//КонецЕсли;
КонецПроцедуры

