
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФизическоеЛицо", ПараметрКоманды);
	ПараметрыФормы.Вставить("Мне", 	  		  Истина);
	
	ОткрытьФорму("РегистрСведений.ИнцидентыИстория.Форма.ФормаПоручения", ПараметрыФормы, 
					ПараметрыВыполненияКоманды.Источник, 
					ПараметрыВыполненияКоманды.Уникальность, 
					ПараметрыВыполненияКоманды.Окно, 
					ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
