
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("ФизическоеЛицо", ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо);
	ПараметрыФормы = Новый Структура();
	
	ОткрытьФорму("Документ.ТабельУчетаРабочегоВремени.Форма.ФормаСпискаФизическогоЛица", 
	ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
