
&НаКлиенте
Процедура ПересчетПриИзменении(Элемент)
	Попытка	
		Объект.СкидкаВендора 	=  ?( Объект.СуммаАбонемента =0, 0, Окр( 100* (1 - Объект.СуммаВендора/Объект.СуммаАбонемента),0));
		СуммаОрганизации		= Объект.СуммаАбонемента	- Объект.СуммаВендора;
		
		СкидкаОплаты			= ?(Объект.СуммаАбонемента = 0, 0, 
									Окр( 100*(Объект.СуммаАбонемента-Объект.СуммаОплачено)/Объект.СуммаАбонемента,0));
								
		СуммаОстаток			= Объект.СуммаОплачено - Объект.СуммаВендора - Объект.СуммаНакладныеРасходы;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		ПересчетПриИзменении("");
КонецПроцедуры
