&НаСервереБезКонтекста
Функция  ПолучитьПроцентРКО( ЗадачаПроекта   )
	// из регистра	
	РКО = ПлановыйПоказательСметы( ЗадачаПроекта.Владелец.ГодПроекта , "СтавкаРКО" );
	Возврат РКО /100;
КонецФункции



&НаКлиенте
Процедура ОписаниеПриИзменении(Элемент)
	Стр = Элементы.Описание.ТекущиеДанные;
	Если Стр.РКО Тогда
		ПроцентРКО = ПолучитьПроцентРКО( Объект.ЗадачаПроекта );
		Стр.СуммаКонвертации	= Стр.Сумма *  ПроцентРКО;
	Иначе
		Стр.СуммаКонвертации	= 0;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИтогоПоДокументу()
	ВсегоРасход = Объект.Описание.Итог("Сумма") + Объект.Описание.Итог("СуммаКонвертации");
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИтогоПоДокументу()
КонецПроцедуры


#Область ЗаполнениеИзКалькулятора

&НаКлиенте
Процедура ЗаполнитьИзКалькулятора(Команда)
	Перем КалькуляторР;
	Если Объект.Проведен Тогда
		ПоказатьПредупреждение(,"Заполнить из калькулятора можно только непроведенный расход по задаче!");
		Возврат;
	КонецЕсли;
	
	ОпОповещения = Новый ОписаниеОповещения("ПодтвердитьЗаполнение", ЭтаФорма );
	ПоказатьВводЗначения( ОпОповещения, КалькуляторР,, Тип("СправочникСсылка.КалькуляторРасходаПоЗадаче"));
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьЗаполнение(КалькуляторР, ДопПараметры ) Экспорт
	Если КалькуляторР = Неопределено Тогда Возврат; КонецЕсли;
	
	ОпОповещения = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, КалькуляторР  );
	ПоказатьВопрос(ОпОповещения, "Заполнить текущий расход по задаче из выбранного калькулятора?",
						РежимДиалогаВопрос.ДаНет);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, КалькуляторР ) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьИзКалькулятораНаСервере( КалькуляторР );
		ИтогоПоДокументу();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзКалькулятораНаСервере( КалькуляторР )
	// ничего не проверяем проверяем 
	Док = РеквизитФормыВЗначение("Объект");
	ЗаполнитьЗначенияСвойств( Док, КалькуляторР );
	Описание  = КалькуляторР.Описание.Выгрузить();
	Док.Описание.Загрузить( Описание );
	
	ЗначениеВРеквизитФормы( Док, "Объект");
	
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры


#КонецОбласти