
Процедура ОбработкаПроведения(Отказ, Режим)	
	//Отбираем сметы, в которых заложены показатели расчета
	СписокЗадач = Новый СписокЗначений;
	СписокЗадач.ЗагрузитьЗначения(КоммерческоеВознаграждение.ВыгрузитьКолонку("ЗадачаПроекта"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СметаЗадачиПроекта.Ссылка,
	               |	СметаЗадачиПроекта.ЗадачаПроекта
	               |ИЗ
	               |	Документ.СметаЗадачиПроекта КАК СметаЗадачиПроекта
	               |ГДЕ
	               |	СметаЗадачиПроекта.ЗадачаПроекта В(&ЗадачаПроекта)";
	Запрос.УстановитьПараметр("ЗадачаПроекта",СписокЗадач);
	ТаблицаСмет = Запрос.Выполнить().Выгрузить();
	
	//Спецификация акта
	Для Каждого ТекКоммерческоеВознаграждение Из КоммерческоеВознаграждение Цикл
		//Если смет > 1
		Сметы = ТаблицаСмет.НайтиСтроки(Новый Структура("ЗадачаПроекта",ТекКоммерческоеВознаграждение.ЗадачаПроекта));
		Если Сметы.Количество() > 0 Тогда
			СметаЗадачиПроекта = Сметы[0].Ссылка; 	
		Иначе
			Продолжить;
		КонецЕсли;
		
		//Структура сметы
		сСметы 	= УП_СметаПроекта.ПолучитьСтруктуруСметыЗадачи( ТекКоммерческоеВознаграждение.ЗадачаПроекта.ГодЗадачи );
		
		//Состав сметы
		//Плановую сумму Дохода и ЛО/ПП нужно сохранить для определения доли
		РасходыППЛО = 0;
		Доход = 0;
		сСтатей = Новый Соответствие;
		пСтатей = Новый Соответствие;
		oСтатей = Новый Соответствие;
		Для Каждого статьяСметы Из СметаЗадачиПроекта.Расчет Цикл
			сСтатей[статьяСметы.ИмяСтатьи] = 0;
			пСтатей[статьяСметы.ИмяСтатьи] = статьяСметы.ЗначениеПараметра / 100;
			oСтатей[статьяСметы.ИмяСтатьи] = статьяСметы.Статья;
			
			Если статьяСметы.ИмяСтатьи = Справочники.СтатьиСметы.РасходыППЛО.ИмяПредопределенныхДанных Тогда 
				РасходыППЛО = статьяСметы.Сумма;
			КонецЕсли;
			Если статьяСметы.ИмяСтатьи = Справочники.СтатьиСметы.ДоходыВс.ИмяПредопределенныхДанных Тогда 
				Доход = статьяСметы.Сумма;
			КонецЕсли;
		КонецЦикла;
		
		ВознагрПосредника = Справочники.СтатьиСметы.ВознагрПосредника.ИмяПредопределенныхДанных;
		сСтатей[ВознагрПосредника] = пСтатей[ВознагрПосредника] * ТекКоммерческоеВознаграждение.Сумма; 
		
		РасходыВознПосредника = Справочники.СтатьиСметы.РасходыВознПосредника.ИмяПредопределенныхДанных;
		сСтатей[РасходыВознПосредника] = пСтатей[РасходыВознПосредника] * сСтатей[ВознагрПосредника]; 
		
		ДоходыВс = Справочники.СтатьиСметы.ДоходыВс.ИмяПредопределенныхДанных;
		сСтатей[ДоходыВс] = ТекКоммерческоеВознаграждение.Сумма - сСтатей[ВознагрПосредника] - сСтатей[РасходыВознПосредника]; 
		
		Если Доход <> 0 Тогда //Быть не должно, но всеже..
			РасходыППЛО = РасходыППЛО / Доход * сСтатей[ДоходыВс];
			ВознаграждениеКМ = Справочники.СтатьиСметы.ВознаграждениеКМ.ИмяПредопределенныхДанных;
			сСтатей[ВознаграждениеКМ] = (сСтатей[ДоходыВс] - РасходыППЛО) * пСтатей[ВознаграждениеКМ]; 
		КонецЕсли;
		
		//Пересчет
		УП_СметаПроекта.ПересчетСметыЗадачи( сСметы, сСтатей );
		
		//Бюджет факт
		Движения.БюджетПоМесяцам.Записывать = Истина;
		Для Каждого статьяСметы Из СметаЗадачиПроекта.Расчет Цикл
			Если сСтатей[статьяСметы.ИмяСтатьи] <> 0 Тогда 
				Движение = Движения.БюджетПоМесяцам.Добавить();
				Движение.Период 		= Дата;
				Движение.ЗадачаПроекта 	= ТекКоммерческоеВознаграждение.ЗадачаПроекта;
				Движение.СтатьяСметы 	= oСтатей[статьяСметы.ИмяСтатьи];
				Движение.ТипСуммы 		= Перечисления.ТипСуммыБюджета.Факт;  // факт
				Движение.Месяц 			= НачалоМесяца(Дата);
				Движение.Сумма          = сСтатей[статьяСметы.ИмяСтатьи];	
				Движение.РКО			= Истина;
			КонецЕсли;
		КонецЦикла;
		
		// регистр БонусыПоАктам Приход
	    Движения.БонусыПоАктам.Записывать = Истина;
		Для Каждого ТекСтрокаКоммерческоеВознаграждение Из КоммерческоеВознаграждение Цикл
			Движение = Движения.БонусыПоАктам.Добавить();
			Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
			Движение.Период 		= Дата;
			Движение.Акт			= Ссылка;
			Движение.ЗадачаПроекта 	= ТекСтрокаКоммерческоеВознаграждение.ЗадачаПроекта;
			Движение.Сумма 			= ТекСтрокаКоммерческоеВознаграждение.СуммаВознаграждения;
		КонецЦикла;
	
		//Добавить регистр по Реализации [#129609]
		//Реализация факт
		Движения.Реализация.Записывать = Истина;
		Движение 					= Движения.Реализация.Добавить();
		Движение.Период 			= Дата;
		Движение.ЗадачаПроекта 		= ТекКоммерческоеВознаграждение.ЗадачаПроекта;
		Движение.Договор 			= Ссылка.Договор;
		Движение.Месяц 				= НачалоМесяца( Дата );
		Движение.Факт = ТекКоммерческоеВознаграждение.Сумма;
	КонецЦикла;
КонецПроцедуры