
&НаКлиенте
Процедура УчащиесяПриИзменении(Элемент)
	Объект.СуммаДокумента = СуммаДокумента();
КонецПроцедуры


&НаСервереБезКонтекста
Функция СтоимостьКурса( Курс)
	Возврат Курс.Сумма;
КонецФункции // СтоимостьКурса()


&НаСервере
Процедура ПересчетСтоимостиОбучения()
	СтоимостьКурса = СтоимостьКурса( Объект.Курс );
	Для Каждого Уч ИЗ Объект.Учащиеся Цикл
		Уч.Сумма = СтоимостьКурса;
	КонецЦикла;

	Объект.СуммаДокумента = СуммаДокумента();
КонецПроцедуры // ПересчетСтоимостиОбучения()()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция СуммаДокумента()
	Возврат Объект.Учащиеся.Итог("Сумма");
КонецФункции // СуммаДокумента()



&НаКлиенте
Процедура КурсПриИзменении(Элемент)
	ПересчетСтоимостиОбучения();
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура РаспределитьСуммуПоУчащимся();
	Если СуммаДокумента() = 0 Тогда Возврат; КонецЕсли;
	
	МассивКоэфф = Новый Массив;
	Для Каждого Стр ИЗ Объект.Учащиеся Цикл
		// 
		БазаРаспределения = Стр.Сумма; //  
		МассивКоэфф.Добавить( БазаРаспределения );
	КонецЦикла;
	мРез = РаспределитьПропорционально( Объект.СуммаДокумента, МассивКоэфф);
	Для Каждого Стр ИЗ Объект.Учащиеся Цикл
		Если мРез <> Неопределено Тогда
			Стр.Сумма	= мРез[Объект.Учащиеся.Индекс(Стр)];
		Иначе
			Стр.Сумма	= 0;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // РаспределитьСуммуПоУчащимся();()


// сумму разделяем пропорционально указанной для каждого учащегося
&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	РаспределитьСуммуПоУчащимся();
	
КонецПроцедуры

&НаКлиенте
Процедура УчащиесяПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекущиеДанные = Элементы.Учащиеся.ТекущиеДанные;
	Если ТекущиеДанные.Сумма = 0 Тогда
		ТекущиеДанные.Сумма = СтоимостьКурса( Объект.Курс );
	КонецЕсли;
КонецПроцедуры
