&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить( "Отбор", 					Новый Структура("ЗадачаПроекта", ПараметрКоманды ));
	ПараметрыФормы.Вставить( "СформироватьПриОткрытии", Истина );
	ПараметрыФормы.Вставить( "КлючВарианта", 			"ИнцидентыЗадачиПроекта" );
	
	//
	ОткрытьФорму("Отчет.ИнцидентыЗадачиПроекта.Форма", 
					ПараметрыФормы, 
					ПараметрыВыполненияКоманды.Источник, 
					ПараметрыВыполненияКоманды.Уникальность, 
					ПараметрыВыполненияКоманды.Окно, 
					ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
