
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЗадачаПроекта", ПараметрКоманды );
	ПараметрыФормы.Вставить("СформироватьПриОткрытии",  Истина );
	ПараметрыФормы.Вставить("КлючВарианта",  "Основной");
	
	
	
	ОткрытьФорму("Отчет.ПланДоходовПоЗадачеПроекта.Форма.ФормаОтчета", ПараметрыФормы, 
			ПараметрыВыполненияКоманды.Источник, 
			ПараметрыВыполненияКоманды.Уникальность, 
			ПараметрыВыполненияКоманды.Окно);
	

КонецПроцедуры
