

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Проект") Тогда
		ЭлементОтбораДанных = Отчет.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораДанных.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Проект");
		ЭлементОтбораДанных.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно; //или например: = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии, или т.п.
	    ЭлементОтбораДанных.ПравоеЗначение 	= Параметры.Проект;
		ЭлементОтбораДанных.Использование 	= Истина;

	    //параметры открытия
	    Параметры.СформироватьПриОткрытии 	= Истина;
	    Параметры.КлючВарианта 				= "Сводно";
	КонецЕсли;

КонецПроцедуры

