Процедура СоздатьКалькуляциюПоДокументу( ЗакупкаППЛО );
	// 
	СпрОб = Справочники.КалькуляторСтоимостиППЛО.СоздатьЭлемент();
	
	СпрОб.Исполнитель	= ПараметрыСеанса.ТекущийПользователь;
	СпрОб.Наименование 	= ЗакупкаППЛО.ЗадачаПроекта.Наименование;
	// создаем схему в папке Менеджер/Год/Проект
	Родитель = СоздатьИерархию( "КалькуляторСтоимостиППЛО", 
								СокрЛП( СпрОб.Исполнитель ) + "/" + 
								СокрЛП( ЗакупкаППЛО.ЗадачаПроекта.Владелец.Наименование ));
	
	СпрОб.Родитель		= Родитель;
	ЗаполнитьЗначенияСвойств( СпрОб, ЗакупкаППЛО );
	
	Для Каждого СтрДЗ ИЗ ЗакупкаППЛО.Товар Цикл
		СтрТов = СпрОб.Товар.Добавить();
		ЗаполнитьЗначенияСвойств( СтрТов, СтрДЗ );
			
	КонецЦикла;
	
	Попытка
		СпрОб.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗакупкаППЛО") Тогда
		
		СоздатьКалькуляциюПоДокументу( ДанныеЗаполнения );
		СтандартнаяОбработка = Ложь;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Калькуляция для расчета ПП(ЛО)задачи проекта " 	+ Символы.ПС + 
						  СокрЛП( ДанныеЗаполнения.ЗадачаПроекта )			+ Символы.ПС + 
						  "создана";
						  
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Исполнитель = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры
