
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ИсполнительДокумента 	= ПараметрыСеанса.ТекущийПользователь;
	ПериодРегистрации		= НачалоМесяца( ТекущаяДата() );
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	СтатьяСметы = Справочники.СтатьиСметы.ФОТ_ПП;
	МесяцСметы	= НачалоМесяца( ПериодРегистрации );
	
	// регистр БюджетПоМесяцам 
	Движения.БюджетПоМесяцам.Записывать = Истина;
	Для Каждого ТекСтрокаРасходы Из Расходы Цикл
		Движение 	= Движения.БюджетПоМесяцам.Добавить();
		Движение.Период = Дата;
		Движение.ЗадачаПроекта 	= ТекСтрокаРасходы.ПланРабот.ЗадачаПроекта;
		Движение.СтатьяСметы	= СтатьяСметы;
		Движение.ТипСуммы 		= Перечисления.ТипСуммыБюджета.Факт; // факт
		Движение.Месяц 			= МесяцСметы;
		Движение.Сумма 			= ТекСтрокаРасходы.Сумма;
		//
		Движение.РКО			= Истина;
	КонецЦикла;

КонецПроцедуры
