&НаСервереБезКонтекста
Функция  ПересчетСуммыРасхода( РасходПоЗадаче )
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЗаявкаНаВыплатуРасхода.СуммаДокумента) КАК Сумма
		|ИЗ
		|	Документ.ЗаявкаНаВыплатуРасхода КАК ЗаявкаНаВыплатуРасхода
		|ГДЕ
		|	ЗаявкаНаВыплатуРасхода.Проведен
		|	И ЗаявкаНаВыплатуРасхода.РасходПоЗадаче = &РасходПоЗадаче";

	Запрос.УстановитьПараметр("РасходПоЗадаче", РасходПоЗадаче);

	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	Возврат Результат.Итог("Сумма");
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РасходПоЗадаче = ЭтаФорма.Параметры.Отбор["РасходПоЗадаче"];
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СуммаРасхода = ПересчетСуммыРасхода( РасходПоЗадаче );
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	СуммаРасхода = ПересчетСуммыРасхода( РасходПоЗадаче );
КонецПроцедуры
