&НаКлиенте
Процедура ПодсчетИтого()
	ИтогоВендору 	= Объект.Товар.Итог("СуммаПравоОбл") - Объект.СуммаДопОтВендора;
	ИтогоОтКлиента 	= Объект.СуммаДопОтКлиента + Объект.Товар.Итог("СуммаПП");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция  ПолучитьОтпускнуюЦену( Номенклатура, Дата)
	// 
	Возврат ЦенаНоменклатуры( Номенклатура, Справочники.ВидыЦен.ЦенаОтпускная, Дата );
КонецФункции


&НаСервереБезКонтекста
Функция  ПолучитьСкидку( Номенклатура )
	Возврат Номенклатура.СкидкаНаППЛО.Скидка;
КонецФункции

&НаКлиенте
Процедура ПересчетСтроки( Стр )
	Стр.СуммаПП 		= Стр.Цена 		* Стр.Количество;
	Стр.СуммаПравоОбл 	= Стр.СуммаПП	* (1 - Стр.Скидка / 100);
	Стр.СуммаДоход 		= Стр.СуммаПП 	- Стр.СуммаПравоОбл;
КонецПроцедуры

&НаКлиенте
Процедура ТоварЦенаПриИзменении(Элемент)
	Стр = Элементы.Товар.ТекущиеДанные;
	ПересчетСтроки( Стр );

КонецПроцедуры

&НаКлиенте
Процедура ТоварКоличествоПриИзменении(Элемент)
	Стр = Элементы.Товар.ТекущиеДанные;
	ПересчетСтроки( Стр );

КонецПроцедуры

&НаКлиенте
Процедура ТоварНоменклатураПриИзменении(Элемент)
	Стр 		= Элементы.Товар.ТекущиеДанные;
	Стр.Цена 	= ПолучитьОтпускнуюЦену( Стр.Номенклатура,	Объект.ДатаОплатыПравообладателю );
	Стр.Скидка  = ПолучитьСкидку( Стр.Номенклатура );
	ПересчетСтроки( Стр );

КонецПроцедуры

&НаКлиенте
Процедура ТоварПриИзменении(Элемент)
	ПодсчетИтого();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодсчетИтого();

КонецПроцедуры

&НаКлиенте
Процедура СуммаДопОтКлиентаПриИзменении(Элемент)
	ПодсчетИтого();

КонецПроцедуры

&НаКлиенте
Процедура СуммаДопОтВендораПриИзменении(Элемент)
	ПодсчетИтого();
КонецПроцедуры
